{"title":"Supporting Tablets and Handsets","text":"<p>\u539f\u6587\u94fe\u63a5\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/guide\/practices\/tablets-and-handsets.html#Guidelines\">http:\/\/docs.eoeandroid.com\/guide\/practices\/tablets-and-handsets.html#Guidelines<\/a>\n<\/p><p>\u4f5c\u8005\uff1a\u957f\u5251\u803f\u4ecb &amp; &amp;Monica &amp; ~ ~ELite~ ~ \n<\/p><p><br \/>\n<\/p>\n<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#.E6.94.AF.E6.8C.81.E5.B9.B3.E6.9D.BF.E7.94.B5.E8.84.91.E5.92.8C.E6.89.8B.E6.9C.BA\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">\u652f\u6301\u5e73\u677f\u7535\u8111\u548c\u624b\u673a<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#.E5.9F.BA.E6.9C.AC.E6.96.B9.E9.92.88\"><span class=\"tocnumber\">1.1<\/span> <span class=\"toctext\">\u57fa\u672c\u65b9\u9488<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#.E5.88.9B.E5.BB.BA.E5.8D.95.E7.AA.97.E6.A0.BC.E5.92.8C.E5.A4.9A.E7.AA.97.E6.A0.BC.E5.B8.83.E5.B1.80\"><span class=\"tocnumber\">1.2<\/span> <span class=\"toctext\">\u521b\u5efa\u5355\u7a97\u683c\u548c\u591a\u7a97\u683c\u5e03\u5c40<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Action_bar.28.E5.B7.A5.E5.85.B7.E6.A0.8F.29.E7.9A.84.E5.BA.94.E7.94.A8\"><span class=\"tocnumber\">1.3<\/span> <span class=\"toctext\">Action bar(\u5de5\u5177\u680f)\u7684\u5e94\u7528<\/span><\/a>\n<ul>\n<li class=\"toclevel-3 tocsection-5\"><a href=\"#.E5.BA.94.E7.94.A8.E5.88.86.E7.A6.BBAction_Bar\"><span class=\"tocnumber\">1.3.1<\/span> <span class=\"toctext\">\u5e94\u7528\u5206\u79bbAction Bar<\/span><\/a><\/li>\n<li class=\"toclevel-3 tocsection-6\"><a href=\"#.E5.BA.94.E7.94.A8.E2.80.9CUP.E2.80.9D.E5.AF.BC.E8.88.AA\"><span class=\"tocnumber\">1.3.2<\/span> <span class=\"toctext\">\u5e94\u7528\u201cUP\u201d\u5bfc\u822a<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#.E5.85.B6.E4.BB.96.E7.9A.84.E8.AE.BE.E8.AE.A1.E5.BB.BA.E8.AE.AE\"><span class=\"tocnumber\">1.4<\/span> <span class=\"toctext\">\u5176\u4ed6\u7684\u8bbe\u8ba1\u5efa\u8bae<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h1> <span class=\"mw-headline\" id=\".E6.94.AF.E6.8C.81.E5.B9.B3.E6.9D.BF.E7.94.B5.E8.84.91.E5.92.8C.E6.89.8B.E6.9C.BA\"> \u652f\u6301\u5e73\u677f\u7535\u8111\u548c\u624b\u673a <\/span><\/h1>\n<p>Android\u5e73\u53f0\u8fd0\u884c\u5728\u5404\u79cd\u5c4f\u5e55\u5c3a\u5bf8\u7684\u8bbe\u5907,\u7cfb\u7edf\u4f1a\u8c03\u6574\u5e94\u7528\u7a0b\u5e8fUI\u7684\u5927\u5c0f\uff0c\u4ee5\u9002\u5408\u6bcf\u4e2a\u8bbe\u5907\u3002 \u901a\u5e38\u60c5\u51b5\u4e0b\uff0c\u4f60\u6240\u9700\u8981\u505a\u7684\u662f\u8bbe\u8ba1\u7075\u6d3b\u7684UI\uff0c\u901a\u8fc7\u63d0\u4f9b\u66ff\u4ee3\u8d44\u6e90(<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/resources\/providing-resources.html#AlternativeResources\">alternative resources<\/a>)\u4f18\u5316\u4e00\u4e9b\u5143\u7d20\u9002\u7528\u4e8e\u4e0d\u540c\u5c3a\u5bf8\u7684\u8bbe\u5907\u3002\uff08\u5982\u8c03\u6574\u4e00\u4e9b\u89c6\u56fe\u6216\u6539\u53d8\u89c6\u56fe\u7684\u5c3a\u5bf8\u503c\u7b49\u66ff\u4ee3\u7684\u5e03\u5c40\uff09\u3002 \u4f46\u662f\uff0c\u6709\u65f6\u60a8\u53ef\u80fd\u5e0c\u671b\u8fdb\u4e00\u6b65\u5730\u4f18\u5316\u4e0d\u540c\u7684\u5c4f\u5e55\u5c3a\u5bf8\u4e0a\u6574\u4f53\u7684\u7528\u6237\u4f53\u9a8c\u3002\u4f8b\u5982\uff0c\u5e73\u677f\u7535\u8111\u63d0\u4f9b\u4e86\u66f4\u591a\u7684\u7a7a\u95f4\uff0c\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u53ef\u4ee5\u4e00\u6b21\u63d0\u51fa\u591a\u5957\u4fe1\u606f\uff0c\u800c\u624b\u673a\u8bbe\u5907\u901a\u5e38\u9700\u8981\u5206\u5272\u62c6\u5f00\u96c6\u5408\uff0c\u5206\u522b\u663e\u793a\u3002 \u56e0\u6b64\uff0c\u5373\u4f7f\u4e00\u4e2a\u4e3a\u624b\u673a\u8bbe\u8ba1\u7684UI\u53ef\u4ee5\u9002\u5f53\u8c03\u6574\u4ee5\u9002\u5e94\u5e73\u677f\u7535\u8111\uff0c\u4f46\u662f\u5b83\u6ca1\u6709\u5145\u5206\u5229\u7528\u5e73\u677f\u7535\u8111\u7684\u5c4f\u5e55\u6765\u63d0\u9ad8\u7528\u6237\u4f53\u9a8c\u7684\u6f5c\u529b\u3002\n<\/p><p>\u5230\u4e86Android 3.0\uff08API 11\u7ea7\uff09\uff0cAndroid\u7684\u63a8\u51fa\u4e86\u4e00\u5957\u65b0\u7684\u6846\u67b6\u7684API\uff0c\u4f7f\u60a8\u80fd\u591f\u66f4\u6709\u6548\u5730\u5229\u7528\u5927\u5c4f\u5e55\u8bbe\u8ba1\u6d3b\u52a8\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/Fragment.html\">Fragment<\/a>APIs\u3002 \u7247\u6bb5\uff08Fragments\uff09\u5141\u8bb8\u628a\u4f60\u7684UI\u4e2d\u4e0d\u540c\u7684\u884c\u4e3a\u7684\u7ec4\u4ef6\u5206\u6210\u72ec\u7acb\u7684\u90e8\u5206\u3002\u5f53\u8fd0\u884c\u5728\u5e73\u677f\u7535\u8111\u4e0a\u65f6\uff0c\u53ef\u4ee5\u5c06\u8fd9\u4e9b\u7ec4\u4ef6\u521b\u5efa\u6210\u591a\u7a97\u683c\u5e03\u5c40\uff0c\u6216\u5728\u624b\u673a\u4e0a\u8fd0\u884c\u65f6\uff0c\u653e\u7f6e\u5728\u5206\u5f00\u7684\u6d3b\u52a8\u4e2d\u8fd0\u884c\u3002 Android 3.0\u8fd8\u4ecb\u7ecd\u4e86<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">ActionBar<\/a>\uff0c\u5728\u5c4f\u5e55\u4e0a\u65b9\u63d0\u4f9b\u4e86\u4e00\u4e2a\u7528\u6765\u786e\u5b9a\u5e94\u7528\u7a0b\u5e8f\u4e13\u7528\u7684\u7528\u6237\u754c\u9762\uff0c\uff0c\u5e76\u63d0\u4f9b\u7528\u6237\u64cd\u4f5c\u548c\u5bfc\u822a\u3002\n<\/p><p>\u901a\u8fc7\u7247\u6bb5\uff08Fragments\uff09\u548c\u5de5\u5177\u680f\uff08action bar\uff09\u53ef\u4ee5\u5e2e\u52a9\u4f60\u521b\u5efa\u4e00\u4e2a\u72ec\u7279\u7684\u3001\u6700\u4f73\u7684\u7528\u6237\u4f53\u9a8c\u5e94\u7528\u7a0b\u5e8f\uff0c\u65e0\u8bba\u662f\u5728\u624b\u673a\u8fd8\u662f\u5728\u5e73\u677f\u7535\u8111\u4e0a\uff0c\u672c\u6587\u6863\u4f1a\u7ed9\u4f60\u63d0\u4f9b\u6307\u5bfc\u3002\n<\/p><p>\u5728\u9605\u8bfb\u672c\u6307\u5357\u4e4b\u524d\uff0c\u5efa\u8bae\u60a8\u5148\u9605\u8bfb <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/practices\/screens_support.html\">Supporting Multiple Screens<\/a>\u7684\u6307\u5bfc\u3002 \u8be5\u6587\u6863\u5206\u522b\u4ecb\u7ecd\u4e86\u5f00\u53d1\u652f\u6301\u4e0d\u540c\u7684\u5c4f\u5e55\u5c3a\u5bf8\u3001\u7075\u6d3b\u5e03\u5c40\u548c\u66ff\u4ee3\u4f4d\u56fe\u7684\u5bc6\u5ea6\u7684\u7528\u6237\u754c\u9762\u7684\u57fa\u672c\u8bbe\u8ba1\u539f\u5219\u3002\n<\/p><p><br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\".E5.9F.BA.E6.9C.AC.E6.96.B9.E9.92.88\"> \u57fa\u672c\u65b9\u9488 <\/span><\/h2>\n<p>\u8fd9\u91cc\u6709\u4e00\u4e9b\u6307\u5bfc\u5c06\u4f1a\u5e2e\u52a9\u60a8\u521b\u5efa\u4e00\u4e2a\u63d0\u4f9b\u4f18\u5316\u7684\u7528\u6237\u4f53\u9a8c\u5e94\u7528\u7a0b\u5e8f\uff0c\u65e0\u8bba\u662f\u5728\u5728\u5e73\u677f\u7535\u8111\u8fd8\u662f\u5728\u624b\u673a\u4e0a\uff1a\n<\/p><p>\u2022<b>\u5728\u7247\u6bb5\uff08fragmennts\uff09\u57fa\u7840\u4e0a\u521b\u5efa\u60a8\u7684\u6d3b\u52a8\uff08activity\uff09<\/b>\u53ef\u4ee5\u5bf9\u4e0d\u540c\u7ec4\u5408\u91cd\u590d\u4f7f\u7528\u2014\u2014\u5728\u591a\u7a97\u683c\u5e03\u5c40\u7684\u5e73\u677f\u7535\u8111\u6216\u662f\u5355\u7a97\u53e3\u5e03\u5c40\u7684\u624b\u673a\u4e0a\u3002\n\u4e00\u4e2a<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/Fragment.html\">Fragment<\/a>\u4ee3\u8868\u4e86\u4e00\u79cd\u884c\u4e3a\uff0c\u6216\u662f\u6d3b\u52a8\u4e2d\u7684\u7528\u6237\u754c\u9762\u7684\u4e00\u90e8\u5206\u3002 \u4f60\u53ef\u4ee5\u628a\u4e00\u4e2a\u7247\u6bb5\u4f5c\u4e3a\u4e00\u4e2a\u6d3b\u52a8\u7684\u6a21\u5757\u5316\u90e8\u5206\uff08\u4e00\u4e2a\u6d3b\u52a8\u7684\u201c\u7247\u6bb5\u201d\uff09\uff0c\u5b83\u6709\u81ea\u5df1\u7684\u751f\u547d\u5468\u671f\uff0c\u5728\u6d3b\u52a8\u8fd0\u884c\u65f6\uff0c\u4f60\u8fd8\u53ef\u4ee5\u6dfb\u52a0\u6216\u79fb\u9664\u5b83\u3002\n\u5982\u679c\u4f60\u8fd8\u6ca1\u6709\u4f7f\u7528\u8fc7\u7684\u7247\u6bb5\uff0c\u4ece\u9605\u8bfb\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/Fragment.html\">Fragment<\/a>\u5f00\u53d1\u4eba\u5458\u6307\u5357\u5f00\u59cb\u5427\u3002\n<\/p><p>\u2022<b>\u4f7f\u7528\u5de5\u5177\u680f\uff08action bar\uff09<\/b> \uff0c\u4f46\u5f97\u6309\u7167\u6700\u4f73\u505a\u6cd5\uff0c\u5e76\u786e\u4fdd\u60a8\u7684\u8bbe\u8ba1\u975e\u5e38\u7075\u6d3b\u4f7f\u5f97\u7cfb\u7edf\u80fd\u6839\u636e\u5c4f\u5e55\u7684\u5927\u5c0f\u8c03\u6574\u64cd\u5de5\u5177\u680f\u5e03\u5c40\u3002\n<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">ActionBar<\/a>\u662f\u7528\u6765\u53d6\u4ee3\u6d3b\u52a8\uff08activity\uff09\u4e2d\u5c4f\u5e55\u9876\u90e8\u4f20\u7edf\u6807\u9898\u680f\u7684\u4e00\u4e2aUI\u7ec4\u4ef6\u3002 \u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff0c\u5de5\u5177\u680f\u7684\u5de6\u4fa7\u662f\u5e94\u7528\u7a0b\u5e8f\u6807\u8bc6\uff08logo\uff09\uff0c\u5176\u6b21\u662f\u6d3b\u52a8\u6807\u9898\uff0c\u53f3\u4fa7\u662f \u201c\u9009\u9879\u201d\u83dc\u5355\u4e0a\u7684\u9879\u76ee\u3002\n<\/p><p>\u60a8\u53ef\u4ee5\u628a\u9009\u9879\u83dc\u5355\u4e2d\u7684\u9879\u76ee\u76f4\u63a5\u663e\u793a\u5728\u5de5\u5177\u680f\u4e2d\u7684\u201c\u5de5\u5177\u9879\u76ee\u201d\u4e2d\u3002 \u60a8\u8fd8\u53ef\u4ee5\u6dfb\u52a0\u5bfc\u822a\u529f\u80fd\u5230\u5de5\u5177\u680f\uff0c\u5982\u6807\u7b7e\u6216\u4e0b\u62c9\u5217\u8868\u4e2d\uff0c\u5e76\u4e14\u4f7f\u7528\u5e94\u7528\u7a0b\u5e8f\u7684\u56fe\u6807\u6765\u8865\u5145\u7cfb\u7edf\u8fd4\u56de\u6309\u94ae\u7684\u884c\u4e3a\uff0c\u4ee5\u5bfc\u822a\u5230\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u201c\u4e3b\u754c\u9762\uff08home\uff09\u201d\u6216\u5230\u8fbe\u5e94\u7528\u7a0b\u5e8f\u7684\u7ed3\u6784\u5c42\u6b21\u7684\u4e0a\u5c42\u3002\n\u672c\u6307\u5357\u63d0\u4f9b\u4e86\u540c\u65f6\u652f\u6301\u5e73\u677f\u7535\u8111\u548c\u624b\u673a\u7684\u5de5\u5177\u680f\u4f7f\u7528\u65b9\u5f0f\u7684\u4e00\u4e9b\u6280\u5de7\u3002 \u6b32\u77e5\u5de5\u5177\u680f\uff08action bar\uff09API\u7684\u8be6\u7ec6\u8ba8\u8bba\uff0c\u8bf7\u53c2\u9605\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/ui\/actionbar.html\">Action Bar<\/a>\u5f00\u53d1\u4eba\u5458\u6307\u5357\u3002\n<\/p><p>\u2022<b>\u5b9e\u73b0\u7075\u6d3b\u7684\u5e03\u5c40<\/b> \uff0c\u6b63\u5982\u5728\u6700\u4f73\u5b9e\u8df5\uff08<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/practices\/screens_support.html#screen-independence\">Best Practices<\/a>\uff09\u4e2d\u5bf9\u652f\u6301\u591a\u5c4f\u5e55\u7684\u8ba8\u8bba\uff0c \u8981\u50cf\u7f51\u9875\u8bbe\u8ba1\u5e08\u4e00\u6837\u601d\u8003 (<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/android-developers.blogspot.com\/2011\/09\/thinking-like-web-designer.html\">Thinking Like a Web Designer<\/a>)\u3002\n<\/p><p>\u4e00\u4e2a\u7075\u6d3b\u7684\u5e03\u5c40\u8bbe\u8ba1\u8ba9\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u80fd\u591f\u9002\u5e94\u5c4f\u5e55\u5c3a\u5bf8\u7684\u53d8\u5316\u3002 \u6b63\u5982\u5e73\u677f\u7535\u8111\u7684\u5c3a\u5bf8\u4e0d\u5c3d\u76f8\u540c\uff0c\u624b\u673a\u4e5f\u6709\u7740\u4e0d\u540c\u5c3a\u5bf8\u3002\u5c3d\u7ba1\u4f60\u53ef\u80fd\u4f1a\u4e3a\u201c\u5e73\u677f\u7535\u8111\u201d\u548c\u201c\u624b\u673a\u201d\u63d0\u4f9b\u4e0d\u540c\u7684\u7247\u6bb5\uff08fragment\uff09\u7ec4\u5408\uff0c\u4f46\u4f7f\u5f97\u6bcf\u4e2a\u8bbe\u8ba1\u90fd\u80fd\u591f\u7075\u6d3b\u8c03\u6574\u5176\u5927\u5c0f\u5c3a\u5bf8\u548c\u9ad8\u5bbd\u6bd4\u4ecd\u7136\u662f\u5fc5\u8981\u7684\u3002\n\u4ee5\u4e0b\u5404\u8282\u5c06\u4f1a\u8be6\u7ec6\u8ba8\u8bba\u524d\u4e24\u4e2a\u5efa\u8bae\u3002 \u6b32\u4e86\u89e3\u66f4\u591a\u6709\u5173\u521b\u5efa\u7075\u6d3b\u7684\u5e03\u5c40\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u4e0a\u9762\u63d0\u4f9b\u7684\u94fe\u63a5\u3002\n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #F7F7F7; border-left:4px solid; border-color:#258AAF;\">\n<p><b>\u6ce8\uff1a<\/b>\u9664\u4e86\u5728\u5de5\u5177\u680f\u7684\u4e00\u4e2a\u7279\u70b9\uff08\u8bd1\u8005\u6309\uff1a\u6307\u4e0a\u9762\u7684\u6700\u4f73\u5b9e\u8df5\uff08<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/practices\/screens_support.html#screen-independence\">Best Practices<\/a>\uff09\u548c\u8981\u50cf\u7f51\u9875\u8bbe\u8ba1\u5e08\u4e00\u6837\u601d\u8003 (<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/android-developers.blogspot.com\/2011\/09\/thinking-like-web-designer.html\">Thinking Like a Web Designer<\/a>)\uff09\uff0c\u6240\u6709\u7684API\u9700\u8981\u5b8c\u6210\u672c\u6587\u6863\u4e2d\u7684\u5efa\u8bae\u90fd\u53ef\u4ee5\u5728Android 3.0\u67e5\u8be2\u3002 \u6b64\u5916\uff0c\u60a8\u751a\u81f3\u53ef\u4ee5\u5b9e\u73b0\u7247\u6bb5\u7684\u8bbe\u8ba1\u6a21\u5f0f\uff0c\u5e76\u901a\u8fc7\u4f7f\u7528\u652f\u6301\u5e93\u6765\u4fdd\u6301\u4e0eAndroid 1.6\u7684\u5411\u540e\u517c\u5bb9\uff0c\u8fd9\u4e9b\u5728\u4e0b\u9762\u7684\u4fa7\u680f\u53ef\u4ee5\u67e5\u8be2\u3002\n<\/p>\n<\/div>\n<p><br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\".E5.88.9B.E5.BB.BA.E5.8D.95.E7.AA.97.E6.A0.BC.E5.92.8C.E5.A4.9A.E7.AA.97.E6.A0.BC.E5.B8.83.E5.B1.80\">\u521b\u5efa\u5355\u7a97\u683c\u548c\u591a\u7a97\u683c\u5e03\u5c40<\/span><\/h2>\n<p><br \/>\n\u6700\u6709\u6548\u7684\u65b9\u6cd5\u662f\u8981\u7ed3\u5408\u4e0d\u540c\u7684\u65b9\u5f0f\u6765\u521b\u5efa\u201c\u5355\u7a97\u683c\u4e2d\u7684\u201d\u5e03\u5c40\u624b\u673a\u548c\u201c\u591a\u7a97\u683c\u4e2d\u7684\u201d\u5e03\u5c40\u7247\u7684\u7247\u6bb5\uff0c\u6765\u4f18\u5316\u60a8\u7684\u624b\u673a\u548c\u5e73\u677f\u7535\u8111\u7684\u5e94\u7528\u7a0b\u5e8f\u3002\u4f8b\u5982\uff0c\u5728\u5e73\u677f\u7535\u8111\u4e0a\u7684\u65b0\u95fb\u5e94\u7528\u7a0b\u5e8f\u53ef\u80fd\u4f1a\u5728\u5de6\u4fa7\u663e\u793a\u6587\u7ae0\u5217\u8868\u7684\uff0c\u5728\u53f3\u4fa7\u663e\u793a\u5217\u8868\u4e2d\u6240\u9009\u62e9\u7684\u6587\u7ae0\u5185\u5bb9\u3002\u7136\u800c\uff0c\u5728\u624b\u673a\u4e0a\uff0c\u8fd9\u4e24\u4e2a\u90e8\u5206\u5e94\u51fa\u73b0\u5728\u5355\u72ec\u7684\u5c4f\u5e55\u4e0a\uff0c\u4ece\u5217\u8868\u4e2d\u9009\u62e9\u4e00\u7bc7\u6587\u7ae0\u6807\u9898\u540e\u8fdb\u5165\u5230\u5168\u5c4f\u663e\u793a\u8be5\u6587\u7ae0\u3002<br \/>\n<br \/>\n\u6709\u4e24\u79cd\u6280\u672f\u6765\u5b9e\u73b0\u8fd9\u79cd\u8bbe\u8ba1\u7684\u7247\u6bb5\uff1a<br \/>\n<\/p>\n<ul><li>\u5bf9\u4e8e\u4efb\u4f55\u5c4f\u5e55\uff0c\u5176\u4e2d\u663e\u793a\u60a8\u7684\u5e73\u677f\u7535\u8111\u7248\u672c\u7684\u591a\u4e2a\u7247\u6bb5\uff0c\u4e3a\u624b\u673a\u4f7f\u7528\u76f8\u540c\u7684\u6d3b\u52a8\uff0c\u4f46\u4e00\u6b21\u53ea\u663e\u793a\u4e00\u4e2a\u7247\u6bb5 - \u5185\u6d3b\u52a8\uff0c\u5728\u5fc5\u8981\u65f6\u4ea4\u6362\u7684\u7247\u6bb5\u3002<br \/>\n<\/li><\/ul>\n<p><br \/>\n<\/p>\n<ul><li>\u5728\u624b\u673a\u4e0a\u4f7f\u7528\u5355\u72ec\u7684\u6d3b\u52a8\uff0c\u4e3b\u529e\u6bcf\u4e2a\u7247\u6bb5\u3002\u4f8b\u5982\uff0c\u5f53\u7247\u5242UI\u4f7f\u7528\u4e00\u4e2a\u6d3b\u52a8\u7684\u4e24\u4e2a\u7247\u6bb5\uff0c\u9002\u7528\u4e8e\u624b\u6301\u8bbe\u5907\u4e2d\u4f7f\u7528\u7684\u76f8\u540c\u7684\u6d3b\u6027\uff0c\u4f46\u63d0\u4f9b\u4e00\u4e2a\u66ff\u4ee3\u7684\u5e03\u5c40\uff0c\u5305\u62ec\u53ea\u6709\u4e00\u4e2a\u7247\u6bb5\u3002\u5f53\u4f60\u9700\u8981\u5207\u6362\u7247\u6bb5\uff08\u4f8b\u5982\uff0c\u5f53\u7528\u6237\u9009\u62e9\u4e00\u4e2a\u9879\u76ee\uff09\uff0c\u542f\u52a8\u53e6\u4e00\u4e2a\u6d3b\u52a8\u4e3e\u529e\u7684\u5176\u4ed6\u7247\u6bb5\u3002<br \/>\n<\/li><\/ul>\n<p><br \/>\n\u60a8\u9009\u62e9\u7684\u65b9\u6cd5\u53d6\u51b3\u4e8e\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u8bbe\u8ba1\u548c\u4e2a\u4eba\u559c\u597d\u3002\u5728\u7b2c\u4e00\u4e2a\u9009\u9879\uff08\u5355\u4e2a\u6d3b\u52a8\uff09\u9700\u8981\u4f60\u52a8\u6001\u6dfb\u52a0\u7684\u6bcf\u4e2a\u7247\u6bb5\u7684\u6d3b\u6027\uff0c\u5728\u8fd0\u884c\u65f6---\u800c\u4e0d\u662f\u5ba3\u5e03\u5728\u60a8\u7684\u6d3b\u52a8\u7684\u5e03\u5c40\u6587\u4ef6\u7684\u7247\u6bb5 - \u56e0\u4e3a\u4f60\u53ef\u4ee5\u4e0d\u5220\u9664\u6d3b\u52a8\u4e2d\u7684\u4e00\u4e2a\u7247\u6bb5\uff0c\u5982\u679c\u5b83\u7684\u5df2\u8fd0\u884c\u5728XML\u5e03\u5c40\u4e2d\u3002\u60a8\u53ef\u80fd\u8fd8\u9700\u8981\u66f4\u65b0\u64cd\u4f5c\u680f\u4e2d\u7684\u6bcf\u4e2a\u65f6\u95f4\u7247\u6bb5\u7684\u53d8\u5316\uff0c\u8fd9\u53d6\u51b3\u4e8e\u4ec0\u4e48\u6837\u7684\u884c\u52a8\u6216\u5bfc\u822a\u6a21\u5f0f\u63d0\u4f9b\u7684\u7247\u6bb5\u3002\u5728\u67d0\u4e9b\u60c5\u51b5\u4e0b\uff0c\u8fd9\u4e9b\u56e0\u7d20\u53ef\u80fd\u4e0d\u4f1a\u5f71\u54cd\u5230\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\uff0c\u56e0\u6b64\uff0c\u4f7f\u7528\u4e00\u4e2a\u4e92\u52a8\u7684\u788e\u7247\u4f1a\u4f7f\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5f88\u597d\u5730\u5de5\u4f5c\u3002\u7136\u800c\uff0c\u5728\u5176\u4ed6\u60c5\u51b5\u4e0b\uff0c\u53ea\u4f7f\u7528\u4e00\u4e2a\u4e92\u52a8\u4ea4\u6362\u7247\u6bb5\u4e5f\u53ef\u4ee5\u4f7f\u4f60\u7684\u4ee3\u7801\u66f4\u590d\u6742\uff0c\u56e0\u4e3a\u4f60\u5fc5\u987b\u7ba1\u7406\u6240\u6709\u6d3b\u52a8\u7684\u4ee3\u7801\uff0c\u800c\u4e0d\u662f\u5229\u7528\u66ff\u4ee3\u5e03\u5c40\u6587\u4ef6\u7684\u7247\u6bb5\u7ec4\u5408\u3002<br \/>\n<br \/>\n\u672c\u6587\u8c08\u7684\u7b2c\u4e8c\u4e2a\u9009\u9879\uff0c\u66f4\u8be6\u7ec6\u3002\u8fd9\u53ef\u80fd\u662f\u4e00\u4e2a\u591a\u4e00\u70b9\u7684\u524d\u671f\u5de5\u4f5c\uff0c\u5fc5\u987b\u5f88\u597d\u5730\u64cd\u4f5c\uff0c\u56e0\u4e3a\u6bcf\u4e2a\u7247\u6bb5\u5206\u5e03\u5728\u4e0d\u540c\u7684\u6d3b\u52a8\uff0c\u4f46\u5b83\u901a\u5e38\u80fd\u4f7f\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u53d8\u7684\u66f4\u597d\u3002\u8fd9\u610f\u5473\u7740\u4f60\u53ef\u4ee5\u4f7f\u7528\u5176\u4ed6\u7684\u5e03\u5c40\u6587\u4ef6\u5b9a\u4e49\u4e0d\u540c\u7684\u7247\u6bb5\u7ec4\u5408\uff0c\u4fdd\u6301\u7247\u6bb5\u4ee3\u7801\u7684\u6a21\u5757\u5316\uff0c\u7b80\u5316\u64cd\u4f5c\u680f\u4e2d\u7684\u7ba1\u7406\uff0c\u8ba9\u7cfb\u7edf\u6765\u5904\u7406\u6240\u6709\u7684\u540e\u9000\u5806\u6808\u5de5\u4f5c\u3002<br \/>\n<br \/>\n\u4e0b\u56fe\u6f14\u793a\u4e86\u5982\u4f55\u53ef\u4ee5\u5b89\u6392\u4f7f\u7528\u5355\u72ec\u7684\u6d3b\u52a8\u65f6\uff0c\u4e3a\u624b\u673a\u8bbe\u8ba1\u7684\u624b\u673a\u548c\u5e73\u677f\u7535\u8111\u5e94\u7528\u7a0b\u5e8f\u7684\u4e24\u4e2a\u7247\u6bb5\uff1a<br \/>\n<img src=\"http:\/\/docs.eoeandroid.com\/images\/fundamentals\/fragments.png\" alt=\"fragments.png\" \/><br \/>\n<br \/>\n\u5728\u8fd9\u4e2a\u7a0b\u5e8f\uff0c\u6d3b\u52a8\uff0c\u4e00\u4e2a\u662f\u201c\u4e3b\u8981\u6d3b\u52a8\u201d\u7684\u65f6\u95f4\uff0c\u8fd9\u53d6\u51b3\u4e8e\u5927\u5c0f\u7684\u5c4f\u5e55\u4e0a\u663e\u793a\u4e00\u4e2a\u6216\u4e24\u4e2a\u7247\u6bb5\uff0c\u5e76\u4f7f\u7528\u4e0d\u540c\u7684\u5e03\u5c40\u3002\u4e00\u4e2a\u624b\u673a\u5927\u5c0f\u7684\u5c4f\u5e55\u4e0a\u65f6\uff0c\u5e03\u5c40\u53ea\u5305\u542b\u7247\u6bb5A\uff08\u5217\u8868\u89c6\u56fe\uff09\u7684\u4e00\u4e2a\u836f\u7247\u5927\u5c0f\u7684\u5c4f\u5e55\u4e0a\u65f6\uff0c\u5e03\u5c40\u5305\u542b\u7247\u6bb5A\u548c\u7247\u6bb5B.<br \/>\n<br \/>\n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #F7F7F7; border-left:4px solid; border-color:#258AAF;\">\n<p>\u6ce8\uff1a\u6d3b\u52a8B\u4ece\u6765\u6ca1\u6709\u5728\u5e73\u677f\u7535\u8111\u4e0a\u4f7f\u7528\u3002\u8fd9\u662f\u4e00\u4e2a\u7b80\u5355\u7684\u5bb9\u5668\u5448\u73b0\u7247\u6bb5B\uff0c\u6240\u4ee5\u53ea\u7528\u5728\u624b\u6301\u8bbe\u5907\u7684\u4e24\u4e2a\u7247\u6bb5\u65f6\uff0c\u5fc5\u987b\u5206\u522b\u663e\u793a\u3002<br \/>\n<\/p>\n<\/div>\n<p><br \/>\n\u6839\u636e\u4e0d\u540c\u7684\u5c4f\u5e55\u5c3a\u5bf8\uff0c\u8be5\u7cfb\u7edf\u9002\u7528\u4e8e\u4e0d\u540c\u7684main.xml\u7684\u5e03\u5c40\u6587\u4ef6\uff1a<br \/>\nres\/layout\/main.xml \u624b\u673a\u5e03\u5c40<br \/>\n<\/p>\n<pre class=\"xml\">&#160;\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;?xml<\/span> <span style=\"color: #000066;\">version<\/span>=<span style=\"color: #ff0000;\">&quot;1.0&quot;<\/span> <span style=\"color: #000066;\">encoding<\/span>=<span style=\"color: #ff0000;\">&quot;utf-8&quot;<\/span><span style=\"font-weight: bold; color: black;\">?&gt;<\/span><\/span>\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;FrameLayout<\/span> <span style=\"color: #000066;\">xmlns:android<\/span>=<span style=\"color: #ff0000;\">&quot;http:\/\/schemas.android.com\/apk\/res\/android&quot;<\/span>\n    <span style=\"color: #000066;\">android:layout_width<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span>\n    <span style=\"color: #000066;\">android:layout_height<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span><span style=\"font-weight: bold; color: black;\">&gt;<\/span><\/span>\n    <span style=\"color: #009900;\"><span style=\"color: #808080; font-style: italic;\">&lt;!-- &quot;Fragment A&quot; --&gt;<\/span><\/span>\n    <span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;fragment<\/span> <span style=\"color: #000066;\">class<\/span>=<span style=\"color: #ff0000;\">&quot;com.example.android.TitlesFragment&quot;<\/span>\n              <span style=\"color: #000066;\">android:id<\/span>=<span style=\"color: #ff0000;\">&quot;@+id\/list_frag&quot;<\/span>\n              <span style=\"color: #000066;\">android:layout_width<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span>\n              <span style=\"color: #000066;\">android:layout_height<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span><span style=\"font-weight: bold; color: black;\">\/&gt;<\/span><\/span>\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;\/FrameLayout<span style=\"font-weight: bold; color: black;\">&gt;<\/span><\/span><\/span>\n&#160;<\/pre>\n<p><br \/>\nres\/layout-large\/main.xml \u5e73\u677f\u5e03\u5c40:<br \/>\n<\/p>\n<pre class=\"xml\">&#160;\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;?xml<\/span> <span style=\"color: #000066;\">version<\/span>=<span style=\"color: #ff0000;\">&quot;1.0&quot;<\/span> <span style=\"color: #000066;\">encoding<\/span>=<span style=\"color: #ff0000;\">&quot;utf-8&quot;<\/span><span style=\"font-weight: bold; color: black;\">?&gt;<\/span><\/span>\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;LinearLayout<\/span> <span style=\"color: #000066;\">xmlns:android<\/span>=<span style=\"color: #ff0000;\">&quot;http:\/\/schemas.android.com\/apk\/res\/android&quot;<\/span>\n  <span style=\"color: #000066;\">android:orientation<\/span>=<span style=\"color: #ff0000;\">&quot;horizontal&quot;<\/span>\n  <span style=\"color: #000066;\">android:layout_width<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span>\n  <span style=\"color: #000066;\">android:layout_height<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span>\n  <span style=\"color: #000066;\">android:id<\/span>=<span style=\"color: #ff0000;\">&quot;@+id\/frags&quot;<\/span><span style=\"font-weight: bold; color: black;\">&gt;<\/span><\/span>\n    <span style=\"color: #009900;\"><span style=\"color: #808080; font-style: italic;\">&lt;!-- &quot;Fragment A&quot; --&gt;<\/span><\/span>\n  <span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;fragment<\/span> <span style=\"color: #000066;\">class<\/span>=<span style=\"color: #ff0000;\">&quot;com.example.android.TitlesFragment&quot;<\/span>\n            <span style=\"color: #000066;\">android:id<\/span>=<span style=\"color: #ff0000;\">&quot;@+id\/list_frag&quot;<\/span>\n            <span style=\"color: #000066;\">android:layout_width<\/span>=<span style=\"color: #ff0000;\">&quot;@dimen\/titles_size&quot;<\/span>\n            <span style=\"color: #000066;\">android:layout_height<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span><span style=\"font-weight: bold; color: black;\">\/&gt;<\/span><\/span>\n    <span style=\"color: #009900;\"><span style=\"color: #808080; font-style: italic;\">&lt;!-- &quot;Fragment B&quot; --&gt;<\/span><\/span>\n  <span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;fragment<\/span> <span style=\"color: #000066;\">class<\/span>=<span style=\"color: #ff0000;\">&quot;com.example.android.DetailsFragment&quot;<\/span>\n            <span style=\"color: #000066;\">android:id<\/span>=<span style=\"color: #ff0000;\">&quot;@+id\/details_frag&quot;<\/span>\n            <span style=\"color: #000066;\">android:layout_width<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span>\n            <span style=\"color: #000066;\">android:layout_height<\/span>=<span style=\"color: #ff0000;\">&quot;match_parent&quot;<\/span> <span style=\"font-weight: bold; color: black;\">\/&gt;<\/span><\/span>\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;\/LinearLayout<span style=\"font-weight: bold; color: black;\">&gt;<\/span><\/span><\/span>\n&#160;<\/pre>\n<p><br \/>\n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #F7F7F7; border-left:4px solid; border-color:#258AAF;\">\n<p>Note: Although the above sample layout for tablets is based on the \"large\" screen configuration qualifier, you should also use the new \"minimum width\" size qualifiers in order to more precisely control the screen size at which the system applies your handset or tablet layout. See the sidebar for more information.\n<\/p>\n<\/div>\n<p>\u5e94\u7528\u7a0b\u5e8f\u7684\u54cd\u5e94\uff0c\u5f53\u7528\u6237\u4ece\u5217\u8868\u4e2d\u9009\u62e9\u4e00\u4e2a\u9879\u76ee\uff0c\u53d6\u51b3\u4e8e\u662f\u5426\u662f\u7247\u6bb5B\u5728\u5e03\u5c40\u3002\u5982\u679c\u7247\u6bb5B\u662f\u5b58\u5728\u7684\uff0c\u6d3b\u52a8\u901a\u77e5\u7247\u6bb5B\u8fdb\u884c\u81ea\u6211\u66f4\u65b0\u3002\u5982\u679c\u7247\u6bb5B\u662fA\u5f00\u59cb\u5728\u5e03\u5c40\uff0c\u7247\u6bb5A\u4e3b\u6301\u7247\u6bb5B\u3002<br \/>\n<br \/>\n\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u8981\u5b9e\u73b0\u8fd9\u79cd\u6a21\u5f0f\uff0c\u9700\u8981\u5c06\u4f60\u7684\u7247\u6bb5\u9ad8\u5ea6\u6761\u5757\u5206\u5272\uff0c\u8fd9\u4e00\u70b9\u5f88\u91cd\u8981\u3002\u5177\u4f53\u800c\u8a00\uff0c\u4f60\u5e94\u8be5\u9075\u5faa\u4e24\u4e2a\u901a\u7528\u7684\u51c6\u5219\uff1a<br \/>\n\u2022\t\u8bf7\u52ff\u76f4\u63a5\u64cd\u4f5c\u5176\u4ed6\u7684\u67d0\u4e2a\u7247\u6bb5\u3002<br \/>\n\u2022\t\u4fdd\u7559\u6240\u6709\u4ee3\u7801\uff0c\u6d89\u53ca\u7684\u5185\u5bb9\u6709\u5b50\u7247\u6bb5\uff0c\u800c\u4e0d\u662f\u5728\u4e3b\u673a\u6d3b\u52a8\u7684\u4ee3\u7801\u7247\u6bb5\u3002<br \/>\n<br \/>\n\u4e3a\u4e86\u907f\u514d\u4ece\u4e00\u4e2a\u7247\u6bb5\u4e2d\u76f4\u63a5\u8c03\u7528\u7684\u53e6\u4e00\u4e2a\u7247\u6bb5\uff0c\u5728\u6bcf\u4e2a\u7247\u6bb5\u4e2d\uff0c\u7c7b\u58f0\u660e\u4e00\u4e2a\u56de\u8c03\u63a5\u53e3\uff0c\u5b83\u53ef\u4ee5\u4f7f\u7528\u4e8b\u4ef6\u4f20\u9001\u7ed9\u4e3b\u673a\u7684\u6d3b\u52a8\uff0c\u5b9e\u73b0\u56de\u8c03\u63a5\u53e3\u3002\u5f53\u6d3b\u52a8\u7531\u4e8e\u4e00\u4e2a\u4e8b\u4ef6\uff08\u4f8b\u5982\u7528\u6237\u9009\u62e9\u7684\u5217\u8868\u9879\uff09\u63a5\u6536\u56de\u8c03\uff0c\u9002\u5f53\u5730\u6839\u636e\u884c\u4e3a\u4e0a\u4e3a\u5f53\u524d\u7247\u6bb5\u8fdb\u884c\u914d\u7f6e\u3002<br \/>\n<br \/>\n\u4f8b\u5982\uff0c\u4ece\u4e0a\u9762\u5904\u7406\u8fd9\u6837\u7684\u6d3b\u52a8\u9009\u62e9\u9879\uff1a<br \/>\n<\/p>\n<pre class=\"java\">&#160;\n<span style=\"color: #000000; font-weight: bold;\">public<\/span> <span style=\"color: #000000; font-weight: bold;\">class<\/span> MainActivity <span style=\"color: #000000; font-weight: bold;\">extends<\/span> Activity <span style=\"color: #000000; font-weight: bold;\">implements<\/span> TitlesFragment.<span style=\"color: #006600;\">OnItemSelectedListener<\/span> <span style=\"color: #66cc66;\">&#123;<\/span>\n    ...\n&#160;\n    <span style=\"color: #808080; font-style: italic;\">\/** This is a callback that the list fragment (Fragment A)\n        calls when a list item is selected *\/<\/span>\n    <span style=\"color: #000000; font-weight: bold;\">public<\/span> <span style=\"color: #993333;\">void<\/span> onItemSelected<span style=\"color: #66cc66;\">&#40;<\/span><span style=\"color: #993333;\">int<\/span> position<span style=\"color: #66cc66;\">&#41;<\/span> <span style=\"color: #66cc66;\">&#123;<\/span>\n        DisplayFragment displayFrag = <span style=\"color: #66cc66;\">&#40;<\/span>DisplayFragment<span style=\"color: #66cc66;\">&#41;<\/span> getFragmentManager<span style=\"color: #66cc66;\">&#40;<\/span><span style=\"color: #66cc66;\">&#41;<\/span>\n                                    .<span style=\"color: #006600;\">findFragmentById<\/span><span style=\"color: #66cc66;\">&#40;<\/span>R.<span style=\"color: #006600;\">id<\/span>.<span style=\"color: #006600;\">display_frag<\/span><span style=\"color: #66cc66;\">&#41;<\/span>;\n        <span style=\"color: #b1b100;\">if<\/span> <span style=\"color: #66cc66;\">&#40;<\/span>displayFrag == <span style=\"color: #000000; font-weight: bold;\">null<\/span><span style=\"color: #66cc66;\">&#41;<\/span> <span style=\"color: #66cc66;\">&#123;<\/span>\n            <span style=\"color: #808080; font-style: italic;\">\/\/ DisplayFragment (Fragment B) is not in the layout (handset layout),<\/span>\n            <span style=\"color: #808080; font-style: italic;\">\/\/ so start DisplayActivity (Activity B)<\/span>\n            <span style=\"color: #808080; font-style: italic;\">\/\/ and pass it the info about the selected item<\/span>\n            Intent intent = <span style=\"color: #000000; font-weight: bold;\">new<\/span> Intent<span style=\"color: #66cc66;\">&#40;<\/span><span style=\"color: #000000; font-weight: bold;\">this<\/span>, DisplayActivity.<span style=\"color: #000000; font-weight: bold;\">class<\/span><span style=\"color: #66cc66;\">&#41;<\/span>;\n            intent.<span style=\"color: #006600;\">putExtra<\/span><span style=\"color: #66cc66;\">&#40;<\/span><span style=\"color: #ff0000;\">&quot;position&quot;<\/span>, position<span style=\"color: #66cc66;\">&#41;<\/span>;\n            startActivity<span style=\"color: #66cc66;\">&#40;<\/span>intent<span style=\"color: #66cc66;\">&#41;<\/span>;\n        <span style=\"color: #66cc66;\">&#125;<\/span> <span style=\"color: #b1b100;\">else<\/span> <span style=\"color: #66cc66;\">&#123;<\/span>\n            <span style=\"color: #808080; font-style: italic;\">\/\/ DisplayFragment (Fragment B) is in the layout (tablet layout),<\/span>\n            <span style=\"color: #808080; font-style: italic;\">\/\/ so tell the fragment to update<\/span>\n            displayFrag.<span style=\"color: #006600;\">updateContent<\/span><span style=\"color: #66cc66;\">&#40;<\/span>position<span style=\"color: #66cc66;\">&#41;<\/span>;\n        <span style=\"color: #66cc66;\">&#125;<\/span>\n    <span style=\"color: #66cc66;\">&#125;<\/span>\n<span style=\"color: #66cc66;\">&#125;<\/span>\n&#160;<\/pre>\n<p>\u5f53DisplayActivity\uff08\u6d3b\u52a8\uff09\u542f\u52a8\u65f6\uff0c\u901a\u8fc7\u5b83\u7684DisplayFragment\uff08\u7247\u6bb5B\uff09\u8bfb\u53d6\u6570\u636e\u4f20\u9012\u7684\u610f\u56fe\u3002<br \/>\n<br \/>\n\u5982\u679c\u7247\u6bb5B\u9700\u8981\u63d0\u4f9b\u4e00\u4e2a\u7ed3\u679c\u4f20\u56de\u7247\u6bb5A\uff0c\u5219\u8be5\u8fc7\u7a0b\u7684\u5de5\u4f5c\u65b9\u5f0f\u7c7b\u4f3c\u4e8e\u7247\u6bb5B\u548c\u6d3b\u52a8B\u7684\u4e00\u4e2a\u56de\u8c03\u63a5\u53e3\uff0c\u6d3b\u52a8B\u5b9e\u73b0\u4e86\u4e00\u4e2a\u56de\u8c03\u63a5\u53e3\uff0c\u7247\u6bb5B.\u83b7\u5f97\u7684\u56de\u8c03\uff0c\u5e76\u5b8c\u6210\u81ea\u8eab\u6d3b\u52a8\u3002\u6d3b\u52a8\u63a5\u6536\u7ed3\u679c\uff0c\u5e76\u63d0\u4f9b\u7247\u6bb5A.<br \/>\n<br \/>\n\u5bf9\u4e8e\u4e00\u4e2a\u5b8c\u6574\u7684\u793a\u8303\u8fd9\u9879\u6280\u672f\u7528\u4e8e\u521b\u5efa\u4e0d\u540c\u7684\u7247\u6bb5\u7ec4\u5408\u4e3a\u4e0d\u540c\u7684\u5e73\u677f\u7535\u8111\u548c\u624b\u673a\uff0c\u770b\u770b\u4ee3\u7801\uff0c\u6b64\u66f4\u65b0\u7248\u672c\u7684 <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/tools\/samples\/index.html\">Honeycomb Gallery<\/a>  \uff08ZIP\u6587\u4ef6\uff09<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Action_bar.28.E5.B7.A5.E5.85.B7.E6.A0.8F.29.E7.9A.84.E5.BA.94.E7.94.A8\">Action bar(\u5de5\u5177\u680f)\u7684\u5e94\u7528<\/span><\/h2>\n<p>\u5728\u5e73\u677f\u548c\u624b\u673a\u4e0a\uff0c<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">Action bar<\/a>\u5bf9\u4e8eAndroid\u5e94\u7528\u6765\u8bf4\u662f\u4e2a\u91cd\u8981\u7684\u7ec4\u4ef6.\u4e3a\u4e86\u786e\u4fdd\u4e3a\u4e86\u786e\u4fdd<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">Action Bar<\/a>\u53ef\u4ee5\u9002\u5e94\u6240\u6709\u7684\u5c4f\u5e55\u5206\u8fa8\u7387\uff0c\u5e94\u7528<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">ActionBar<\/a>\u7684API\u800c\u6ca1\u6709\u6dfb\u52a0\u7684\u5b9a\u5236\u3002\u901a\u8fc7\u5e94\u7528\u6807\u51c6\u7684ActionBar API\u8bbe\u8ba1\u4f60\u7684\u5de5\u5177\u680f\uff0c\u4e3a\u4e86<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html\">ActionBar<\/a> \u66f4\u597d\u9002\u5e94\u4e0d\u540c\u5206\u8fa8\u7387\uff0cAndroid\u7cfb\u7edf\u505a\u4e86\u5f88\u591a\u5de5\u4f5c\u3002\u5f53\u4f60\u521b\u5efaActionBar\u65f6\uff0c\u8fd9\u91cc\u6709\u4e00\u4e9b\u53ef\u4f9b\u9075\u5faa\u91cd\u8981\u7684\u5efa\u8bae\uff1a \n<\/p>\n<ul><li>\u5f53\u8bbe\u7f6e\u83dc\u5355\u9879\u4f5c\u4e3a\u5de5\u5177\u680f\u7684\u5b50\u9879\u65f6\uff0c\u907f\u514d\u7528always\u503c\u3002\u5728\u4f60\u7684\u83dc\u5355\u8d44\u6e90\u91cc\u9762\u5982\u679c\u4f60\u60f3 \u5728\u4f60\u7684\u83dc\u5355\u9879\u51fa\u73b0\u5728\u4f60\u7684\u5de5\u5177\u680f\u4e2d\uff0c\u4f7f\u7528 \"android:showAsAction\"\u7684\"ifRoom\"\u5c5e\u6027.\u7136\u800c \u4f60\u53ef\u80fd\u9700\u8981\"always\"\u5c5e\u6027\uff0c\u5f53\u4e00\u4e2a\u52a8\u4f5c\u89c6\u56fe\u5e76\u4e0d\u4e3a\u6ea2\u51fa\u83dc\u5355(\u5fc5\u987b\u51fa\u73b0\u5728\u52a8\u4f5c\u89c6\u56fe\u4e2d\u7684) \u63d0\u4f9b\u4e00\u4e2a\u9ed8\u8ba4\u7684\u52a8\u4f5c\u3002\u4f46\u662f\u4f60\u4e0d\u80fd\u7528always\u4e00\u6b21\u6216\u4e24\u6b21\u4ee5\u4e0a\u3002\u51e0\u4e4e\u5728\u6240\u6709\u5176\u4ed6\u60c5\u51b5\u4e0b\uff0c \u5f53\u4f60\u60f3\u8be5\u6761\u76ee\u4f5c\u4e3a\u4e00\u4e2a\u52a8\u4f5c\u9879\u51fa\u73b0\uff0c\u4f7f\u7528\"android:showAsAction\"\u503c\u4e3a \"ifRoom\"\u3002 \u8feb\u4f7f\u592a\u591a\u7684\u52a8\u4f5c\u9879\u5230ActionBar\u4e2d\u4f1a\u5bfc\u81f4\u6df7\u4e71\u7684UI\uff0c\u5e76\u4e14\u52a8\u4f5c\u9879\u4f1a\u4e0e\u5176\u4ed6\u7684ActionBar\u90e8\u5206\u91cd\u53e0 \u50cf\u6807\u9898\u680f\u548c\u5bfc\u822a\u680f\u3002 \n<\/li><\/ul>\n<ul><li>\u5f53\u7528\u6587\u672c\u6807\u9898\u5411ActionBar\u6dfb\u52a0\u52a8\u4f5c\u9879\u65f6\uff0c\u63d0\u4f9b\u4e86\u4e00\u4e2a\u9002\u5f53\u7684\u5e76\u4e14\u58f0\u660e\u4e86showAsAction=\"ifRoom|withText\"\u7684\u56fe\u6807\uff0c \u8fd9\u6837\u7684\u8bdd\uff0c\u5982\u679c\u6807\u9898\u6ca1\u6709\u8db3\u591f\u7684\u7a7a\u95f4\uff0c\u4f46\u53ea\u6709\u5728\u56fe\u6807\u5e94\u7528\u7684\u60c5\u51b5\u4e0b\uff0c\u56fe\u6807\u4f1a\u6709\u8db3\u591f\u7684\u7a7a\u95f4\u3002 \n<\/li><\/ul>\n<ul><li>\u901a\u5e38\u4e3a\u4f60\u7684\u52a8\u4f5c\u9879\u6dfb\u52a0\u4e00\u4e2a\u6807\u9898\uff0c\u5373\u4f7f\u4f60\u4e0d\u542f\u7528\u201cwithText\u201d\uff0c\u4f46\u662f\u7528\u6237\u53ef\u4ee5\u901a\u8fc7\u957f\u6309\u52a8\u4f5c\u9879\u67e5\u770b\u6807\u9898\uff0c\u6807\u9898\u6587\u672c\u4f1a \u7acb\u523b\u51fa\u73b0\u5728Toast\u4fe1\u606f\u4e2d\u3002\u63d0\u4f9b\u6807\u9898\u5bf9\u53ef\u8bbf\u95ee\u6027\u6765\u8bf4\u662f\u5fc5\u8981\u7684\uff0c\u56e0\u4e3a\u5c4f\u5e55\u9605\u8bfb\u5668\u4f1a\u5927\u58f0\u6717\u8bfb\u9879\u6807\u9898\u5373\u4f7f\u770b\u4e0d\u89c1 \n<\/li><\/ul>\n<ul><li><b>\u5982\u679c\u53ef\u80fd\u7684\u8bdd\u5c3d\u91cf\u4e0d\u7528\u4f20\u7edf\u7684\u5bfc\u822a\u6a21\u5f0f\u3002<\/b>\u5982\u679c\u53ef\u80fd\u7684\u8bdd\u7528built-in tab\u548c drop-down\u5bfc\u822a\u6a21\u5f0f\uff0c\u4ed6\u4eec\u662f\u4e3a\u4e86\u7cfb\u7edf\u53ef\u4ee5 \u9002\u5e94\u4ed6\u4eec\u5bf9\u4e8e\u4e0d\u540c\u5c4f\u5e55\u5206\u8fa8\u7387\u7684\u63cf\u8ff0\u3002\u4f8b\u5982,\u5f53\u5bbd\u5ea6\u592a\u7a84\u4e86,\u8fd9\u6807\u7b7e\u548c\u5176\u4ed6\u7684\u52a8\u4f5c\u9879\uff08\u4f8b\u5982\u624b\u673a\u7684\u7ad6\u5c4f\uff09\uff0c\u9009\u9879\u5361\u51fa\u73b0\u5728 ActionBar\uff08\u8fd9\u88ab\u79f0\u4e3a\u5806\u53e0\u52a8\u4f5c\u680f\uff09\u4e0b\u9762\u3002\u5982\u679c\u4f60\u4e00\u5b9a\u8981\u521b\u5efa\u4e00\u4e2a\u4f20\u7edf\u7684\u5bfc\u822a\u6a21\u5f0f\u6216\u8005\u5176\u4ed6\u7684\u89c6\u56fe\u6a21\u5f0f\uff0c\u5b8c\u5168\u5728\u5c0f\u7684\u5c4f\u5e55 \u4e0a\u6d4b\u8bd5\u505a\u4efb\u4f55\u5fc5\u8981\u7684\u8c03\u6574\u4ee5\u652f\u6301\u4e00\u4e2a\u72ed\u7a84\u7684\u5de5\u5177\u680f\u3002 \n<\/li><\/ul>\n<p>\u4f8b\u5982,\u4e0b\u9762\u7684\u5b9e\u7269\u6a21\u578b\u6f14\u793a\u7cfb\u7edf\u5982\u4f55\u9002\u5e94\u4e00\u4e2a\u5de5\u5177\u680f\uff0c\u53ef\u4ee5\u57fa\u4e8e\u53ef\u7528\u7684\u5c4f\u5e55\u7a7a\u95f4\u3002\u5728\u624b\u673a\u4e0a\u53ea\u6709\u4e24\u4e2a\u52a8\u4f5c\u9879\u9002\u7528\uff0c\u5269\u4f59\u7684\u83dc\u5355\u9879 \u51fa\u73b0\u5728\u6ea2\u51fa\u83dc\u5355\u4e2d\uff08\u56e0\u4e3aandroid:showAsAction\u8bbe\u7f6e\u4e3aifRoom\uff09\u4ee5\u53ca\u9009\u9879\u5361\u72ec\u7acb\u51fa\u73b0\u4e00\u884c\uff08\u6ea2\u51fa\u5de5\u5177\u680f\uff09\u5728\u5e73\u677f\u7535\u8111\u4e0a,\u66f4\u591a\u7684\u52a8\u4f5c\u9879\u53ef\u4ee5\u9002\u5408\u5728\u52a8\u4f5c\u680f\u548c\u6807\u7b7e \n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/images\/practices\/actionbar-phone-tablet.png\" alt=\"actionbar-phone-tablet.png\" \/>\n<\/p><p>\u56fe\u5f622\uff1aMock-up \u5c55\u793a\u7cfb\u7edf\u518d\u914d\u7f6e\u7684\u5de5\u5177\u680f\u7ec4\u4ef6\u57fa\u4e8e\u53ef\u7528\u7684\u5c4f\u5e55\u7a7a\u95f4 \n<\/p>\n<h3> <span class=\"mw-headline\" id=\".E5.BA.94.E7.94.A8.E5.88.86.E7.A6.BBAction_Bar\">\u5e94\u7528\u5206\u79bbAction Bar<\/span><\/h3>\n<p>\u5f53\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u8fd0\u884c\u5728Android4.0\uff08API level 14\uff09\u6216\u8005\u66f4\u9ad8\u7684\u7248\u672c\uff0c\u8fd8\u6709\u4e00\u4e2a\u989d\u5916\u7684\u6a21\u5f0f\u53ef\u4f9b\u64cd\u4f5c\u680f\u79f0\u4e3a\u201c\u5206\u9694\u5de5\u5177\u680f\u201d\u3002\u5f53\u4f60\u7528 \u5206\u5272\u5de5\u5177\u680f\u65f6,\u4e00\u4e2a\u5206\u9694\u6761\u4f1a\u51fa\u73b0\u5728\u5c4f\u5e55\u7684\u4f4e\u90e8\u6765\u5c55\u793a\u6240\u6709\u7684\u52a8\u4f5c\u9879\uff0c\u5f53Activity\u8fd0\u884c\u5728\u7a84\u7684\u5c4f\u5e55\u4e0a\uff08\u4f8b\u5982\u7ad6\u5c4f\u624b\u673a\uff09\u3002\u5206\u9694\u5de5\u5177\u680f\u786e \u4fdd\u5408\u7406\u6570\u91cf\u7684\u7a7a\u95f4\u53ef\u7528\u6765\u663e\u793a\u52a8\u4f5c\u9879\u76ee\u5728\u4e00\u4e2a\u72ed\u7a84\u7684\u5c4f\u5e55\uff0c\u5728\u9876\u90e8\u8fd8\u7559\u51fa\u7a7a\u95f4\u4e3a\u5bfc\u822a\u548c\u6807\u9898\u5143\u7d20\u3002 \u4f7f\u7528\u5206\u5272\u6761\uff0c\u7b80\u5355\u7684\u6dfb\u52a0uiOptions=\"splitActionBarWhenNarrow\"\u5728\u4f60\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/activity-element.html\">&lt;activity&gt;<\/a>\u548c<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/application-element.html\">&lt;application&gt;<\/a>\u5728manifest\u4e2d \n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/images\/practices\/actionbar-phone-splitaction.png\" alt=\"actionbar-phone-splitaction.png\" \/>\n<\/p><p>\u56fe\u5f623\uff1a\u5de6\u8fb9\u662f\u5e26\u6709\u5bfc\u822a\u6761\u7684 Split action bar\uff0c\u53f3\u8fb9\u662f\u6ca1\u6709\u5e94\u7528\u7a0b\u5e8f\u56fe\u6807\u548c\u6807\u9898 \n<\/p><p>\u5982\u679c\u4f60\u60f3\u9690\u85cf\u4e0a\u9762\u7684\u4e3bAction Bar\uff0c\u56e0\u4e3a\u4f60\u6b63\u5728\u5e94\u7528\u5185\u7f6e\u7684\u5bfc\u822a\u6761\u4ee5\u53ca\u5206\u9694\u6761\uff0c\u7528 <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/ActionBar.html#setDisplayShowHomeEnabled(boolean)\">setDisplayShowHomeEnabled(false)<\/a>\u65b9\u6cd5\u6765\u9690\u85cf\u5e94\u7528\u56fe\u6807\u548cActionBar\u3002\u8fd9\u6837\uff0c\u5728\u4e3b\u7684ActionBar\u91cc\u9762\u5c31\u6ca1\u6709\u4e1c\u897f\u4e86\uff0c\u56e0\u6b64\u6240\u4ee5\u5b83\u5c31\u6d88\u5931\u4e86,\u5269\u4e0b\u7684\u662f\u5bfc\u822a\u6807\u7b7e\u9876\u90e8\u548c\u5e95\u90e8\u7684\u52a8\u4f5c\u9879,\u5982\u56fe\u6240\u793a\u7684\u7b2c\u4e8c\u4e2a\u8bbe\u5907\u5728\u56fe3\u4e2d\u3002 \n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #F7F7F7; border-left:4px solid; border-color:#258AAF;\">\n<p>\u6ce8\u91ca\uff1a\u867d\u7136\uff0cuiOptions\u5c5e\u6027\u5728Android 4.0(API level 14)\u6dfb\u52a0\u4e0a\u4e86,\u4f60\u53ef\u4ee5\u5b89\u5168\u5730\u5c06\u5176\u5305\u62ec\u5728\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f,\u5373\u4f7f\u4f60<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/uses-sdk-element.html#min\">minSdkVersion<\/a>\u8bbe\u7f6e\u4e3a\u4e00\u4e2a\u503c\u4f4e\u4e8e\u201c14\u201c \u4fdd\u6301\u517c\u5bb9\u65e7\u7684Android\u3002\u5f53\u8fd0\u884c\u65e7\u7684\u7248\u672c\u65f6 \uff0c\u8be5\u7cfb\u7edf\u7b80\u5355\u5730\u5ffd\u7565\u4e86\u5c5e\u6027,\u56e0\u4e3a\u5b83\u5e76\u4e0d\u8bc6\u522b\u4ed6\u3002\u552f\u4e00\u7684\u6761\u4ef6\u6dfb\u52a0\u5230Manifest\u4e2d \uff0c\u5fc5\u987b\u7f16\u8bd1\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u5bf9\u5e73\u53f0\u7684\u7248\u672c,\u5b83\u652f\u6301API\u7ea7\u522b14\u6216\u66f4\u9ad8\u3002\u53ea\u662f\u8981\u786e\u4fdd\u5728\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u4e2d\u4e0d\u516c\u5f00\u4f7f\u7528\u5176\u4ed6api\u4e0d\u652f\u6301\u60a8\u58f0\u660e\u7684\u6700\u5c0f\u7248\u672c\u7684\u4ee3\u7801\u3002 \n<\/p>\n<\/div>\n<h3> <span class=\"mw-headline\" id=\".E5.BA.94.E7.94.A8.E2.80.9CUP.E2.80.9D.E5.AF.BC.E8.88.AA\">\u5e94\u7528\u201cUP\u201d\u5bfc\u822a<\/span><\/h3>\n<p>\u5f00\u53d1\u8005\u6307\u5357\u4e2d\u8bf4\u9053\uff0c\u60a8\u53ef\u4ee5\u4f7f\u7528\u5e94\u7528\u7a0b\u5e8f\u56fe\u6807,\u65b9\u4fbf\u7528\u6237\u64cd\u4f5c\u680f\u5bfc\u822a\u5f53\u4e00\u4e2a\u65b9\u6cd5\u8df3\u8f6c\u5230\u4e3b\u754c\u9762\uff08\u7c7b\u4f3c\u4e8e\u5728\u7f51\u7ad9\u4e0a\u70b9\u51fblogo\uff09\uff0c\u4e00\u4e2a\u63d0\u9ad8\u5e94\u7528\u7684\u673a\u6784\u5c42\u6b21\u3002\u5728\u5176\u4ed6\u60c5\u51b5\u4e0b\uff0c\u5979\u53ef\u80fd\u770b\u8d77\u6765\u50cf\u6807\u51c6\u7684\u9ed1\u8272\u5bfc\u822a\u6761\uff0cup navigation option \u63d0\u4f9b\u4e86up\u5bfc\u822a\u9009\u9879\u63d0\u4f9b\u4e86\u4e00\u4e2a\u66f4\u53ef\u9884\u6d4b\u7684\u5bfc\u822a\u65b9\u6cd5\u7684\u60c5\u51b5\u4e0b,\u7528\u6237\u53ef\u80fd\u5df2\u7ecf\u8fdb\u5165\u4e86\u4ece\u5916\u90e8\u4f4d\u7f6e\u50cf\u901a\u77e5\uff0c\u684c\u9762\u5c0f\u7ec4\u4ef6\u6216\u8005\u4e00\u4e2a\u5176\u4ed6\u7684\u5e94\u7528 \u5f53\u4f7f\u7528\u4e0d\u540c\u7684\u7ec4\u5408\u788e\u7247\u4e3a\u4e0d\u540c\u7684\u8bbe\u5907,\u91cd\u8981\u7684\u662f\u8981\u7ed9\u4e88\u989d\u5916\u7684\u8003\u8651\u5982\u4f55\u5728\u6bcf\u79cd\u914d\u7f6e\u4e86\u5bfc\u822a\u7684\u884c\u4e3a\u3002\u4f8b\u5982\uff0c\u5f53\u5728\u624b\u673a\u4e0a\u5e76\u4e14\u4f60\u7684\u663e\u793a\u4e00\u6b21\u5e76\u4e14\u6709\u4e00\u4e2a\u7247\u6bb5\u5b83\u53ef\u80fd\u662f\u5408\u9002\u7684\u542f\u7528\u4e86\u5bfc\u822a\u5230\u7236\u5c4f\u5e55\uff0c\u800c\u8fd9\u662f\u6ca1\u6709\u5fc5\u8981\u7684,\u5728\u663e\u793a\u540c\u6837\u7684\u7247\u6bb5\u5728\u591a\u7a97\u683c\u7684\u914d\u7f6e\u3002 \n<\/p><p>\u66f4\u591a\u5173\u4e8eup\u5bfc\u822a\u8bf7\u53c2\u8003<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/ui\/actionbar.html#Home\">ActionBar<\/a>\u5f00\u53d1\u6307\u5357 \n<\/p>\n<h2> <span class=\"mw-headline\" id=\".E5.85.B6.E4.BB.96.E7.9A.84.E8.AE.BE.E8.AE.A1.E5.BB.BA.E8.AE.AE\">\u5176\u4ed6\u7684\u8bbe\u8ba1\u5efa\u8bae<\/span><\/h2>\n<ul><li>\u5f53\u4f7f\u7528<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/widget\/ListView.html\">Listview<\/a>\u65f6\uff0c\u8003\u8651\u4f60\u53ef\u80fd\u63d0\u4f9b\u6216\u591a\u6216\u5c11\u7684\u4fe1\u606f\u5728\u6bcf\u4e2a\u57fa\u4e8e\u53ef\u7528\u7a7a\u95f4\u7684\u9009\u9879\u91cc\u3002\u4e5f\u5c31\u662f\u8bf4\u4f60\u53ef\u4ee5\u5728\u4f60\u7684\u5217\u8868\u9002\u914d\u5668\u4e2d\uff0c\u4f60\u53ef\u4ee5\u521b\u5efa\u6bcf\u4e00\u4e2a\u5217\u8868\u9879\u4f7f\u7528\u590d\u6742\u7684\u5e03\u5c40 \u8fd9\u6837\u4e00\u4e2a\u5927\u7684\u5c4f\u5e55\u5c31\u53ef\u4ee5\u4e3a\u6bcf\u4e2a\u5217\u8868\u9879\u5c55\u793a\u66f4\u591a\u7684\u7ec6\u8282 \n<\/li><\/ul>\n<ul><li>\u521b\u5efa\u66ff\u4ee3\u8d44\u6e90\u6587\u4ef6\u503c,\u6bd4\u5982\u6574\u6570\u3001\u5c3a\u5bf8\u3001\u751a\u81f3\u662f\u5e03\u5c14\u503c.\u4f7f\u7528\u8fd9\u4e9b\u8d44\u6e90\u7684\u5927\u5c0f\u9650\u5b9a\u7b26,\u4f60\u53ef\u4ee5\u5f88\u5bb9\u6613\u5730\u5e94\u7528\u4e0d\u540c\u7684\u5e03\u5c40\u5927\u5c0f,\u5b57\u4f53\u5927\u5c0f,\u6216\u542f\u7528\/\u7981\u7528\u7279\u6027\u6839\u636e\u5f53\u524d\u7684\u5c4f\u5e55\u5927\u5c0f.\n<\/li><\/ul>"}