{"title":"Best Practices for Web Apps","text":"<p>\u8d1f\u8d23\u4eba\uff1a\u5361\u9a6c\u514b \n<\/p><p>\u539f\u6587\u94fe\u63a5\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/guide\/webapps\/best-practices.html\">http:\/\/docs.eoeandroid.com\/guide\/webapps\/best-practices.html<\/a> \n<\/p><p><br \/>\n<\/p>\n<h1> <span class=\"mw-headline\" id=\"Best_Practices_for_Web_Apps\">Best Practices for Web Apps<\/span><\/h1>\n<p>\u5bf9\u4e8e\u7ed9\u624b\u673a\u8bbe\u5907\u5f00\u53d1\u7f51\u9875\u6216\u7f51\u7edc\u5e94\u7528\u8ddf\u4f20\u7edf\u7684\u4f7f\u7528\u684c\u9762\u6d4f\u89c8\u5668\u5f00\u53d1\u7f51\u9875\u76f8\u6bd4\u6709\u66f4\u591a\u4e0d\u540c\u7684\u6311\u6218\u3002\u4e3a\u4e86\u5e2e\u52a9\u4f60\u6709\u4e2a\u826f\u597d\u7684\u5f00\u59cb\uff0c\u4e0b\u5217\u5b9e\u8df5\u4f60\u53ef\u4ee5\u7ec3\u4e60\uff0c\u53ef\u4ee5\u5f00\u53d1\u6700\u9ad8\u6548\u7684\u7f51\u7edc\u5e94\u7528\u3002\n<\/p><p><b>1. \u91cd\u5b9a\u5411\u624b\u673a\u8bbe\u5907\u5230\u6307\u5b9a\u7684\u7f51\u7ad9\u7248\u672c<\/b>\n<\/p><p>\u8fd9\u91cc\u6709\u5f88\u591a\u65b9\u6cd5\u53ef\u4ee5\u91cd\u5b9a\u5411\u634f\u8bf7\u6c42\u5230\u6307\u5b9a\u7684\u624b\u673a\u7f51\u7ad9\uff0c\u4f7f\u7528\u670d\u52a1\u7aef\u91cd\u5b9a\u5411\u3002\u901a\u5e38\u6765\u8bf4\uff0c\u8fd9\u4e2a\u4e00\u822c\u901a\u8fc7\u7f51\u7edc\u6d4f\u89c8\u5668\u63d0\u4f9b\u7684\u7528\u6237\u4ee3\u7406\u5b57\u7b26\u4e32\u201csniffing\u201d\u5b8c\u6210\u3002\u4e3a\u786e\u5b9a\u662f\u5426\u670d\u52a1\u4e8e\u79fb\u52a8\u7248\u672c\u7684\u7f51\u7ad9\uff0c\u4f60\u5e94\u8be5\u5728\u7528\u6237\u4ee3\u7406\u4e2d\u67e5\u8be2\u201cmobile\u201d\u5b57\u7b26\u4e32\uff0c\u5b83\u4f1a\u5339\u914d\u5f88\u591a\u624b\u673a\u8bbe\u5907\u3002\u5982\u679c\u6709\u5fc5\u8981\uff0c\u4f60\u8fd8\u53ef\u4ee5\u9274\u522b\u5177\u4f53\u7684\u64cd\u4f5c\u7cfb\u7edf\uff08\u4f8b\u5982\u201cAndroid 2.1\u201d\uff09\u3002\n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #F7F7F7; border-left:4px solid; border-color:#258AAF;\">\n<p>\u5907\u6ce8\uff1a\u5927\u5c4f\u5e55Android\u8bbe\u5907\u53ef\u4ee5\u9002\u914d\u5168\u5c3a\u5bf8\u7f51\u7ad9\uff08\u4f8b\u5982\u5e73\u677f\u7535\u8111\uff09\uff0c\u4e0d\u8981\u5728\u7528\u6237\u4ee3\u7406\u4e2d\u5305\u542b\u201cmobile\u201d\u5b57\u7b26\u4e32\uff0c\u7136\u800c\u5269\u4e0b\u7684\u7528\u6237\u4ee3\u7406\u5b57\u7b26\u4e32\u5927\u90e8\u5206\u90fd\u4e00\u6837\u3002\u540c\u6837\u7684\uff0c\u6839\u636e\u5728\u7528\u6237\u4ee3\u7406\u4e2d\u7684\u201cmobile\u201d\u5b57\u7b26\u4e32\uff0c\u5b9e\u73b0\u79fb\u52a8\u7248\u672c\u7684\u7f51\u7ad9\u662f\u5f88\u91cd\u8981\u7684\u3002\n<\/p>\n<\/div>\n<p><b>2. \u4f7f\u7528\u9002\u5408\u624b\u673a\u8bbe\u5907\u7684\u6709\u6548\u5730DOCTYPE\u6807\u8bb0<\/b>\n<\/p><p>\u5728\u624b\u673a\u7f51\u7ad9\u4e2d\u6700\u666e\u904d\u4f7f\u7528\u7684\u6807\u8bb0\u8bed\u8a00\u662f<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/www.w3.org\/TR\/2008\/REC-xhtml-basic-20080729\/\">XHTML Basic<\/a>.\u8fd9\u4e2a\u6807\u51c6\u4fdd\u8bc1\u5728\u4f60\u7f51\u7ad9\u4e2d\u7684\u5177\u4f53\u6807\u8bb0\u53ef\u4ee5\u8fd0\u884c\u7684\u6700\u597d\u3002\u4e3e\u4f8b\u6765\u8bf4\uff0c\u5b83\u4e0d\u5141\u8bb8\u4f7f\u7528HTML frame\u548c\u5d4c\u5957\u8868\u683c\uff0c\u4ed6\u4eec\u5728\u624b\u673a\u8bbe\u5907\u4e2d\u8fd0\u884c\u7684\u5f88\u7cdf\u7cd5\u3002\u6839\u636eDOCTYPE\uff0c\u5728\u6587\u6863\u4e2d\u9700\u8981\u58f0\u660e\u5408\u9002\u7684\u7f16\u7801\u3002\n<\/p>\n<pre class=\"xml\">&#160;\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;?xml<\/span> <span style=\"color: #000066;\">version<\/span>=<span style=\"color: #ff0000;\">&quot;1.0&quot;<\/span> <span style=\"color: #000066;\">encoding<\/span>=<span style=\"color: #ff0000;\">&quot;UTF-8&quot;<\/span><span style=\"font-weight: bold; color: black;\">?&gt;<\/span><\/span> \n<span style=\"color: #00bbdd;\">&lt;!DOCTYPE html PUBLIC &quot;-\/\/W3C\/\/DTD XHTML Basic 1.1\/\/EN&quot;<\/span>\n<span style=\"color: #00bbdd;\">    &quot;http:\/\/www.w3.org\/TR\/xhtml-basic\/xhtml-basic11.dtd&quot;&gt;<\/span>\n&#160;<\/pre>\n<p>\u5e76\u4e14\u4f60\u8fd8\u8981\u786e\u5b9a\u7f51\u9875\u4e2d\u7684\u6807\u8bb0\u662f\u6709\u6548\u7684\uff0c\u5e76\u4e14\u6ca1\u6709\u8fdd\u53cd\u5df2\u58f0\u660e\u7684DOCTYPE\u3002\u4f7f\u7528\u4e00\u4e2a\u9a8c\u8bc1\u7a0b\u5e8f\uff0c\u4f8b\u5982\u4f60\u53ef\u4ee5\u5728<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/validator.w3.org\u4e2d\u5bfb\u627e\u4e00\u4e2a\u53ef\u7528\u7684\u3002\">http:\/\/validator.w3.org\u4e2d\u5bfb\u627e\u4e00\u4e2a\u53ef\u7528\u7684\u3002<\/a>\n<\/p><p><b>3. \u4f7f\u7528\u4e00\u4e2a\u8bd5\u56fe\u5143\u6807\u7b7e\u91cd\u65b0\u5b9a\u4e49\u7f51\u9875\u7684\u5927\u5c0f<\/b>\n<\/p><p>\u5728&lt;head&gt;\u6807\u7b7e\u4e2d\uff0c\u4f60\u53ef\u4ee5\u63d0\u4f9b\u5143\u6807\u7b7e\u4fe1\u606f\u7528\u6765\u6307\u5b9a\u4f60\u5728\u6d4f\u89c8\u5668\u4e2d\u7f51\u9875\u7684\u6e32\u67d3\u65b9\u5f0f\u3002\u4f8b\u5982\uff0c\u5728\u89c6\u7a97\u5143\u6570\u636e\u4e2d\u4f60\u53ef\u4ee5\u6307\u5b9a\u9ad8\u5ea6\u548c\u5bbd\u5ea6\uff0c\u5f00\u59cb\u521d\u59cb\u5316\u7684\u7f51\u9875\u7684\u6bd4\u4f8b\u548c\u76ee\u6807\u5c4f\u5e55\u7684\u5bc6\u5ea6\u3002\u4f8b\u5982\n<\/p>\n<pre>\n&lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1.0, user-scalable=no&quot;&gt;\n<\/pre>\n<p>\u66f4\u591a\u7684\u5728Android\u8bbe\u5907\u4e2d\u5982\u4f55\u4f7f\u7528\u89c6\u7a97\u5143\u6570\u636e\uff0c\u8bf7\u9605\u8bfb<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/webapps\/targeting.html\">Targeting Screens from Web Apps<\/a>\u3002\n<\/p><p><b>4. \u907f\u514d\u591a\u4e2a\u6587\u4ef6\u8bf7\u6c42<\/b>\n<\/p><p>\u56e0\u4e3aAndroid\u8bbe\u5907\u4e00\u822c\u6bd4\u684c\u9762\u7535\u8111\u7f51\u7edc\u8bf7\u6c42\u901f\u5ea6\u6162\u5f88\u591a\uff0c\u4f60\u5e94\u8be5\u5c3d\u5feb\u8f7d\u5165\u4f60\u8981\u7684\u7f51\u9875\u3002\u5176\u4e2d\u52a0\u901f\u8f7d\u5165\u901f\u5ea6\u7684\u4e00\u4e2a\u65b9\u6cd5\u662f\u5728&lt;head&gt;\u6807\u7b7e\u4e2d\u907f\u514d\u8f7d\u5165\u989d\u5916\u7684\u6587\u4ef6\u4f8b\u5982\u6837\u5f0f\u8868\u548c\u811a\u672c\u6587\u4ef6\u3002\u76f8\u53cd\uff0c\u4f60\u5e94\u8be5\u76f4\u63a5\u5728&lt;head&gt;\u6807\u7b7e\u4e2d\u63d0\u4f9b\u6837\u5f0f\u8868\u548c\u811a\u672c\u6587\u4ef6\uff08\u6216\u5728&lt;body&gt;\u7684\u672b\u7aef\uff0c\u5f53\u8f7d\u5165\u5b8c\u7f51\u9875\u540e\u518d\u8f7d\u5165\u811a\u672c\u6587\u4ef6\uff09\u3002\u4f5c\u4e3a\u4e00\u79cd\u9009\u62e9\uff0c\u4f60\u5e94\u8be5\u901a\u8fc7\u538b\u7f29\u7684\u65b9\u5f0f\u4f18\u5316\u6587\u4ef6\u7684\u5927\u5c0f\u53ca\u901f\u5ea6\u3002\n<\/p><p><b>5. \u4f7f\u7528\u4e00\u4e2a\u5782\u76f4\u73b0\u884c\u5e03\u5c40<\/b>\n<\/p><p>\u907f\u514d\u7528\u6237\u5728\u64cd\u7eb5\u7f51\u9875\u7684\u65f6\u5019\u5de6\u53f3\u62d6\u52a8\u7f51\u9875\u3002\u4e0a\u4e0b\u62d6\u52a8\u5bf9\u4e8e\u7528\u6237\u6765\u8bf4\u66f4\u52a0\u7684\u7b80\u5355\u5e76\u4e14\u7f51\u9875\u4e5f\u66f4\u7b80\u5355\u3002\n<\/p><p>\u60f3\u8981\u4e86\u89e3\u66f4\u591a\u7684\u5173\u4e8e\u521b\u5efa\u79fb\u52a8\u7f51\u7edc\u5e94\u7528\uff0c\u8bf7\u67e5\u770bW3C\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/www.w3.org\/TR\/mobile-bp\/\">Mobile Web Best Practices<\/a>\u3002\u53e6\u5916\u7684\u4e00\u4e9b\u63d0\u9ad8\u7f51\u9875\u7ad9\u70b9\u901f\u5ea6\n\u65b9\u9762\u7684\u6587\u7ae0\uff0c\u8bf7\u67e5\u770bYahoo\u7684 <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/developer.yahoo.com\/performance\/index.html#rules\">Exceptional Performance<\/a> \u548cGoogle\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/code.google.com\/speed\/articles\/\">Let's make the web faster<\/a>\u3002\n<\/p>"}