{"title":"App Install Location","text":"<p>\u539f\u6587\u94fe\u63a5\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/data\/install-location.html\">http:\/\/docs.eoeandroid.com\/guide\/topics\/data\/install-location.html<\/a><br \/>\n\u7f16\u8f91\u8005\uff1aeoe\u8017\u5b50 <br \/>\n\u66f4\u65b0\u65f6\u95f4\uff1a 2012.07.25<br \/>\n<hr \/>\n<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#.E6.A6.82.E8.A7.88\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">\u6982\u89c8<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#.E5.BF.AB.E9.80.9F.E9.A2.84.E8.A7.88\"><span class=\"tocnumber\">1.1<\/span> <span class=\"toctext\">\u5feb\u901f\u9884\u89c8<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#.E5.90.91.E5.90.8E.E5.85.BC.E5.AE.B9\"><span class=\"tocnumber\">2<\/span> <span class=\"toctext\">\u5411\u540e\u517c\u5bb9<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#.E4.B8.8D.E5.BA.94.E8.A3.85.E5.9C.A8.E5.A4.96.E9.83.A8.E5.AD.98.E5.82.A8.E8.AE.BE.E5.A4.87.E7.9A.84.E7.A8.8B.E5.BA.8F\"><span class=\"tocnumber\">3<\/span> <span class=\"toctext\">\u4e0d\u5e94\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a0b\u5e8f<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#.E5.BA.94.E8.AF.A5.E8.A3.85.E5.9C.A8.E5.A4.96.E9.83.A8.E5.AD.98.E5.82.A8.E8.AE.BE.E5.A4.87.E7.9A.84.E7.A8.8B.E5.BA.8F\"><span class=\"tocnumber\">4<\/span> <span class=\"toctext\">\u5e94\u8be5\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a0b\u5e8f<\/span><\/a><\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h2> <span class=\"mw-headline\" id=\".E6.A6.82.E8.A7.88\">\u6982\u89c8<\/span><\/h2>\n<div style=\"width:290px; float:right;border:4px solid #DEE8F1; padding:0 5px 5px\">\n<h3> <span class=\"mw-headline\" id=\".E5.BF.AB.E9.80.9F.E9.A2.84.E8.A7.88\">\u5feb\u901f\u9884\u89c8<\/span><\/h3>\n<ul><li> \u7528\u6237\u53ef\u4ee5\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\n<\/li><li> \u6709\u4e9b\u7c7b\u578b\u7684\u5e94\u7528\u7a0b\u5e8f\u4e0d\u5e94\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\n<\/li><li> \u4e0e\u7cfb\u7edf\u96c6\u6210\u5ea6\u8f83\u4f4e\u7684\u5927\u578b\u5e94\u7528\u7a0b\u5e8f\uff08\u5927\u591a\u662f\u6e38\u620f\uff09\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u662f\u7406\u60f3\u4e4b\u9009\n<\/li><\/ul>\n<p><br \/>\n<\/p>\n<div style=\"font-size: 18px\">\u53c2\u89c1<\/div>\n<hr style=\"width:290px\" \/>\n<p><a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html\">manifest<\/a>\n<\/p>\n<\/div>\n<p>\u4eceAPI level 8\u5f00\u59cb\uff0c\u7528\u6237\u53ef\u4ee5\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff08\u5982SD\u5361\uff09\u3002\u8be5\u5c5e\u6027\u53ef\u4ee5\u901a\u8fc7<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html#install\">android\uff1ainstallLocation<\/a>\u5c5e\u6027\u5728manifest\u4e2d\u58f0\u660e\u3002\u5982\u679c\u4e0d\u58f0\u660e\u8be5\u5c5e\u6027\uff0c\u5e94\u7528\u7a0b\u5e8f\u5c06\u53ea\u4f1a\u5b89\u88c5\u5728\u5185\u5b58\u4e2d\uff0c\u800c\u4e14\u4e0d\u80fd\u79fb\u52a8\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u3002<br \/>\n<\/p><p>\u8981\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u53ea\u9700\u4fee\u6539manifest\u6587\u4ef6\uff0c\u5728<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html\">manifest<\/a>\u5143\u7d20\u4e2d\u6dfb\u52a0<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html#install\">android\uff1ainstallLocation<\/a>\u5c5e\u6027\uff0c\u5c5e\u6027\u503c\u4e3a<code style=\"color:#060\">preferExternal<\/code>\u6216<code style=\"color:#060\">auto<\/code>\u3002\u4f8b\u5982\uff1a<br \/>\n<\/p>\n<div style=\"width:570px; float:left; padding:0 5px 5px\">\n<pre class=\"xml\">&#160;\n<span style=\"color: #009900;\"><span style=\"font-weight: bold; color: black;\">&lt;manifest<\/span> <span style=\"color: #000066;\">xmlns:android<\/span>=<span style=\"color: #ff0000;\">&quot;http:\/\/schemas.android.com\/apk\/res\/android&quot;<\/span>\n      <span style=\"color: #000066;\">android:installLocation<\/span>=<span style=\"color: #ff0000;\">&quot;preferExternal&quot;<\/span>\n      ... <span style=\"font-weight: bold; color: black;\">&gt;<\/span><\/span>\n&#160;<\/pre>\n<\/div><br \/><br \/><br \/><br \/><br \/><br \/>\n<p>\u5982\u679c\u8be5\u5c5e\u6027\u503c\u8bbe\u4e3a<code style=\"color:#060\">\"preferExternal\"<\/code>\uff0c\u8868\u660e\u7528\u6237\u8981\u6c42\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u4f46\u662f\u7cfb\u7edf\u5e76\u4e0d\u4fdd\u8bc1\u5e94\u7528\u7a0b\u5e8f\u771f\u7684\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u3002\u5982\u679c\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a7a\u95f4\u5df2\u6ee1\uff0c\u7cfb\u7edf\u4ecd\u7136\u4f1a\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5185\u5b58\u4e2d\u3002\u7528\u6237\u4e5f\u53ef\u4ee5\u5728\u4e24\u4e2a\u4f4d\u7f6e\u4e4b\u95f4\u79fb\u52a8\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n\u5982\u679c\u8be5\u5c5e\u6027\u503c\u8bbe\u4e3a<code style=\"color:#060\">\"auto\"<\/code>\uff0c\u8868\u660e\u5e94\u7528\u7a0b\u5e8f\u53ef\u80fd\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u4f46\u662f\u7528\u6237\u672c\u8eab\u5bf9\u5b89\u88c5\u4f4d\u7f6e\u6ca1\u6709\u7279\u6b8a\u8981\u6c42\u3002\u7cfb\u7edf\u4f1a\u6839\u636e\u591a\u79cd\u56e0\u7d20\u51b3\u5b9a\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u54ea\u91cc\u3002\u7528\u6237\u4e5f\u53ef\u4ee5\u5728\u4e24\u4e2a\u4f4d\u7f6e\u4e4b\u95f4\u79fb\u52a8\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n\u5f53\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u65f6\uff1a<br \/>\n<\/p>\n<ul><li> \u53ea\u8981\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u88c5\u8f7d\u5728\u8bbe\u5907\u4e0a\uff0c\u5e94\u7528\u7a0b\u5e8f\u7684\u6027\u80fd\u5c31\u4e0d\u4f1a\u53d7\u5230\u5f71\u54cd\u3002 \n<\/li><li> <code style=\"color:#060\">.apk<\/code>\u6587\u4ef6\u662f\u4fdd\u5b58\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u7684\uff0c\u4f46\u662f\u6240\u6709\u7684\u79c1\u6709\u7528\u6237\u6570\u636e\u3001\u6570\u636e\u5e93\u3001\u4f18\u5316\u7684<code style=\"color:#060\">.dex<\/code>\u6587\u4ef6\u548c\u63d0\u53d6\u7684\u672c\u5730\u4ee3\u7801\u90fd\u662f\u4fdd\u5b58\u5728\u8bbe\u5907\u7684\u5185\u5b58\u4e2d\u7684\u3002\n<\/li><li> \u4fdd\u5b58\u5e94\u7528\u7a0b\u5e8f\u7684\u552f\u4e00\u5bb9\u5668\u7ecf\u8fc7\u4e00\u4e2a\u968f\u673a\u4ea7\u751f\u7684\u5bc6\u94a5\u8fdb\u884c\u52a0\u5bc6\u3002\u8be5\u5bc6\u94a5\u53ea\u80fd\u7531\u6700\u521d\u5b89\u88c5\u8be5\u7a0b\u5e8f\u7684\u8bbe\u5907\u89e3\u5bc6\u3002\u56e0\u6b64\uff0c\u5b89\u88c5\u5728SD\u5361\u4e0a\u7684\u5e94\u7528\u7a0b\u5e8f\u53ea\u80fd\u5728\u67d0\u4e00\u4e2a\u56fa\u5b9a\u7684\u8bbe\u5907\u4e0a\u8fd0\u884c\u3002\n<\/li><li> \u7528\u6237\u53ef\u4ee5\u901a\u8fc7\u7cfb\u7edf\u8bbe\u7f6e\u5c06\u5e94\u7528\u7a0b\u5e8f\u79fb\u52a8\u5230\u5185\u5b58\u4e0a\u3002\n<\/li><\/ul>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #f7f7f7; border-left:4px solid; border-color:#ff0000;\">\n<p><strong>\u6ce8\u610f<\/strong>: \u5f53\u7528\u6237\u4f7f\u7528USB\u5927\u5bb9\u91cf\u5b58\u50a8\u5668\u4e0e\u8ba1\u7b97\u673a\u5171\u4eab\u6587\u4ef6\u65f6\uff0c\u6216\u901a\u8fc7\u7cfb\u7edf\u8bbe\u7f6e\u5378\u8f7dSD\u5361\u65f6\uff0c\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u5c06\u4ece\u672c\u8bbe\u5907\u5378\u8f7d\uff0c\u5e76\u4e14\u6240\u6709\u5728\u8be5\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u8fd0\u884c\u7684\u5e94\u7528\u7a0b\u5e8f\u5c06\u7acb\u523b\u88ab\u5173\u95ed\u3002\n<\/p>\n<\/div>\n<h2> <span class=\"mw-headline\" id=\".E5.90.91.E5.90.8E.E5.85.BC.E5.AE.B9\">\u5411\u540e\u517c\u5bb9<\/span><\/h2>\n<p>\u5e94\u7528\u7a0b\u5e8f\u80fd\u591f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u662fAPI level 8 \uff08android 2.2\uff09 \u4ee5\u4e0a\u7684\u8bbe\u5907\u7684\u7279\u70b9\u3002\u5728\u6b64\u4e4b\u524d\u7684\u5e94\u7528\u7a0b\u5e8f\u53ea\u80fd\u5b89\u88c5\u5728\u5185\u5b58\u4e2d\uff0c\u4e14\u4e0d\u80fd\u79fb\u52a8\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff08\u5373\u4f7f\u8bbe\u5907\u662fAPI level 8\u7684\uff09\u3002\u7136\u800c\uff0c\u5982\u679c\u5e94\u7528\u7a0b\u5e8f\u8bbe\u8ba1\u7684\u65f6\u5019\u5c31\u652f\u6301\u4f4e\u4e8eAPI level 8\u7684\u8bbe\u5907\u7684\uff0c\u90a3\u4e48\u7528\u6237\u53ef\u4ee5\u9009\u62e9\u5728API level 8\u53ca\u4ee5\u4e0a\u7684\u8bbe\u5907\u4e0a\u662f\u5426\u9700\u8981\u652f\u6301\u8fd9\u4e00\u7279\u6027\uff0c\u5e76\u4e14\u5728\u4f7f\u7528API level 8 \u4ee5\u4e0b\u7684\u8bbe\u5907\u7684\u65f6\u5019\u4ecd\u7136\u517c\u5bb9\u3002<br \/>\n\u8981\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u5b89\u88c5\u7a0b\u5e8f\uff0c\u5e76\u4e14\u4e0e\u4f4e\u4e8eAPI level 8 \u7684\u7248\u672c\u517c\u5bb9\uff0c\u9700\u8981\u505a\u5230\u4ee5\u4e0b\u51e0\u70b9\uff1a<br \/>\n1. \u5728<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html\">manifest<\/a>\u5143\u7d20\u4e2d\u6dfb\u52a0<code style=\"color:#060\">android:installLocation<\/code>\u5c5e\u6027\uff0c\u8bbe\u5c5e\u6027\u503c\u4e3a<code style=\"color:#060\">\"auto\"<\/code>\u6216<code style=\"color:#060\">\"preferExternal\"<\/code>\u3002<br \/>\n2. \u4fdd\u6301<code style=\"color:#060\">android:minSdkVersion<\/code>\u5c5e\u6027\u4e0d\u53d8\uff08\u4f4e\u4e8e8\u7684\u67d0\u4e2a\u503c\uff09\uff0c\u786e\u4fdd\u5e94\u7528\u7a0b\u5e8f\u7684\u4ee3\u7801\u80fd\u591f\u517c\u5bb9\u8be5\u7b49\u7ea7\u3002<br \/>\n3. \u4e3a\u4e86\u80fd\u591f\u7f16\u8bd1\u7a0b\u5e8f\uff0c\u5c06\u751f\u6210\u76ee\u6807\u8bbe\u4e3aAPI level 8\u3002 \u8fd9\u4e00\u6b65\u5fc5\u4e0d\u53ef\u5c11\uff0c\u56e0\u4e3a\u65e7\u7684android\u5e93\u4e0d\u8bc6\u522b<code style=\"color:#060\">android:installLocation<\/code>\u5c5e\u6027\uff0c\u5f53\u8be5\u5c5e\u6027\u5b58\u5728\u65f6\uff0c\u5e94\u7528\u7a0b\u5e8f\u5c06\u65e0\u6cd5\u7f16\u8bd1\u901a\u8fc7\u3002<br \/>\n\u5f53\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u4f4e\u4e8eAPI level 8 \u7684\u8bbe\u5907\u4e2d\u65f6\uff0c<code style=\"color:#060\">android:installLocation<\/code>\u5c5e\u6027\u5c06\u88ab\u5ffd\u7565\uff0c\u5e94\u7528\u7a0b\u5e8f\u5c06\u5b89\u88c5\u5728\u5185\u5b58\u4e2d\u3002\n<\/p>\n<div style=\"margin: 1em 0; padding: 10px; overflow: auto; background: #f7f7f7; border-left:4px solid; border-color:#f80;\">\n<p><strong>\u6ce8\u610f<\/strong>: \u5c3d\u7ba1\u5728\u8001\u7684\u5e73\u53f0\u4e0a\uff0c\u7c7b\u4f3c\u8fd9\u79cd\u7684XML\u6807\u8bb0\u4f1a\u88ab\u5ffd\u7565\uff0c \u4f46\u662f\u5728<code style=\"color:#060\">android:minSdkVersion<\/code>\u4f4e\u4e8e8\u65f6\uff0c\u7f16\u7a0b\u65f6\u4e5f\u4e00\u5b9a\u8981\u6ce8\u610f\u907f\u514d\u4f7f\u7528API level 8 \u63a8\u8350\u7684\u5199\u6cd5\uff0c\u9664\u975e\u5728\u4ee3\u7801\u4e2d\u5df2\u7ecf\u63d0\u4f9b\u4e86\u5411\u540e\u517c\u5bb9\u3002\u66f4\u591a\u5173\u4e8e\u5e94\u7528\u7a0b\u5e8f\u4ee3\u7801\u4e2d\u7684\u5411\u540e\u517c\u5bb9\u7684\u4fe1\u606f\uff0c\u8bf7\u53c2\u8003<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/resources\/articles\/backward-compatibility.html\">Backward Compatibility<\/a>\u6761\u76ee\u3002\n<\/p>\n<\/div>\n<h2> <span class=\"mw-headline\" id=\".E4.B8.8D.E5.BA.94.E8.A3.85.E5.9C.A8.E5.A4.96.E9.83.A8.E5.AD.98.E5.82.A8.E8.AE.BE.E5.A4.87.E7.9A.84.E7.A8.8B.E5.BA.8F\">\u4e0d\u5e94\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a0b\u5e8f<\/span><\/h2>\n<p>\u5f53\u7528\u6237\u4f7f\u7528USB\u5927\u5bb9\u91cf\u5b58\u50a8\u5668\u4e0e\u8ba1\u7b97\u673a\u5171\u4eab\u6587\u4ef6\u65f6\uff08\u6216\u76f8\u53cd\u5730\uff0c\u5378\u8f7d\u6216\u79fb\u9664\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u65f6\uff09\uff0c\u4efb\u4f55\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u3001\u6b63\u5728\u8fd0\u884c\u7684\u5e94\u7528\u7a0b\u5e8f\u5c06\u4f1a\u88ab\u5173\u95ed\u3002\u76f4\u5230\u5927\u5bb9\u91cf\u5b58\u50a8\u8bbe\u5907\u4e0d\u53ef\u7528\u3001\u968f\u673a\u53c8\u91cd\u65b0\u52a0\u8f7d\u5230\u8bbe\u5907\u4e2d\u65f6\uff0c\u7cfb\u7edf\u624d\u4f1a\u65e0\u6cd5\u8bc6\u522b\u5e94\u7528\u7a0b\u5e8f\u3002\u9664\u4e86\u5173\u95ed\u5e94\u7528\u7a0b\u5e8f\u4f7f\u5176\u4e0d\u53ef\u7528\u4e4b\u5916\uff0c\u6709\u4e9b\u60c5\u51b5\u4e0b\u4f1a\u4e25\u91cd\u635f\u574f\u67d0\u79cd\u7c7b\u578b\u7684\u5e94\u7528\u7a0b\u5e8f\u3002\u9274\u4e8e\u4ee5\u4e0a\u540e\u679c\uff0c\u5982\u679c\u5e94\u7528\u7a0b\u5e8f\u6709\u4ee5\u4e0b\u7279\u70b9\uff0c\u4e3a\u4e86\u8ba9\u5e94\u7528\u7a0b\u5e8f\u6301\u7eed\u7167\u5e38\u8fd0\u884c\uff0c\u7528\u6237\u5e94\u8be5\u5141\u8bb8\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e0a\u3002<br \/>\n<strong>\u670d\u52a1<\/strong><br \/>\n\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u539f\u672c\u8fd0\u884c\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/Service.html\">\u670d\u52a1<\/a>\u5c06\u88ab\u5173\u95ed\uff0c\u4e14\u4e0d\u80fd\u91cd\u542f\u3002\u7136\u800c\uff0c\u7528\u6237\u53ef\u4ee5\u6ce8\u518c<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/content\/Intent.html#ACTION_EXTERNAL_APPLICATIONS_AVAILABLE\">ACTION_EXTERNAL_APPLICATIONS_AVAILABLE<\/a>\u5e7f\u64ad\uff0c\u8be5\u5e7f\u64ad\u4f1a\u901a\u77e5\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e0a\u7684\u5e94\u7528\u7a0b\u5e8f\u7cfb\u7edf\u518d\u6b21\u53ef\u7528\u4e86\u3002\u90a3\u65f6\uff0c\u7528\u6237\u5c31\u53ef\u4ee5\u91cd\u542f\u670d\u52a1\u4e86\u3002\n<br \/><strong>\u8b66\u544a\u670d\u52a1<\/strong><br \/>\n\u4f7f\u7528<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/AlarmManager.html\">AlarmManager<\/a>\u6ce8\u518c\u7684\u6240\u6709\u8b66\u544a\u5c06\u4f1a\u53d6\u6d88\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u7528\u6237\u5fc5\u987b\u91cd\u65b0\u624b\u52a8\u6ce8\u518c\u3002\n<br \/><strong>\u8f93\u5165\u6cd5<\/strong><br \/>\n\u7528\u6237\u7684\u8f93\u5165\u6cd5\u5c06\u4f1a\u7531\u9ed8\u8ba4\u7684\u4ee3\u66ff\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u7528\u6237\u53ef\u4ee5\u901a\u8fc7\u7cfb\u7edf\u8bbe\u7f6e\u91cd\u65b0\u542f\u7528\u81ea\u5df1\u7684\u8f93\u5165\u6cd5\u3002\n<br \/><strong>\u52a8\u6001\u58c1\u7eb8<\/strong><br \/>\n\u8fd0\u884c\u4e2d\u7684\u52a8\u6001\u58c1\u7eb8\u5c06\u4f1a\u88ab\u9ed8\u8ba4\u7684\u52a8\u6001\u58c1\u7eb8\u4ee3\u66ff\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u7528\u6237\u53ef\u4ee5\u91cd\u65b0\u9009\u62e9\u52a8\u6001\u58c1\u7eb8\u3002\n<br \/><strong>\u6d3b\u52a8\u6587\u4ef6\u5939<\/strong><br \/>\n\u6d3b\u52a8\u6587\u4ef6\u5939\u5c06\u4f1a\u4ece\u4e3b\u9875\u9762\u79fb\u9664\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u7528\u6237\u53ef\u4ee5\u91cd\u65b0\u6dfb\u52a0\u6d3b\u52a8\u6587\u4ef6\u5939\u5230\u4e3b\u9875\u9762\u3002\n<br \/><strong>\u7a97\u53e3\u5c0f\u90e8\u4ef6<\/strong><br \/>\n\u7528\u6237\u7684<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/appwidgets\/index.html\">\u5e94\u7528\u7a0b\u5e8f\u7a97\u53e3\u5c0f\u90e8\u4ef6<\/a>\u5c06\u4f1a\u4ece\u4e3b\u9875\u9762\u79fb\u9664\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u65f6\uff0c\u7a97\u53e3\u5c0f\u90e8\u4ef6\u4e0d\u53ef\u7528\uff0c\u9664\u975e\u7528\u6237\u91cd\u7f6e\u4e86\u4e3b\u9875\u9762\u5e94\u7528\u7a0b\u5e8f\uff08\u901a\u5e38\u662f\u7cfb\u7edf\u91cd\u542f\uff09\u3002\n<br \/><strong>\u5e10\u53f7\u7ba1\u7406<\/strong><br \/>\n\u7531<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/accounts\/AccountManager.html\">AccountManager<\/a>\u521b\u5efa\u7684\u5e10\u6237\u5c06\u4f1a\u6d88\u5931\uff0c\u76f4\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u4e3a\u6b62\u3002\n<br \/><strong>\u540c\u6b65\u9002\u914d\u5668<\/strong><br \/>\n<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/content\/AbstractThreadedSyncAdapter.html\">AbstractThreadedSyncAdapter<\/a>\u53ca\u5176\u6240\u6709\u7684\u540c\u6b65\u529f\u80fd\u5c06\u5931\u6548\uff0c\u76f4\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u4e3a\u6b62\u3002\n<br \/><strong>\u8bbe\u5907\u7ba1\u7406\u5668<\/strong><br \/>\n<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/admin\/DeviceAdminReceiver.html\">DeviceAdminReceiver<\/a>\u53ca\u5176\u7ba1\u7406\u529f\u80fd\u5c06\u4f1a\u5931\u6548\uff0c\u8fd9\u5c06\u4f1a\u7ed9\u8bbe\u5907\u529f\u80fd\u5e26\u6765\u65e0\u6cd5\u9884\u6599\u7684\u540e\u679c\uff0c\u8fd9\u4e2a\u540e\u679c\u5c06\u4e00\u76f4\u6301\u7eed\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u91cd\u65b0\u52a0\u8f7d\u4e3a\u6b62\u3002\n<br \/><strong>\u76d1\u542c\u201c\u542f\u52a8\u5b8c\u6210\u201d\u7684\u5e7f\u64ad\u63a5\u6536\u5668<\/strong><br \/>\n\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u52a0\u8f7d\u5230\u8bbe\u5907\u4e4b\u524d\uff0c\u7cfb\u7edf\u8d1f\u8d23<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/content\/Intent.html#ACTION_BOOT_COMPLETED\">ACTION_BOOT_COMPLETED<\/a>\u5e7f\u64ad\u3002\u5982\u679c\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u5c06\u65e0\u6cd5\u63a5\u6536\u5230\u8fd9\u4e2a\u5e7f\u64ad\u3002\n<br \/><strong>\u590d\u5236\u4fdd\u62a4<\/strong><br \/>\n\u5982\u679c\u4f7f\u7528\u4e86android\u7535\u5b50\u5e02\u573a\u7684\u590d\u5236\u4fdd\u62a4\uff0c\u5e94\u7528\u7a0b\u5e8f\u5c06\u65e0\u6cd5\u5b89\u88c5\u5728SD\u5361\u4e0a\u3002\u7136\u800c\uff0c\u5982\u679c\u4f7f\u7528\u4e86android\u7535\u5b50\u5e02\u573a\u7684\u5e94\u7528\u7a0b\u5e8f\u8bb8\u53ef\u8bc1\uff0c\u5e94\u7528\u7a0b\u5e8f\u5c06\u53ef\u4ee5\u5b89\u88c5\u5728\u5185\u5b58\u6216\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e0a\uff0c\u5305\u62ecSD\u5361\u3002\n<br \/>\u5982\u679c\u5e94\u7528\u7a0b\u5e8f\u5305\u542b\u4ee5\u4e0a\u7279\u70b9\uff0c\u90a3\u4e48\u7528\u6237<strong>\u4e0d\u5e94\u8be5<\/strong>\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\u3002 \u9ed8\u8ba4\u60c5\u51b5\u4e0b\uff0c\u7cfb\u7edf\u4e0d\u5141\u8bb8\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5230\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u6240\u4ee5\u7528\u6237\u4e0d\u7528\u62c5\u5fc3\u5df2\u7ecf\u5b58\u5728\u7684\u5e94\u7528\u7a0b\u5e8f\u3002 \u7136\u800c\uff0c\u5982\u679c\u7528\u6237\u975e\u5e38\u80af\u5b9a\u5e94\u7528\u7a0b\u5e8f\u6c38\u8fdc\u90fd\u4e0d\u4f1a\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e2d\uff0c\u90a3\u4e48\u7528\u6237\u53ef\u4ee5\u663e\u793a\u5730\u58f0\u660e<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/manifest\/manifest-element.html#install\">android:installLocation<\/a>\u5c5e\u6027\uff0c\u5e76\u5c06\u5c5e\u6027\u503c\u8bbe\u4e3a<code style=\"color:#060\">\"internalOnly\"<\/code>. \u5c3d\u7ba1\u8fd9\u6837\u4e0d\u4f1a\u6539\u53d8\u7cfb\u7edf\u7684\u9ed8\u8ba4\u5c5e\u6027\uff0c\u4f46\u662f\u8fd9\u6837\u975e\u5e38\u660e\u786e\u5730\u58f0\u660e\u4e86\u5e94\u7528\u7a0b\u5e8f\u53ea\u80fd\u5b89\u88c5\u5728\u5185\u5b58\u4e2d\uff0c\u7ed9\u4e86\u7528\u6237\u548c\u5176\u4ed6\u5f00\u53d1\u8005\u4e00\u4e2a\u660e\u786e\u7684\u63d0\u793a\u3002\n<\/p>\n<h2> <span class=\"mw-headline\" id=\".E5.BA.94.E8.AF.A5.E8.A3.85.E5.9C.A8.E5.A4.96.E9.83.A8.E5.AD.98.E5.82.A8.E8.AE.BE.E5.A4.87.E7.9A.84.E7.A8.8B.E5.BA.8F\">\u5e94\u8be5\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a0b\u5e8f<\/span><\/h2>\n<p>\u7b80\u5355\u5730\u8bf4\uff0c\u4efb\u4f55\u6ca1\u6709\u4f7f\u7528\u4e0a\u8ff0\u7279\u70b9\u7684\u5e94\u7528\u7a0b\u5e8f\uff0c\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u65f6\u90fd\u662f\u5b89\u5168\u7684\u3002\u5927\u578b\u6e38\u620f\u901a\u5e38\u5c31\u662f\u5e94\u8be5\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u7684\u7a0b\u5e8f\u7c7b\u578b\uff0c\u56e0\u4e3a\u6e38\u620f\u4e0d\u4f7f\u7528\u65f6\u901a\u5e38\u4e0d\u9700\u8981\u63d0\u4f9b\u989d\u5916\u7684\u670d\u52a1\u3002\u5f53\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e0d\u53ef\u7528\u65f6\uff0c\u6e38\u620f\u8fdb\u7a0b\u7ed3\u675f\uff0c\u5f53\u5b58\u50a8\u8bbe\u5907\u518d\u6b21\u53ef\u7528\u65f6\uff0c\u4e0d\u5e94\u8be5\u6709\u660e\u663e\u7684\u5f71\u54cd\uff0c\u7528\u6237\u91cd\u542f\u6e38\u620f\u5373\u53ef\uff08\u5047\u8bbe\u6e38\u620f\u5728\u6b63\u5e38\u7684\u6d3b\u52a8\u5468\u671f\u5185\u6070\u5f53\u5730\u5b58\u50a8\u4e86\u6e38\u620f\u72b6\u6001\uff09\u3002<br \/>\n<\/p>\n\u5982\u679capk\u6587\u4ef6\u9700\u8981\u597d\u51e0\u5146\u7a7a\u95f4\uff0c\u7528\u6237\u5c31\u9700\u8981\u8003\u8651\u662f\u5426\u5c06\u5e94\u7528\u7a0b\u5e8f\u5b89\u88c5\u5728\u5916\u90e8\u5b58\u50a8\u8bbe\u5907\u4e0a\uff0c\u4e3a\u5185\u5b58\u4fdd\u7559\u66f4\u591a\u7684\u7a7a\u95f4\u3002<\/p>"}