{"title":"Selection","text":"<p>Android 3.0 \u4e3a\u7528\u6237\u63d0\u4f9b\u4e86\u201c\u957f\u6309\u201d\u624b\u52bf\u2014\u5728\u67d0\u4e2a\u4f4d\u7f6e\u4e0a\u4e00\u76f4\u4fdd\u6301\u89e6\u6478\u72b6\u6001\u4e00\u6bb5\u65f6\u95f4\u2014\u4f5c\u4e3a\u9009\u62e9\u6570\u636e\u7684\u5168\u5c40\u624b\u52bf\u3002\u8fd9\u4e2a\u53d8\u5316\u5f71\u54cd\u4e86\u60a8\u5e94\u7528\u5904\u7406\u591a\u9009\u548c\u4e0a\u4e0b\u6587\u64cd\u4f5c\u7684\u65b9\u6cd5\u3002\n<\/p><p>\u6539\u53d8\u4e86\u4ec0\u4e48\u5462\uff1f\n<\/p><p>\u4ee5\u524d\u7684 Android \u7248\u672c\u4e2d\uff0c\u957f\u6309\u624b\u52bf\u7528\u6765\u4e3a\u5f53\u524d\u9009\u62e9\u7684\u9879\u76ee\u63d0\u4f9b\u4e0a\u4e0b\u6587\u83dc\u5355\u3002\n<\/p><p>Android 3.0 \u6539\u53d8\u4e86\u8fd9\u4e00\u6a21\u5f0f\u3002\u957f\u6309\u624b\u52bf\u73b0\u5728\u7528\u6765\u9009\u62e9\u6570\u636e\u4ee5\u53ca\u5728\u88ab\u79f0\u4e3a (CAB) \u7684\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u663e\u793a\u663e\u793a\u4e00\u4e9b\u548c\u9009\u62e9\u6709\u5173\u7684\u64cd\u4f5c\u3002\n<\/p><p><br \/>\n<img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/selection_context_menu.png\" alt=\"selection_context_menu.png\" \/>\n<\/p><p>\u4ee5\u524d\u957f\u6309\u624b\u52bf\u7528\u6765\u663e\u793a\u4e0a\u4e0b\u6587\u83dc\u5355\u3002\n<\/p><p>\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f (CAB) \u7684\u7528\u6cd5\n<\/p><p>\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u6d6e\u4e8e\u60a8\u5e94\u7528\u7684\u5f53\u524d\u64cd\u4f5c\u680f\u4e0a\u65b9\u3002\u5f53\u7528\u6237\u901a\u8fc7\u957f\u6309\u8fdb\u5165\u9009\u62e9\u6a21\u5f0f\u65f6\uff0c\u9700\u8981\u663e\u793a\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/selection_cab_big.png\" alt=\"selection_cab_big.png\" \/>\n<\/p><p>\u6b64\u65f6\u7528\u6237\u53ef\u4ee5:\u901a\u8fc7\u89e6\u6478\u9009\u62e9\u9879\u76ee\u3002 \u5728\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u9009\u62e9\u64cd\u4f5c\uff0c\u5e76\u5e94\u7528\u4e8e\u6240\u6709\u5df2\u9009\u9879\u76ee\u3002\u4e4b\u540e\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u81ea\u52a8\u6d88\u5931\u3002 \n\u901a\u8fc7\u5bfc\u822a\u680f\u7684\u201c\u8fd4\u56de\u201d\u6309\u94ae\u5173\u95ed\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\uff0c\u4e5f\u53ef\u4ee5\u901a\u8fc7\u70b9\u51fb\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u7684\u9009\u62e9\u56fe\u6807\u5173\u95ed\u5b83\u3002\u5173\u95ed\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u7684\u540c\u65f6\u8981\u53d6\u6d88\u6240\u6709\u7684\u9009\u62e9\u3002 \n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/selection_cab_example.png\" alt=\"selection_cab_example.png\" \/>\n<\/p><p>\u9009\u62e9\u628a\u54ea\u4e9b\u64cd\u4f5c\u653e\u5728\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u60a8\u53ef\u4ee5\u9009\u62e9\u628a\u64cd\u4f5c\u548c\u5176\u5b83\u5143\u7d20\u653e\u5728\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u3002\u53c2\u8003 \u64cd\u4f5c\u680f \u4e00\u8282\uff0c\u8003\u8651\u5c06\u54ea\u4e9b\u64cd\u4f5c\u76f4\u63a5\u653e\u5728\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\uff0c\u54ea\u4e9b\u64cd\u4f5c\u653e\u5728\u201c\u66f4\u591a\u64cd\u4f5c\u201d\u83dc\u5355\u4e2d\u3002\n<\/p><p>\u81ea\u52a8\u8c03\u6574\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u7684\u5185\u5bb9\u5f88\u591a\u60c5\u51b5\u4e0b\uff0c\u60a8\u9700\u8981\u52a8\u6001\u8c03\u6574\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u7684\u64cd\u4f5c\u3002\u4e00\u4e9b\u80fd\u5e94\u7528\u4e8e\u5355\u4e2a\u9009\u62e9\u9879\u76ee\u7684\u64cd\u4f5c\u4e0d\u4e00\u5b9a\u80fd\u540c\u65f6\u5e94\u7528\u4e8e\u591a\u4e2a\u9009\u62e9\u9879\u3002\n<img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/selection_adjusting_actions.png\" alt=\"selection_adjusting_actions.png\" \/>\n<\/p>\n<h1> <span class=\"mw-headline\" id=\".E6.A3.80.E6.9F.A5.E6.B8.85.E5.8D.95\">\u68c0\u67e5\u6e05\u5355<\/span><\/h1>\n<ul><li>\u5982\u679c\u60a8\u7684\u5e94\u7528\u53ef\u4ee5\u6267\u884c\u591a\u9009\uff0c\u8bf7\u4f7f\u7528\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f (CAB)\u3002\n<\/li><\/ul>\n<ul><li>\u957f\u6309\u624b\u52bf\u53ea\u7528\u4e8e\u9009\u62e9\uff0c\u4e0d\u8981\u663e\u793a\u53e4\u8001\u7684\u4e0a\u4e0b\u6587\u83dc\u5355\u3002\n<\/li><\/ul>\n<ul><li>\u5982\u679c\u4e0d\u652f\u6301\u591a\u9009\uff0c\u90a3\u4e48\u957f\u6309\u624b\u52bf\u5e94\u5f53\u6ca1\u6709\u4efb\u4f55\u7684\u6548\u679c\u3002\n<\/li><\/ul>\n<ul><li>\u6309\u7167\u60a8\u5728\u64cd\u4f5c\u680f\u4e0a\u6392\u5217\u5185\u5bb9\u7684\u6807\u51c6\u6392\u5217\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\u4e2d\u7684\u5185\u5bb9\u3002\n<\/li><\/ul>"}