{"title":"Navigation","text":"<p>\u8003\u8651\u5230\u5bfc\u822a\u662f\u7528\u6237\u4f53\u9a8c\u7684\u91cd\u8981\u4e00\u73af\u3002\u5f88\u5c11\u6709\u6bd4\u4e0d\u4e00\u81f4\u6216\u8005\u9519\u8bef\u7684\u5bfc\u822a\u66f4\u52a0\u56f0\u6270\u7684\u7528\u6237\u7684\u3002Android 3.0 \u5bf9\u7cfb\u7edf\u7684\u5168\u5c40\u5bfc\u822a\u884c\u4e3a\u505a\u51fa\u4e86\u8f83\u5927\u7684\u6539\u53d8\u3002\u6839\u636e\u5411\u4e0a (Up) \u548c\u8fd4\u56de (Back) \u7684\u8bbe\u8ba1\u539f\u5219\uff0c\u4ed4\u7ec6\u8003\u8651\u60a8\u7684\u5e94\u7528\u7a0b\u5e8f\u884c\u4e3a\uff0c\u4f7f\u5f97\u60a8\u7684\u5e94\u7528\u53ef\u4ee5\u505a\u51fa\u51c6\u786e\u4e00\u81f4\u7684\u5bfc\u822a\u3002\n<\/p><p>Android 2.3 \u4ee5\u53ca\u66f4\u65e9\u7248\u672c\u7684\u7cfb\u7edf\u4f7f\u7528\u8bbe\u5907\u4e0a\u7684\u8fd4\u56de\u952e\u5728\u5e94\u7528\u5185\u5bfc\u822a\u3002Android 3.0 \u5f15\u5165\u4e86\u64cd\u4f5c\u680f\u4e4b\u540e\uff0c\u7b2c\u4e8c\u79cd\u5bfc\u822a\u65b9\u5f0f\u5c31\u51fa\u73b0\u4e86: \u5411\u4e0a\u6309\u94ae\uff0c\u5b83\u7531\u5e94\u7528\u56fe\u6807\u548c\u5411\u5de6\u7684\u7bad\u5934\u7ec4\u6210\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_with_back_and_up.png\" alt=\"navigation_with_back_and_up.png\" \/>\n<\/p><p><br \/>\n<\/p>\n<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#.E5.90.91.E4.B8.8A_vs._.E8.BF.94.E5.9B.9E_-_Up_vs._Back\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">\u5411\u4e0a vs. \u8fd4\u56de - Up vs. Back<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#.E5.BA.94.E7.94.A8.E5.86.85.E7.9A.84.E5.AF.BC.E8.88.AA_-_Navigation_Within_Your_App\"><span class=\"tocnumber\">2<\/span> <span class=\"toctext\">\u5e94\u7528\u5185\u7684\u5bfc\u822a - Navigation Within Your App<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#.E5.AF.BC.E8.88.AA.E5.88.B0.E6.9C.89.E5.A4.9A.E4.B8.AA.E5.85.A5.E5.8F.A3.E7.9A.84.E5.B1.8F.E5.B9.95\"><span class=\"tocnumber\">2.1<\/span> <span class=\"toctext\">\u5bfc\u822a\u5230\u6709\u591a\u4e2a\u5165\u53e3\u7684\u5c4f\u5e55<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#.E5.9C.A8.E5.B1.8F.E5.B9.95.E4.B8.AD.E5.88.87.E6.8D.A2.E8.AF.95.E5.9B.BE\"><span class=\"tocnumber\">2.2<\/span> <span class=\"toctext\">\u5728\u5c4f\u5e55\u4e2d\u5207\u6362\u8bd5\u56fe<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#.E5.9C.A8.E5.90.8C.E7.BA.A7.E5.B1.8F.E5.B9.95.E4.B9.8B.E9.97.B4.E5.AF.BC.E8.88.AA\"><span class=\"tocnumber\">2.3<\/span> <span class=\"toctext\">\u5728\u540c\u7ea7\u5c4f\u5e55\u4e4b\u95f4\u5bfc\u822a<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#.E5.BA.94.E7.94.A8.E5.A4.96.E7.9A.84.E5.AF.BC.E8.88.AA_-_Navigation_From_Outside_Your_App\"><span class=\"tocnumber\">3<\/span> <span class=\"toctext\">\u5e94\u7528\u5916\u7684\u5bfc\u822a - Navigation From Outside Your App<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#.E5.BA.94.E7.94.A8.E9.97.B4.E7.9A.84.E5.AF.BC.E8.88.AA\"><span class=\"tocnumber\">3.1<\/span> <span class=\"toctext\">\u5e94\u7528\u95f4\u7684\u5bfc\u822a<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-8\"><a href=\"#.E7.B3.BB.E7.BB.9F.E5.88.B0.E5.BA.94.E7.94.A8.E7.9A.84.E5.AF.BC.E8.88.AA\"><span class=\"tocnumber\">3.2<\/span> <span class=\"toctext\">\u7cfb\u7edf\u5230\u5e94\u7528\u7684\u5bfc\u822a<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h3> <span class=\"mw-headline\" id=\".E5.90.91.E4.B8.8A_vs._.E8.BF.94.E5.9B.9E_-_Up_vs._Back\">\u5411\u4e0a vs. \u8fd4\u56de - Up vs. Back<\/span><\/h3>\n<p>\u201c\u5411\u4e0a\u201d\u6309\u94ae\u7528\u6765\u5728\u5e94\u7528\u5185\uff0c\u6839\u636e\u7a0b\u5e8f\u7684\u903b\u8f91\u5c42\u7ea7\u8fdb\u884c\u5bfc\u822a\u3002\u4e3e\u4f8b\u6765\u8bf4\uff0c\u5c4f\u5e55 A \u663e\u793a\u4e86\u4e00\u4e2a\u9879\u76ee\u5217\u8868\uff0c\u70b9\u51fb\u5176\u4e2d\u4e00\u9879\u5230\u8fbe\u5c4f\u5e55 B (\u663e\u793a\u8be5\u9879\u76ee\u7684\u8be6\u7ec6\u4fe1\u606f)\uff0c\u90a3\u4e48\u5c4f\u5e55 B \u5e94\u5f53\u63d0\u4f9b\u4e00\u4e2a\u201c\u5411\u4e0a\u201d\u6309\u94ae\uff0c\u8ba9\u7528\u6237\u53ef\u4ee5\u56de\u5230\u5c4f\u5e55 A\u3002\n<\/p><p>\u5982\u679c\u67d0\u4e2a\u5c4f\u5e55\u5df2\u7ecf\u662f\u8be5\u5e94\u7528\u7684\u9876\u5c42\u4e86 (\u4f8b\u5982\uff0c\u5e94\u7528\u7684\u4e3b\u9875)\uff0c\u90a3\u4e0d\u9700\u8981\u201c\u5411\u4e0a\u201d\u6309\u94ae\u3002\n<\/p><p>\u7cfb\u7edf\u7684\u201c\u8fd4\u56de\u201d\u952e\u5219\u7528\u4e8e\u6309\u7167\u5c4f\u5e55\u5207\u6362\u5386\u53f2\u8fd4\u56de\u5230\u4e0a\u4e00\u5c4f\u5e55\u3002\n<\/p><p>\u5982\u679c\u4e4b\u524d\u7684\u5c4f\u5e55\u5c31\u662f\u903b\u8f91\u5c42\u6b21\u7684\u4e0a\u4e00\u5c42\uff0c\u90a3\u4e48\u201c\u8fd4\u56de\u201d\u548c\u201c\u5411\u4e0a\u201d\u7684\u884c\u4e3a\u662f\u4e00\u6837\u7684\u3002\u4e0d\u8fc7\u548c\u201c\u5411\u4e0a\u201d\u4e0d\u540c\u7684\u662f\uff0c\u201c\u8fd4\u56de\u201d\u53ef\u80fd\u56de\u5230\u201c\u4e3b\u5c4f\u5e55\u201d\u6216\u8005\u5176\u5b83\u7684\u5e94\u7528\uff0c\u201c\u5411\u4e0a\u201d\u56de\u5230\u7684\u5c4f\u5e55\u603b\u662f\u5728\u60a8\u7684\u5e94\u7528\u4e2d\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_up_vs_back_gmail.png\" alt=\"navigation_up_vs_back_gmail.png\" \/>\n<\/p><p>\u201c\u8fd4\u56de\u201d\u952e\u8fd8\u652f\u6301\u4e00\u4e9b\u4e0d\u662f\u5c4f\u5e55\u548c\u5c4f\u5e55\u4e4b\u95f4\u7684\u5bfc\u822a\u7684\u884c\u4e3a:\n<\/p>\n<ul><li> \u201c\u8fd4\u56de\u201d\u952e\u53ef\u4ee5\u5173\u95ed\u5f39\u51fa\u7a97\u53e3 (\u5bf9\u8bdd\u6846\u6216\u8005\u5f39\u51fa\u4fe1\u606f)\n<\/li><li> \u201c\u8fd4\u56de\u201d\u952e\u53ef\u4ee5\u5173\u95ed\u4e0a\u4e0b\u6587\u64cd\u4f5c\u680f\uff0c\u8fd8\u53ef\u4ee5\u6e05\u9664\u5f53\u524d\u7684\u9009\u62e9\n<\/li><li> \u201c\u8fd4\u56de\u201d\u952e\u53ef\u4ee5\u5173\u95ed\u5c4f\u5e55\u952e\u76d8 (IME)\n<\/li><\/ul>\n<h3> <span class=\"mw-headline\" id=\".E5.BA.94.E7.94.A8.E5.86.85.E7.9A.84.E5.AF.BC.E8.88.AA_-_Navigation_Within_Your_App\">\u5e94\u7528\u5185\u7684\u5bfc\u822a - Navigation Within Your App<\/span><\/h3>\n<h4> <span class=\"mw-headline\" id=\".E5.AF.BC.E8.88.AA.E5.88.B0.E6.9C.89.E5.A4.9A.E4.B8.AA.E5.85.A5.E5.8F.A3.E7.9A.84.E5.B1.8F.E5.B9.95\">\u5bfc\u822a\u5230\u6709\u591a\u4e2a\u5165\u53e3\u7684\u5c4f\u5e55<\/span><\/h4>\n<p>\u6709\u65f6\uff0c\u67d0\u4e2a\u5c4f\u5e55\u5728\u5e94\u7528\u7684\u903b\u8f91\u7ed3\u6784\u4e2d\u7684\u4f4d\u7f6e\u5e76\u4e0d\u56fa\u5b9a\uff0c\u53ef\u4ee5\u4ece\u591a\u4e2a\u5730\u65b9\u8fdb\u5165\u8be5\u5c4f\u5e55\uff0c\u4f8b\u5982\u8bbe\u7f6e\u9875\u9762\u5c31\u53ef\u4ee5\u4ece\u60a8\u5e94\u7528\u4e2d\u7684\u4efb\u4f55\u4f4d\u7f6e\u8fdb\u5165\u3002\u8fd9\u79cd\u60c5\u51b5\u4e0b\uff0c\u201c\u5411\u4e0a\u201d\u6309\u94ae\u4f1a\u56de\u5230\u4e4b\u524d\u7684\u5c4f\u5e55\uff0c\u884c\u4e3a\u548c\u201c\u8fd4\u56de\u201d\u5b8c\u5168\u4e00\u81f4\u3002\n<\/p>\n<h4> <span class=\"mw-headline\" id=\".E5.9C.A8.E5.B1.8F.E5.B9.95.E4.B8.AD.E5.88.87.E6.8D.A2.E8.AF.95.E5.9B.BE\">\u5728\u5c4f\u5e55\u4e2d\u5207\u6362\u8bd5\u56fe<\/span><\/h4>\n<p>\u540c\u4e00\u5c4f\u5e55\u4e2d\u7684\u89c6\u56fe\u5207\u6362\u4e0d\u4f1a\u5f71\u54cd\u201c\u5411\u4e0a\u201d\u548c\u201c\u8fd4\u56de\u201d\u6309\u94ae\u7684\u884c\u4e3a\uff0c\u56e0\u4e3a\u89c6\u56fe\u7684\u5207\u6362\u4e0d\u4f1a\u5f71\u54cd\u5f53\u524d\u5c4f\u5e55\u5728\u4f60\u5e94\u7528\u4e2d\u7684\u4f4d\u7f6e\uff0c\u4e5f\u4e0d\u4f1a\u5f71\u54cd\u5c4f\u5e55\u7684\u5bfc\u822a\u5386\u53f2\u3002\n<\/p><p>\u4f8b\u5982:\n<\/p>\n<ul><li> \u901a\u8fc7\u6807\u7b7e\u6216\u8005\u5de6\u53f3\u6ed1\u52a8\u5207\u6362\u89c6\u56fe\n<\/li><li> \u4f7f\u7528\u4e0b\u62c9\u5217\u8868 (collapsed tabs) \u5207\u6362\u89c6\u56fe\n<\/li><li> \u8fc7\u6ee4\u5217\u8868\n<\/li><li> \u5bf9\u5217\u8868\u8fdb\u884c\u6392\u5e8f\n<\/li><li> \u8c03\u6574\u663e\u793a\u7279\u6027 (\u4f8b\u5982\u7f29\u653e)\n<\/li><\/ul>\n<h4> <span class=\"mw-headline\" id=\".E5.9C.A8.E5.90.8C.E7.BA.A7.E5.B1.8F.E5.B9.95.E4.B9.8B.E9.97.B4.E5.AF.BC.E8.88.AA\">\u5728\u540c\u7ea7\u5c4f\u5e55\u4e4b\u95f4\u5bfc\u822a<\/span><\/h4>\n<p>\u5982\u679c\u60a8\u7684\u5e94\u7528\u53ef\u4ee5\u4ece\u4e00\u4e2a\u5217\u8868\u4e2d\u8fdb\u5165\u67d0\u4e2a\u6761\u76ee\u7684\u8be6\u7ec6\u4fe1\u606f\u9875\u9762\uff0c\u90a3\u4e48\u5e94\u5f53\u8003\u8651\u63d0\u4f9b\u5728\u76f8\u90bb\u6761\u76ee\u7684\u8be6\u7ec6\u4fe1\u606f\u9875\u9762\u4e4b\u95f4\u7684\u76f4\u63a5\u5bfc\u822a\u3002\u4f8b\u5982\u5728 Gmail \u5e94\u7528\u4e2d\uff0c\u901a\u8fc7\u5de6\u53f3\u6ed1\u52a8\u90ae\u4ef6\u5bf9\u8bdd\u89c6\u56fe\uff0c\u53ef\u4ee5\u5728\u76f8\u540c\u6536\u4ef6\u7bb1\u7684\u4e0a\u4e00\u6761\u548c\u4e0b\u4e00\u6761\u90ae\u4ef6\u5bf9\u8bdd\u4e4b\u95f4\u5bfc\u822a\u3002\u7531\u4e8e\u662f\u5728\u540c\u4e00\u4e2a\u5c4f\u5e55\u4e2d\u53d8\u6362\u89c6\u56fe\uff0c\u6240\u4ee5\u8fd9\u6837\u7684\u64cd\u4f5c\u4e0d\u4f1a\u5f71\u54cd\u201c\u5411\u4e0a\u201d\u548c\u201c\u8fd4\u56de\u201d\u7684\u884c\u4e3a\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_between_siblings_gmail.png\" alt=\"navigation_between_siblings_gmail.png\" \/>\n<\/p><p>\u4f46\u662f\u8981\u6ce8\u610f\u5230\uff0c\u6d4f\u89c8\u201c\u76f8\u5173\u201d\u4f46\u662f\u4e0d\u662f\u76f8\u90bb\u7684\u8be6\u7ec6\u4fe1\u606f\u65f6\uff0c\u201c\u5411\u4e0a\u201d\u548c\u201c\u8fd4\u56de\u201d\u7684\u884c\u4e3a\u4f1a\u53d1\u751f\u53d8\u5316\u3002\u4f8b\u5982\uff0c\u5728\u7535\u5b50\u5e02\u573a\u4e2d\u6d4f\u89c8\u540c\u4e00\u5f00\u53d1\u8005\u7684\u5176\u5b83\u5e94\u7528\u6216\u8005\u540c\u4e00\u4f4d\u6b4c\u624b\u7684\u4e0d\u540c\u4e13\u8f91\u3002\u8fd9\u6837\u7684\u64cd\u4f5c\u4f1a\u5bfc\u81f4\u5c4f\u5e55\u5386\u53f2\u53d1\u751f\u53d8\u5316\uff0c\u90a3\u4e48\u201c\u8fd4\u56de\u201d\u6309\u94ae\u5c31\u4f1a\u56de\u5230\u4e0a\u4e00\u4e2a\u6d4f\u89c8\u7684\u9879\u76ee\uff0c\u800c\u4e0d\u662f\u9879\u76ee\u5217\u8868\u3002\u201c\u5411\u4e0a\u201d\u6309\u94ae\u5219\u4ecd\u7136\u4f1a\u56de\u5230\u9879\u76ee\u5217\u8868\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_between_siblings_market1.png\" alt=\"navigation_between_siblings_market1.png\" \/>\n<\/p><p>\u60a8\u8fd8\u53ef\u4ee5\u4f7f\u201c\u5411\u4e0a\u201d\u7684\u884c\u4e3a\u6839\u636e\u5f53\u524d\u7684\u9875\u9762\u5185\u5bb9\u53d8\u5316\uff0c\u4f7f\u5b83\u66f4\u52a0\u806a\u660e (\u8bd1\u8005: \u66f4\u52a0\u590d\u6742\u4e86-_-)\u3002\u6211\u4eec\u6269\u5c55\u4e00\u4e0b\u4e4b\u524d\u7535\u5b50\u5e02\u573a\u7684\u4f8b\u5b50\uff0c\u5982\u679c\u7528\u6237\u4ece\u4e00\u672c\u56fe\u4e66\u7684\u8be6\u7ec6\u4fe1\u606f\u9875\u9762\u8df3\u8f6c\u5230\u67d0\u90e8\u7535\u5f71\u3002\u8fd9\u65f6\u201c\u5411\u4e0a\u201d\u5e94\u5f53\u8fd4\u56de\u5230\u7535\u5f71\u5217\u8868\u800c\u4e0d\u662f\u4e4b\u524d\u7684\u56fe\u4e66\u5217\u8868\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_between_siblings_market2.png\" alt=\"navigation_between_siblings_market2.png\" \/>\n<\/p>\n<h3> <span class=\"mw-headline\" id=\".E5.BA.94.E7.94.A8.E5.A4.96.E7.9A.84.E5.AF.BC.E8.88.AA_-_Navigation_From_Outside_Your_App\">\u5e94\u7528\u5916\u7684\u5bfc\u822a - Navigation From Outside Your App<\/span><\/h3>\n<p>\u8fd8\u6709\u4e24\u7c7b\u5bfc\u822a\u53ef\u4ee5\u4ece\u5e94\u7528\u4e4b\u5916\u8fdb\u5165\u60a8\u5e94\u7528\u7684\u6df1\u5c42\u9875\u9762:\n<\/p><p>\u5e94\u7528\u95f4\u7684\u5bfc\u822a\uff0c\u4f8b\u5982\u901a\u8fc7\u6ce8\u518c\u7684 intent\u3002\n\u7cfb\u7edf\u5230\u5e94\u7528\u7684\u5bfc\u822a\uff0c\u4f8b\u5982\u4ece\u901a\u77e5\u680f\u6216\u8005\u4e3b\u5c4f\u5e55\u7684\u5c0f\u5de5\u5177\u8fdb\u5165\u3002\nGmail \u5e94\u7528\u5c31\u63d0\u4f9b\u8fd9\u4e9b\u4f8b\u5b50\u3002\u5bf9\u4e8e\u5e94\u7528\u95f4\u7684\u5bfc\u822a\uff0c\u53ef\u4ee5\u901a\u8fc7\u5e94\u7528\u4e2d\u7684\u201c\u5206\u4eab\u201d\u76f4\u63a5\u8fdb\u5165\u64b0\u5199\u65b0\u90ae\u4ef6\u7684\u5c4f\u5e55\u3002\u5bf9\u4e8e\u7cfb\u7edf\u5230\u5e94\u7528\u7684\u5bfc\u822a\uff0c\u901a\u77e5\u680f\u548cGmail \u5e94\u7528\u7684\u5c0f\u5de5\u5177\u90fd\u53ef\u4ee5\u4f7f\u7528\u6237\u8df3\u8fc7\u6536\u4ef6\u7bb1\uff0c\u76f4\u63a5\u8fdb\u5165\u90ae\u4ef6\u5bf9\u8bdd\u89c6\u56fe\u3002\n<\/p>\n<h4> <span class=\"mw-headline\" id=\".E5.BA.94.E7.94.A8.E9.97.B4.E7.9A.84.E5.AF.BC.E8.88.AA\">\u5e94\u7528\u95f4\u7684\u5bfc\u822a<\/span><\/h4>\n<p>\u5f53\u5176\u5b83\u5e94\u7528\u901a\u8fc7 intent \u76f4\u63a5\u8fdb\u5165\u60a8\u5e94\u7528\u7684\u6df1\u5c42\u5c4f\u5e55\uff0c\u201c\u8fd4\u56de\u201d\u5c06\u56de\u5230\u4e4b\u524d\u7684\u5e94\u7528\u4e2d\u3002\n<\/p><p>\u201c\u5411\u4e0a\u201d\u5219\u5e94\u5f53\u6309\u7167\u4e00\u4e0b\u7684\u89c4\u5219\u5904\u7406:\n<\/p><p>- \u5982\u679c\u8be5\u5c4f\u5e55\u5728\u60a8\u7684\u5e94\u7528\u4e2d\u4e00\u822c\u662f\u901a\u8fc7\u4e00\u4e2a\u9879\u76ee\u5217\u8868\u8fdb\u5165\u7684\uff0c\u4f8b\u5982\u67d0\u6761\u9879\u76ee\u7684\u8be6\u7ec6\u4fe1\u606f\uff0c\u90a3\u4e48\u201c\u5411\u4e0a\u201d\u5e94\u5f53\u56de\u5230\u9879\u76ee\u5217\u8868\u3002\n- \u5982\u679c\u4e0d\u662f\u4e0a\u4e00\u79cd\u60c5\u51b5\uff0c\u201c\u5411\u4e0a\u201d\u5c31\u5e94\u5f53\u56de\u5230\u60a8\u5e94\u7528\u7684\u9996\u9875\u3002\n\u4f8b\u5982\uff0c\u4ece\u7535\u5b50\u5e02\u573a\u7684\u56fe\u4e66\u8be6\u7ec6\u4fe1\u606f\u9875\u9762\u901a\u8fc7\u201c\u5206\u4eab\u201d\u8fdb\u5165 Gmail \u7684\u64b0\u5199\u5c4f\u5e55\u65f6\uff0c\u201c\u5411\u4e0a\u201d\u4f1a\u56de\u5230\u6536\u4ef6\u7bb1\uff0c\u800c\u201c\u8fd4\u56de\u201d\u4f1a\u56de\u5230\u7535\u5b50\u5e02\u573a\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_from_outside_up.png\" alt=\"navigation_from_outside_up.png\" \/>\n<\/p><p><br \/>\n<\/p>\n<h4> <span class=\"mw-headline\" id=\".E7.B3.BB.E7.BB.9F.E5.88.B0.E5.BA.94.E7.94.A8.E7.9A.84.E5.AF.BC.E8.88.AA\">\u7cfb\u7edf\u5230\u5e94\u7528\u7684\u5bfc\u822a<\/span><\/h4>\n<p>\u5982\u679c\u60a8\u7684\u5e94\u7528\u53ef\u4ee5\u901a\u8fc7\u901a\u77e5\u680f\u6216\u8005\u4e3b\u5c4f\u5e55\u4e0a\u7684\u5c0f\u5de5\u5177\u8fdb\u5165\uff0c\u6b64\u65f6\u201c\u5411\u4e0a\u201d\u7684\u884c\u4e3a\u548c\u4e0a\u9762\u7684\u201c\u5e94\u7528\u95f4\u7684\u5bfc\u822a\u201d\u63cf\u8ff0\u7684\u5b8c\u5168\u4e00\u81f4\u3002\n<\/p><p>\u5bf9\u4e8e\u201c\u8fd4\u56de\u201d\u6309\u94ae\uff0c\u5219\u5e94\u5f53\u6309\u7167\u80fd\u591f\u56de\u5230\u60a8\u5e94\u7528\u4e3b\u9875\u7684\u5bfc\u822a\u8def\u5f84\uff0c\u5411\u4e0a\u79fb\u52a8\u4e00\u4e2a\u5c4f\u5e55\u3002\u8fd9\u6837\u7528\u6237\u5373\u4f7f\u4e0d\u8bb0\u5f97\u662f\u5982\u4f55\u8fdb\u5165\u8be5\u5c4f\u5e55\u7684\uff0c\u4e5f\u53ef\u4ee5\u901a\u8fc7\u4e00\u76f4\u6309\u201c\u8fd4\u56de\u201d\u952e\u56de\u5230\u60a8\u5e94\u7528\u7684\u4e3b\u9875\uff0c\u76f4\u81f3\u9000\u51fa\u5e94\u7528\u3002\n<\/p><p>\u4f8b\u5982\uff0cGmail \u7684\u4e3b\u5c4f\u5e55\u5c0f\u5de5\u5177\u63d0\u4f9b\u4e86\u4e00\u4e2a\u6309\u94ae\u53ef\u4ee5\u76f4\u63a5\u8fdb\u5165\u64b0\u5199\u5c4f\u5e55\u3002\u6309\u7167\u5bfc\u822a\u539f\u5219\uff0c\u201c\u8fd4\u56de\u201d\u952e\u4f1a\u9996\u5148\u56de\u5230\u6536\u4ef6\u7bb1\uff0c\u4e4b\u540e\u518d\u6309\u201c\u8fd4\u56de\u201d\u624d\u4f1a\u56de\u5230\u4e3b\u5c4f\u5e55\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/navigation_from_outside_back.png\" alt=\"navigation_from_outside_back.png\" \/>\n<\/p><p><br \/>\n\u539f\u6587\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/design\/patterns\/navigation.html#within-app\">http:\/\/docs.eoeandroid.com\/design\/patterns\/navigation.html#within-app<\/a>\n<\/p><p><br \/>\n<\/p>\n<pre> <a href=\"http:\/\/wiki.eoeandroid.com\/%E6%89%8B%E5%8A%BF_-_Gestures\" title=\"\u624b\u52bf - Gestures\">\u624b\u52bf - Gestures<\/a>    &lt;&lt;\u4e0a\u4e00\u7bc7 | \u4e0b\u4e00\u7bc7&gt;&gt;   <a href=\"http:\/\/wiki.eoeandroid.com\/%E6%93%8D%E4%BD%9C%E6%A0%8F_-_Action_Bar\" title=\"\u64cd\u4f5c\u680f - Action Bar\">\u64cd\u4f5c\u680f - Action Bar<\/a>\n<\/pre>"}