{"title":"App Structure","text":"<p>\u4e0d\u540c\u7684\u5e94\u7528\u5bf9\u4e8e\u754c\u9762\u7ed3\u6784\u7684\u9700\u6c42\u662f\u4e0d\u540c\u7684\u3002\u4f8b\u5982:\n<\/p>\n<ul><li> \u50cf\u8ba1\u7b97\u5668\u548c\u76f8\u673a\u5e94\u7528\uff0c\u6784\u5efa\u5728\u4e00\u4e2a\u4e3b\u8981\u7684 Activity \u4e0a\uff0c\u8fd9\u4e2a\u5355\u4e00\u7684 Activity \u5904\u7406\u5404\u79cd\u64cd\u4f5c\n<\/li><li> \u50cf\u62e8\u53f7\u5e94\u7528\uff0c\u4e3b\u8981\u7684\u662f\u5728\u51e0\u4e2a\u4e0d\u540c\u7684 Activity \u4e2d\u5207\u6362\uff0c\u6ca1\u6709\u5f88\u590d\u6742\u7684\u5bfc\u822a\n<\/li><li> \u50cf Gmail \u548c Google \u5e02\u573a\uff0c\u5305\u62ec\u4e86\u591a\u4e2a\u6570\u636e\u89c6\u56fe\u548c\u590d\u6742\u7684\u6d4f\u89c8\u65b9\u5f0f\n<\/li><\/ul>\n<p>\u60a8\u5e94\u7528\u7684\u7ed3\u6784\u4e3b\u8981\u7531\u5185\u5bb9\u548c\u5c55\u793a\u7ed9\u7528\u6237\u7684\u529f\u80fd\u51b3\u5b9a\u3002\n<\/p>\n<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#.E5.9F.BA.E6.9C.AC.E7.BB.93.E6.9E.84_-_General_Structure\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">\u57fa\u672c\u7ed3\u6784 - General Structure<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#.E9.A1.B6.E5.B1.82_-_Top_Level\"><span class=\"tocnumber\">2<\/span> <span class=\"toctext\">\u9876\u5c42 - Top Level<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#.E5.88.86.E7.B1.BB.E7.9B.AE.E5.BD.95_-_Categories\"><span class=\"tocnumber\">3<\/span> <span class=\"toctext\">\u5206\u7c7b\u76ee\u5f55 - Categories<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#.E8.AF.A6.E7.BB.86.E4.BF.A1.E6.81.AF_-_Details\"><span class=\"tocnumber\">4<\/span> <span class=\"toctext\">\u8be6\u7ec6\u4fe1\u606f - Details<\/span><\/a><\/li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#.E6.B8.85.E5.8D.95_-_Checklist\"><span class=\"tocnumber\">5<\/span> <span class=\"toctext\">\u6e05\u5355 - Checklist<\/span><\/a><\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h3> <span class=\"mw-headline\" id=\".E5.9F.BA.E6.9C.AC.E7.BB.93.E6.9E.84_-_General_Structure\">\u57fa\u672c\u7ed3\u6784 - General Structure<\/span><\/h3>\n<p>\u5178\u578b\u7684 Android \u5e94\u7528\u7531\u9876\u5c42\u89c6\u56fe\u548c\u8be6\u7ec6\u4fe1\u606f\/\u7f16\u8f91\u89c6\u56fe\u7ec4\u6210\u3002\u5982\u679c\u663e\u793a\u7684\u4e1c\u897f\u975e\u5e38\u591a\u6216\u8005\u6b65\u9aa4\u590d\u6742\uff0c\u4f7f\u7528 \u5206\u7c7b\u76ee\u5f55 \u8fde\u63a5\u9876\u5c42\u548c\u8be6\u7ec6\u4fe1\u606f\u3002\n<\/p>\n<table style=\"border-spacing: 0px; margin: 0px -8px; width: 95%; border-width: thin;\" border=\"0px\">\n\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_overview.png\" alt=\"app_structure_overview.png\" \/>\n<\/p>\n<\/td>\n<td style=\"width:40%; vertical-align:top;padding: 20px;\">\n<p><b>\u9876\u5c42\u89c6\u56fe<\/b>\n<\/p><p>\u4e5f\u5c31\u662f\u60a8\u5e94\u7528\u4e2d\u51e0\u4e2a\u64cd\u4f5c\u680f\u6807\u7b7e\u7684\u9876\u5c42\u89c6\u56fe\u3002\u8fd9\u4e9b\u89c6\u56fe\u53ef\u4ee5\u662f\u5bf9\u4e8e\u76f8\u540c\u6570\u636e\u7684\u4e0d\u540c\u5c55\u793a\u65b9\u5f0f\uff0c\u4e5f\u53ef\u4ee5\u4ee3\u8868\u60a8\u5e94\u7528\u4e2d\u7684\u4e0d\u540c\u529f\u80fd\u3002\n<br \/><br \/><br \/><br \/><br \/><br \/>\n<\/p><p><b>\u5206\u7c7b\u76ee\u5f55\u89c6\u56fe<\/b>\n<\/p><p>\u5206\u7c7b\u76ee\u5f55\u53ef\u4ee5\u8fdb\u4e00\u6b65\u663e\u793a\u6570\u636e\u3002\n<br \/><br \/><br \/><br \/><br \/><br \/>\n<\/p><p><b>\u8be6\u7ec6\u4fe1\u606f\/\u7f16\u8f91\u89c6\u56fe<\/b>\n<\/p><p>\u5728\u8be6\u7ec6\u4fe1\u606f\/\u7f16\u8f91\u89c6\u56fe\u4e2d\uff0c\u7528\u6237\u5c06\u770b\u5230\u5168\u90e8\u6570\u636e\u6216\u8005\u8fdb\u884c\u7f16\u8f91\u3002\n<\/p>\n<\/td><\/tr><\/table>\n<p><br \/>\n<\/p>\n<h3> <span class=\"mw-headline\" id=\".E9.A1.B6.E5.B1.82_-_Top_Level\">\u9876\u5c42 - Top Level<\/span><\/h3>\n<p>\u60a8\u5e94\u7528\u7684\u4e3b\u9875\u8bbe\u8ba1\u9700\u8981\u4ed4\u7ec6\u63a8\u6572\u3002\u5b83\u662f\u4eba\u4eec\u6bcf\u6b21\u542f\u52a8\u5e94\u7528\u65f6\u90fd\u4f1a\u770b\u5230\u7684\u754c\u9762\uff0c\u6240\u4ee5\u5e94\u5f53\u8003\u8651\u5230\u65b0\u7528\u6237\u548c\u8001\u7528\u6237\u3002\n<\/p><p>\u8003\u8651\u4e00\u4e0b: \u201c\u54e5\u7684\u7528\u6237\u6700\u60f3\u770b\u5230\u7684\u662f\u4ec0\u4e48\uff1f\u201d\uff0c\u6839\u636e\u8fd9\u4e2a\u6765\u8bbe\u8ba1\u60a8\u7684\u4e3b\u9875\u3002\n<\/p>\n<table style=\"border-spacing: 0px; margin: 0px -8px; width: 95%; border-width: thin;\" border=\"0px\">\n\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><b>\u9996\u5148\u663e\u793a\u5185\u5bb9<\/b>\n<\/p><p>\u8bb8\u591a\u5e94\u7528\u7684\u76ee\u7684\u662f\u5c55\u793a\u5185\u5bb9\u3002\u4e0d\u8981\u4f7f\u7528\u53ea\u6709\u5206\u7c7b\u5bfc\u822a\u7684\u754c\u9762\uff0c\u800c\u662f\u76f4\u63a5\u5c06\u5185\u5bb9\u5c55\u793a\u5728\u60a8\u7684\u4e3b\u9875\u4e0a\uff0c\u8ba9\u4eba\u4eec\u53ef\u4ee5\u7acb\u5373\u770b\u5230\u3002\u6839\u636e\u5185\u5bb9\u9009\u62e9\u5408\u9002\u7684\u5e03\u5c40\uff0c\u8fd8\u8981\u8003\u8651\u5c4f\u5e55\u5c3a\u5bf8\u3002\n<\/p>\n<\/td>\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_market.png\" alt=\"app_structure_market.png\" \/>\n<\/p><p>\u7535\u5b50\u5e02\u573a\u7684\u4e3b\u9875\u4e0a\u5305\u62ec\u5e94\u7528\u3001\u97f3\u4e50\u3001\u56fe\u4e66\u3001\u7535\u5f71\u548c\u6e38\u620f\u3002\u540c\u65f6\u5728\u754c\u9762\u4e0a\u5c55\u793a\u4e86\u4e30\u5bcc\u591a\u5f69\u7684\u63a8\u8350\u548c\u4fc3\u9500\u5185\u5bb9\u3002\u641c\u7d22\u6309\u94ae\u5728\u64cd\u4f5c\u680f\u7684\u663e\u8457\u4f4d\u7f6e\u3002\n<\/p>\n<\/td><\/tr>\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><b>\u8bbe\u8ba1\u64cd\u4f5c\u680f\uff0c\u7528\u4e8e\u5bfc\u822a\u548c\u64cd\u4f5c<\/b>\n<\/p><p>\u4f60\u5e94\u7528\u7684\u6bcf\u4e00\u4e2a\u5c4f\u5e55\u90fd\u8981\u663e\u793a\u64cd\u4f5c\u680f\uff0c\u8fd9\u6837\u80fd\u4fdd\u6301\u7edf\u4e00\u7684\u6d4f\u89c8\u4f53\u9a8c\u5e76\u4e14\u53ef\u4ee5\u663e\u793a\u91cd\u8981\u7684\u64cd\u4f5c\u3002\n<\/p><p>\u5bf9\u4e8e\u9876\u5c42\u6765\u8bf4\uff0c\u64cd\u4f5c\u680f\u7684\u8bbe\u8ba1\u9700\u8981\u8003\u8651\u4ee5\u4e0b\u7279\u6b8a\u7684\u8981\u6c42:\n<\/p>\n<ul><li> \u663e\u793a\u60a8\u5e94\u7528\u7684\u56fe\u6807\u6216\u8005\u6807\u9898\u3002\n<\/li><li> \u5982\u679c\u9876\u5c42\u7531\u591a\u4e2a\u89c6\u56fe\u7ec4\u6210\uff0c\u6216\u8005\u7528\u6237\u7ecf\u5e38\u5728\u4e0d\u540c\u7684\u8d26\u6237\u95f4\u5207\u6362\uff0c\u90a3\u4e48\u5e94\u5f53\u52a0\u5165\u201c\u89c6\u56fe\u5207\u6362\u83dc\u5355\u201d\uff0c\u65b9\u4fbf\u7528\u6237\u5bfc\u822a\u3002\n<\/li><li> \u5982\u679c\u60a8\u5e94\u7528\u7684\u76ee\u7684\u662f\u7f16\u5199\u5185\u5bb9\uff0c\u90a3\u4e48\u8003\u8651\u4ece\u9876\u5c42\u5c31\u53ef\u4ee5\u76f4\u63a5\u8bbf\u95ee\u8fd9\u4e9b\u5185\u5bb9\u3002\n<\/li><li> \u5c3d\u91cf\u5728\u64cd\u4f5c\u680f\u4e2d\u63d0\u4f9b\u641c\u7d22\u529f\u80fd\uff0c\u641c\u7d22\u53ef\u4ee5\u8282\u7701\u7528\u6237\u5927\u91cf\u65f6\u95f4\u3002\n<\/li><\/ul>\n<\/td>\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_gmail.png\" alt=\"app_structure_gmail.png\" \/>\n<\/p><p>Email \u5e94\u7528\u5173\u4e4e\u5904\u7406\u90ae\u4ef6\u7684\u6548\u7387\uff0c\u6240\u4ee5\u4e00\u4e2a\u7ed3\u6784\u660e\u6670\u7684\u9ad8\u5bc6\u5ea6\u5217\u8868\u6bd4\u8f83\u597d\u3002\u5bfc\u822a\u680f\u4e0a\u53ef\u4ee5\u5207\u6362\u4e0d\u540c\u8d26\u6237\u4ee5\u53ca\u6700\u8fd1\u7684\u76ee\u5f55\u3002\u526f\u64cd\u4f5c\u680f\u5305\u542b\u4e86\u7f16\u5199\u65b0\u90ae\u4ef6\u548c\u641c\u7d22\u6309\u94ae\u3002\n<\/p>\n<\/td><\/tr>\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><b>\u4e3a\u60a8\u7684\u5e94\u7528\u8bbe\u8ba1\u4e00\u4e2a\u6807\u5fd7\u6027\u7684\u754c\u9762<\/b>\n<\/p><p>\u9664\u4e86\u64cd\u4f5c\u680f\uff0c\u8bbe\u8ba1\u4e00\u4e2a\u6807\u5fd7\u6027\u7684\u754c\u9762\u4e5f\u5f88\u91cd\u8981\u3002\u60a8\u7684\u5e94\u7528\u901a\u8fc7\u7cbe\u7f8e\u7684\u89c6\u56fe\u548c\u72ec\u6709\u7684\u64cd\u4f5c\u65b9\u5f0f\u6765\u5c55\u793a\u5176\u72ec\u7279\u6027\u3002\u7279\u522b\u662f\u591a\u5a92\u4f53\u5e94\u7528\uff0c\u5e94\u5f53\u8bbe\u8ba1\u4e00\u4e2a\u6f02\u4eae\u7684\u754c\u9762\uff0c\u800c\u4e0d\u662f\u4f7f\u7528\u5355\u8c03\u7684\u5217\u8868 (list view)\u3002\n<\/p>\n<\/td>\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_music_lndscp.png\" alt=\"app_structure_music_lndscp.png\" \/>\n<\/p><p>3D \u65cb\u8f6c\u5f0f\u7684\u5c01\u9762\u662f Google \u97f3\u4e50\u5e94\u7528\u7684\u72ec\u7279\u754c\u9762\u3002\u9ed8\u8ba4\u663e\u793a\u6700\u8fd1\u64ad\u653e\u7684\u97f3\u4e50\uff0c\u53ef\u4ee5\u5f88\u597d\u5730\u6ee1\u8db3\u7528\u6237\u7684\u89c6\u542c\u4e60\u60ef\u3002\n<\/p>\n<\/td><\/tr><\/table>\n<h3> <span class=\"mw-headline\" id=\".E5.88.86.E7.B1.BB.E7.9B.AE.E5.BD.95_-_Categories\">\u5206\u7c7b\u76ee\u5f55 - Categories<\/span><\/h3>\n<p>\u7531\u6570\u636e\u9a71\u52a8\u7684\u5e94\u7528\u90fd\u662f\u73b0\u5728\u6574\u7406\u597d\u7684\u5206\u7c7b\u76ee\u5f55\u4e2d\u6d4f\u89c8\uff0c\u4e4b\u540e\u518d\u8fdb\u5165\u8be6\u7ec6\u4fe1\u606f\u8fdb\u884c\u67e5\u770b\u548c\u7ba1\u7406\u3002\u53ef\u4ee5\u901a\u8fc7\u6241\u5e73\u5316\u60a8\u5e94\u7528\u7684\u6df1\u5ea6\uff0c\u964d\u4f4e\u5bfc\u822a\u7684\u96be\u5ea6\u3002\n<\/p><p>\u867d\u7136\u4ece\u9876\u5c42\u5230\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u7684\u5782\u76f4\u6b65\u9aa4\u662f\u6839\u636e\u60a8\u5e94\u7528\u7684\u5185\u5bb9\u800c\u5b9a\u7684\uff0c\u4f46\u662f\u4ecd\u7136\u6709\u51e0\u79cd\u65b9\u5f0f\u53ef\u4ee5\u7b80\u5316\u8ba4\u77e5\u7684\u96be\u5ea6\u3002\n<\/p><p><b>\u4f7f\u7528\u6807\u7b7e\u6574\u5408\u591a\u4e2a\u5206\u7c7b\u7c7b\u522b\u548c\u6570\u636e\u89c6\u56fe<\/b>\n<\/p><p>\u5982\u679c\u5206\u7c7b\u662f\u76f8\u4f3c\u7684\u6216\u8005\u7c7b\u522b\u6bd4\u8f83\u5c11\u7684\u65f6\u5019\uff0c\u8fd9\u6837\u505a\u6bd4\u8f83\u597d\u3002\u56e0\u4e3a\u4f7f\u7528\u6807\u7b7e\u53ef\u4ee5\u51cf\u5c11\u4e00\u5c42\u7684\u5bfc\u822a\uff0c\u5e76\u4e14\u4f7f\u6570\u636e\u4e00\u76f4\u4fdd\u6301\u5728\u7528\u6237\u5173\u6ce8\u7684\u4e2d\u5fc3\u3002\u5728\u4e30\u5bcc\u7684\u5185\u5bb9\u4e2d\u5bfc\u822a\u66f4\u50cf\u662f\u4e00\u79cd\u968f\u610f\u7684\u6d4f\u89c8\u800c\u4e0d\u662f\u6709\u660e\u786e\u76ee\u7684\u5bfc\u822a\u3002\n<\/p>\n<table style=\"border-spacing: 0px; margin: 0px -8px; width: 80%; border-width: thin;\" border=\"0px\">\n\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p>\u5982\u679c\u5206\u7c7b\u4e4b\u95f4\u662f\u76f8\u4f3c\u7684\u3001\u53ef\u9884\u89c1\u7684\u6216\u8005\u5173\u7cfb\u63a5\u8fd1\u7684\uff0c\u53ef\u4ee5\u4f7f\u7528\u6eda\u52a8\u6807\u7b7e (scrolling tabs\uff0c\u4e0d\u662f\u6240\u6709\u7684\u9879\u76ee\u90fd\u76f4\u63a5\u663e\u793a\u51fa\u6765)\u3002\u4fdd\u8bc1\u6eda\u52a8\u6807\u7b7e\u4e2d\u9879\u76ee\u7684\u6570\u91cf\u4e0d\u8981\u592a\u591a\uff0c\u5426\u5219\u96be\u4ee5\u64cd\u4f5c\u3002\u5e38\u89c1\u7684\u89c4\u5219\u662f 5 \u5230 7 \u4e2a\u6807\u7b7e\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_scrolltabs.png\" alt=\"app_structure_scrolltabs.png\" \/>\n<\/p><p><i>\u7535\u5b50\u5e02\u573a\u4f7f\u7528\u6807\u7b7e\u540c\u65f6\u5c55\u793a\u5206\u7c7b\u548c\u5185\u5bb9\u3002\u9700\u8981\u5728\u5206\u7c7b\u4e2d\u5bfc\u822a\u65f6\uff0c\u7528\u6237\u53ef\u4ee5\u5728\u5185\u5bb9\u533a\u57df\u5de6\u53f3\u6ed1\u52a8\u3002<\/i>\n<\/p>\n<\/td>\n<td style=\"width:40%; vertical-align:top;padding: 20px;\">\n<p>\u5982\u679c\u5206\u7c7b\u7684\u7c7b\u522b\u4e4b\u95f4\u4e0d\u662f\u5f88\u63a5\u8fd1\uff0c\u5e94\u5f53\u4f7f\u7528\u56fa\u5b9a\u6807\u7b7e (fixed tabs)\uff0c\u8fd9\u6837\u5c31\u53ef\u4ee5\u540c\u65f6\u770b\u5230\u6240\u6709\u7684\u5206\u7c7b\u3002\n<img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_fixedtabs.png\" alt=\"app_structure_fixedtabs.png\" \/>\n<\/p><p><i>YouTube \u5e94\u7528\u4f7f\u7528\u56fa\u5b9a\u6807\u7b7e (fixed tabs) \u5728\u4e0d\u540c\u7684\u529f\u80fd\u533a\u57df\u95f4\u5207\u6362\u3002<\/i>\n<\/p>\n<\/td><\/tr><\/table>\n<p><b>\u5141\u8bb8\u7a7f\u8fc7\u591a\u4e2a\u5c42\u7ea7\u7684\u64cd\u4f5c<\/b>\n<\/p><p>\u7528\u5feb\u6377\u7684\u65b9\u5f0f\u4f7f\u7528\u6237\u53ef\u4ee5\u8f7b\u677e\u5730\u5b8c\u6210\u4ed6\u4eec\u6240\u8981\u6267\u884c\u7684\u64cd\u4f5c\u3002\u4e3a\u4e86\u80fd\u591f\u63a7\u5236\u9876\u5c42\u5217\u8868\u4e2d\u7684\u6570\u636e\u9879\uff0c\u5728\u6570\u636e\u9879\u8fb9\u4e0a\u663e\u793a\u4e00\u4e2a\u660e\u663e\u7684\u6307\u793a\uff0c\u70b9\u51fb\u540e\u663e\u793a\u4e0b\u62c9\u83dc\u5355\u3002\u8fd9\u6837\u4f7f\u5f97\u4eba\u4eec\u4e0d\u9700\u8981\u8fdb\u5165\u591a\u4e2a\u5c42\u7ea7\u5c31\u53ef\u4ee5\u76f4\u63a5\u6267\u884c\u64cd\u4f5c\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_shortcut_on_item.png\" alt=\"app_structure_shortcut_on_item.png\" \/>\n<\/p><p><i>\u97f3\u4e50\u5e94\u7528\u5141\u8bb8\u7528\u6237\u5728\u5206\u7c7b\u89c6\u56fe (\u4e13\u8f91) \u4e2d\u76f4\u63a5\u64cd\u4f5c\u6570\u636e\u9879 (\u6b4c\u66f2)\uff0c\u8fd9\u6837\u5c31\u4e0d\u9700\u8981\u8fdb\u5165\u6b4c\u66f2\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\uff0c\u7b80\u5316\u4e86\u64cd\u4f5c\u3002<\/i>\n<\/p><p><b>\u540c\u65f6\u5bf9\u591a\u4e2a\u9879\u76ee\u8fdb\u884c\u64cd\u4f5c<\/b>\n<\/p><p>\u5c3d\u7ba1\u5206\u7c7b\u89c6\u56fe\u4e00\u822c\u662f\u7ed9\u4eba\u4eec\u5bfc\u822a\u5230\u8be6\u7ec6\u4fe1\u606f\u7528\u7684\uff0c\u4f46\u662f\u8bb0\u4f4f\uff0c\u63d0\u4f9b\u4e00\u4e9b\u64cd\u4f5c\u53ef\u4ee5\u76f4\u63a5\u63a7\u5236\u591a\u6761\u6570\u636e\u4e5f\u662f\u6709\u5fc5\u8981\u7684\u3002\n<\/p><p>\u4f8b\u5982\uff0c\u5982\u679c\u60a8\u5141\u8bb8\u7528\u6237\u5728\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u5220\u9664\u67d0\u4e2a\u9879\u76ee\uff0c\u90a3\u4e48\u60a8\u5e94\u5f53\u5141\u8bb8\u7528\u6237\u5728\u5206\u7c7b\u89c6\u56fe\u4e2d\u4e00\u6b21\u6027\u5220\u9664\u591a\u4e2a\u9879\u76ee\u3002\u4ed4\u7ec6\u8003\u8651\u90a3\u4e9b\u64cd\u4f5c\u53ef\u4ee5\u4f5c\u7528\u4e8e\u591a\u4e2a\u9879\u76ee\uff0c\u901a\u8fc7\u591a\u9009\u754c\u9762\u63d0\u4f9b\u8fd9\u4e9b\u64cd\u4f5c\uff0c\u8ba9\u7528\u6237\u53ef\u4ee5\u5728\u5206\u7c7b\u89c6\u56fe\u4e2d\u76f4\u63a5\u4f7f\u7528\u3002\n<\/p><p><br \/>\n<\/p>\n<h3> <span class=\"mw-headline\" id=\".E8.AF.A6.E7.BB.86.E4.BF.A1.E6.81.AF_-_Details\">\u8be6\u7ec6\u4fe1\u606f - Details <\/span><\/h3>\n<p>\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u8ba9\u60a8\u663e\u793a\u548c\u5904\u7406\u6570\u636e\u3002\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u7684\u5e03\u5c40\u6839\u636e\u9700\u8981\u663e\u793a\u7684\u6570\u636e\u4e0d\u540c\u800c\u4e0d\u540c\u3002\n<\/p>\n<table style=\"border-spacing: 0px; margin: 0px -8px; width: 80%; border-width: thin;\" border=\"0px\">\n\n<tr style=\"border:1px solid #cedff2; background:#f5faff;\">\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><b>\u5e03\u5c40<\/b>\n<\/p><p>\u8003\u8651\u4e00\u4e0b\u4eba\u4eec\u5728\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u4e2d\u7684\u64cd\u4f5c\uff0c\u5e76\u6839\u636e\u8fd9\u4e2a\u5b89\u6392\u5e03\u5c40\u3002\u5bf9\u4e8e\u6c89\u6d78\u5f0f\u5185\u5bb9\uff0c\u4f7f\u7528\u5173\u706f\u6a21\u5f0f (lights-out mode) \u4f7f\u5f97\u7528\u6237\u53ef\u4ee5\u4e0d\u53d7\u6253\u6270\u7684\u5168\u5c4f\u67e5\u770b\u5185\u5bb9\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_people_detail.png\" alt=\"app_structure_people_detail.png\" \/>\n<\/p>\n<\/td>\n<td style=\"width:60%; vertical-align:top;padding: 20px;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_book_detail_page_flip.png\" alt=\"app_structure_book_detail_page_flip.png\" \/>\n<\/p><p><i>Google \u56fe\u4e66\u5e94\u7528\u7684\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u60f3\u8981\u590d\u5236\u9605\u8bfb\u4e00\u672c\u771f\u662f\u56fe\u4e66\u7684\u4f53\u9a8c\u3002\u7ffb\u9875\u52a8\u753b\u52a0\u5f3a\u4e86\u8fd9\u4e00\u6548\u679c\u3002\u4e3a\u4e86\u8fbe\u5230\u6c89\u6d78\u5f0f\u7684\u6548\u679c\uff0c\u5e94\u7528\u8fdb\u5165\u4e86\u5173\u706f\u6a21\u5f0f (lights-out mode) \u9690\u85cf\u4e86\u6240\u6709\u7684\u7cfb\u7edf\u754c\u9762\u5143\u7d20\u3002<\/i>\n<\/p><p>\u8054\u7cfb\u4eba\u5e94\u7528\u7684\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u9700\u8981\u5c55\u793a\u8054\u7cfb\u4fe1\u606f\u3002\u5217\u8868\u63a7\u4ef6 (list view) \u662f\u5feb\u901f\u67e5\u770b\u7535\u8bdd\u53f7\u7801\u3001email \u5730\u5740\u548c\u5176\u5b83\u8054\u7cfb\u4fe1\u606f\u7684\u6700\u4f73\u9009\u62e9\u3002\u5206\u5272\u9879 (split items) \u5c06\u62e8\u53f7\u548c\u53d1\u9001\u4fe1\u606f\u6392\u5217\u5728\u4e86\u540c\u4e00\u884c\u3002\n<\/p>\n<\/td><\/tr><\/table>\n<p><b>\u662f\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u4e4b\u95f4\u5bfc\u822a\u7684\u53d8\u5f97\u7b80\u5355<\/b>\n<\/p><p>\u5982\u679c\u7528\u6237\u7ecf\u5e38\u987a\u5e8f\u6d4f\u89c8\u591a\u4e2a\u9879\u76ee\uff0c\u90a3\u4e48\u5e94\u5f53\u8ba9\u4ed6\u4eec\u5728\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u4e2d\u76f4\u63a5\u505a\u5230\u3002\u8003\u8651\u4f7f\u7528\u6ed1\u52a8\u89c6\u56fe (swipe view) \u6216\u8005\u5176\u5b83\u66ff\u4ee3\u65b9\u6cd5\u5b9e\u73b0\u8fd9\u79cd\u64cd\u4f5c\u3002\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_gmail_swipe.png\" alt=\"app_structure_gmail_swipe.png\" \/>\n<\/p><p><i>Gmail \u5e94\u7528\u4f7f\u7528\u6ed1\u52a8\u89c6\u56fe (swipe view) \u5728\u4e0d\u540c\u7684\u8be6\u7ec6\u4fe1\u606f\u4e4b\u95f4\u5bfc\u822a\u3002<\/i>\n<\/p><p><img src=\"http:\/\/docs.eoeandroid.com\/design\/media\/app_structure_gallery_filmstrip.png\" alt=\"app_structure_gallery_filmstrip.png\" \/>\n<\/p><p><i>\u76f8\u518c\u5e94\u7528\u9664\u4e86\u901a\u8fc7\u6ed1\u52a8\u5728\u56fe\u7247\u4e4b\u95f4\u5bfc\u822a\uff0c\u8fd8\u63d0\u4f9b\u4e86\u7f29\u7565\u56fe\u63a7\u4ef6 (filmstrip control) \u4f7f\u5f97\u7528\u6237\u53ef\u4ee5\u5feb\u901f\u6253\u5f00\u6307\u5b9a\u7684\u56fe\u7247\u3002<\/i>\n<\/p><p><br \/>\n<\/p>\n<h3> <span class=\"mw-headline\" id=\".E6.B8.85.E5.8D.95_-_Checklist\">\u6e05\u5355 - Checklist<\/span><\/h3>\n<ul><li> \u5728\u4e3b\u9875\u4e0a\u663e\u793a\u6709\u7528\u7684\u4fe1\u606f\u3002\n<\/li><li> \u4f7f\u7528\u64cd\u4f5c\u680f\u63d0\u4f9b\u7edf\u4e00\u7684\u5bfc\u822a\u4f53\u9a8c\u3002\n<\/li><li> \u901a\u8fc7\u6c34\u5e73\u5bfc\u822a\u548c\u5feb\u6377\u65b9\u5f0f\u538b\u7f29\u5bfc\u822a\u5c42\u6b21\u3002\n<\/li><li> \u901a\u8fc7\u591a\u9009\u4f7f\u7528\u6237\u53ef\u4ee5\u64cd\u4f5c\u591a\u6761\u6570\u636e\u3002\n<\/li><li> \u4f7f\u7528\u6ed1\u52a8\u89c6\u56fe (swipe views) \u5728\u4e0d\u540c\u7684\u8be6\u7ec6\u4fe1\u606f\u89c6\u56fe\u4e2d\u5bfc\u822a\u3002\n<\/li><\/ul>\n<p>\u539f\u6587\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/design\/patterns\/app-structure.html\">http:\/\/docs.eoeandroid.com\/design\/patterns\/app-structure.html<\/a>\n<\/p>\n<pre><a href=\"http:\/\/wiki.eoeandroid.com\/%E6%89%8B%E5%8A%BF_-_Gestures\" title=\"\u624b\u52bf - Gestures\">\u624b\u52bf - Gestures<\/a>    &lt;&lt;\u4e0a\u4e00\u7bc7 | \u4e0b\u4e00\u7bc7&gt;&gt;   <a href=\"http:\/\/wiki.eoeandroid.com\/%E5%AF%BC%E8%88%AA_-_Navigation\" title=\"\u5bfc\u822a - Navigation\">\u5bfc\u822a - Navigation<\/a>\n<\/pre>"}