{"title":"Designing for Seamlessness","text":"<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Designing_for_Seamlessness-.E6.97.A0.E7.BC.9D.E8.AE.BE.E8.AE.A1\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">Designing for Seamlessness-\u65e0\u7f1d\u8bbe\u8ba1<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Don.27t_Drop_Data-.E5.88.AB.E4.B8.A2.E5.BC.83.E6.95.B0.E6.8D.AE\"><span class=\"tocnumber\">1.1<\/span> <span class=\"toctext\">Don't Drop Data-\u522b\u4e22\u5f03\u6570\u636e<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Don.27t_Expose_Raw_Data-.E4.B8.8D.E8.A6.81.E6.9A.B4.E9.9C.B2.E5.8E.9F.E5.A7.8B.E6.95.B0.E6.8D.AE\"><span class=\"tocnumber\">1.2<\/span> <span class=\"toctext\">Don't Expose Raw Data-\u4e0d\u8981\u66b4\u9732\u539f\u59cb\u6570\u636e<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Don.27t_Interrupt_the_User-.E4.B8.8D.E8.A6.81.E6.89.93.E6.96.AD.E7.94.A8.E6.88.B7\"><span class=\"tocnumber\">1.3<\/span> <span class=\"toctext\">Don't Interrupt the User-\u4e0d\u8981\u6253\u65ad\u7528\u6237<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#Got_a_Lot_to_Do.3F_Do_it_in_a_Thread-.E6.9C.89.E5.A4.AA.E5.A4.9A.E4.BA.8B.E6.83.85.E8.A6.81.E5.81.9A.EF.BC.9F.E5.9C.A8.E7.BA.BF.E7.A8.8B.E9.87.8C.E5.81.9A\"><span class=\"tocnumber\">1.4<\/span> <span class=\"toctext\">Got a Lot to Do? Do it in a Thread-\u6709\u592a\u591a\u4e8b\u60c5\u8981\u505a\uff1f\u5728\u7ebf\u7a0b\u91cc\u505a<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-6\"><a href=\"#Don.27t_Overload_a_Single_Activity_Screen-.E4.B8.8D.E8.A6.81.E8.AE.A9.E4.B8.80.E4.B8.AAActivity.E8.B6.85.E8.B4.9F.E8.8D.B7\"><span class=\"tocnumber\">1.5<\/span> <span class=\"toctext\">Don't Overload a Single Activity Screen-\u4e0d\u8981\u8ba9\u4e00\u4e2aActivity\u8d85\u8d1f\u8377<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#Extend_System_Themes-.E6.89.A9.E5.B1.95.E7.B3.BB.E7.BB.9F.E4.B8.BB.E9.A2.98\"><span class=\"tocnumber\">1.6<\/span> <span class=\"toctext\">Extend System Themes-\u6269\u5c55\u7cfb\u7edf\u4e3b\u9898<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-8\"><a href=\"#Design_Your_UI_to_Work_with_Multiple_Screen_Resolutions-.E8.AE.BE.E8.AE.A1.E4.BD.A0.E7.9A.84UI.E5.8F.AF.E4.BB.A5.E5.BA.94.E5.AF.B9.E5.A4.9A.E5.B1.8F.E5.B9.95.E5.88.86.E8.BE.A8.E7.8E.87\"><span class=\"tocnumber\">1.7<\/span> <span class=\"toctext\">Design Your UI to Work with Multiple Screen Resolutions-\u8bbe\u8ba1\u4f60\u7684UI\u53ef\u4ee5\u5e94\u5bf9\u591a\u5c4f\u5e55\u5206\u8fa8\u7387<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-9\"><a href=\"#Assume_the_Network_is_Slow-.E5.81.87.E8.AE.BE.E7.BD.91.E7.BB.9C.E5.BE.88.E6.85.A2\"><span class=\"tocnumber\">1.8<\/span> <span class=\"toctext\">Assume the Network is Slow-\u5047\u8bbe\u7f51\u7edc\u5f88\u6162<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-10\"><a href=\"#Don.27t_Assume_Touchscreen_or_Keyboard-.E4.B8.8D.E8.A6.81.E5.81.87.E5.AE.9A.E8.A7.A6.E6.91.B8.E5.B1.8F.E6.88.96.E9.94.AE.E7.9B.98\"><span class=\"tocnumber\">1.9<\/span> <span class=\"toctext\">Don't Assume Touchscreen or Keyboard-\u4e0d\u8981\u5047\u5b9a\u89e6\u6478\u5c4f\u6216\u952e\u76d8<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-11\"><a href=\"#Do_Conserve_the_Device_Battery-.E8.8A.82.E7.9C.81.E8.AE.BE.E5.A4.87.E7.94.B5.E6.B1.A0\"><span class=\"tocnumber\">1.10<\/span> <span class=\"toctext\">Do Conserve the Device Battery-\u8282\u7701\u8bbe\u5907\u7535\u6c60<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h1> <span class=\"mw-headline\" id=\"Designing_for_Seamlessness-.E6.97.A0.E7.BC.9D.E8.AE.BE.E8.AE.A1\">Designing for Seamlessness-\u65e0\u7f1d\u8bbe\u8ba1<\/span><\/h1>\n<p><br \/>\nEven if your application is fast and responsive, certain design decisions can still cause problems for users \u2014 because of unplanned interactions with other applications or dialogs, inadvertent loss of data, unintended blocking, and so on. To avoid these problems, it helps to understand the context in which your applications run and the system interactions that can affect your application. In short, you should strive to develop an application that interacts seamlessly with the system and with other applications. <br \/>\n\u5373\u4f7f\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u662f\u5feb\u901f\u4e14\u54cd\u5e94\u7075\u654f\u7684\uff0c\u4f46\u4e00\u4e9b\u8bbe\u8ba1\u4ecd\u7136\u4f1a\u7ed9\u7528\u6237\u9020\u6210\u95ee\u9898\u2014\u2014\u4e0e\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u6216\u5bf9\u8bdd\u6846\u672a\u4e8b\u5148\u8ba1\u5212\u7684\u4ea4\u4e92\uff0c\u610f\u5916\u7684\u6570\u636e\u4e22\u5931\uff0c\u610f\u6599\u4e4b\u5916\u7684\u963b\u585e\u7b49\u7b49\u3002\u907f\u514d\u8fd9\u4e9b\u95ee\u9898\uff0c\u6709\u52a9\u4e8e\u7406\u89e3\u5e94\u7528\u7a0b\u5e8f\u8fd0\u884c\u7684\u4e0a\u4e0b\u6587\u548c\u7cfb\u7edf\u7684\u4ea4\u4e92\u8fc7\u7a0b\uff0c\u800c\u8fd9\u4e9b\u53c8\u6b63\u5f71\u54cd\u7740\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u3002\u7b80\u800c\u8a00\u4e4b\uff0c\u4f60\u5e94\u8be5\u7aed\u5c3d\u5168\u529b\u53bb\u5f00\u53d1\u4e00\u4e2a\u4e0e\u7cfb\u7edf\u548c\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u6d41\u7545\u4ea4\u4e92\u7684\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n<br \/>\nA common seamlessness problem is when an application's background process \u2014 for example, a service or broadcast receiver \u2014 pops up a dialog in response to some event. This may seem like harmless behavior, especially when you are building and testing your application in isolation, on the emulator. However, when your application is run on an actual device, your application may not have user focus at the time your background process displays the dialog. So it could end up that your application would display it's dialog behind the active application, or it could take focus from the current application and display the dialog in front of whatever the user was doing (such as dialing a phone call, for example). That behavior would not work for your application or for the user. <br \/>\n\u4e00\u4e2a\u5e38\u89c1\u7684\u6d41\u7545\u95ee\u9898\u662f\uff0c\u4e00\u4e2a\u5e94\u7528\u7a0b\u5e8f\u7684\u540e\u53f0\u5904\u7406\u2014\u2014\u4f8b\u5982\uff0c\u4e00\u4e2aService\u6216\u8005BroadcastReceiver\u2014\u2014\u5f39\u51fa\u4e00\u4e2a\u5bf9\u8bdd\u6846\u6765\u54cd\u5e94\u4e00\u4e9b\u4e8b\u4ef6\u3002\u8fd9\u53ef\u80fd\u770b\u8d77\u6765\u6ca1\u5565\u5927\u788d\uff0c\u5c24\u5176\u662f\u4f60\u5728\u6a21\u62df\u5668\u4e0a\u5355\u72ec\u5730\u6784\u5efa\u548c\u6d4b\u8bd5\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u65f6\u5019\u3002\u7136\u800c\uff0c\u5f53\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u8fd0\u884c\u5728\u771f\u673a\u4e0a\u65f6\uff0c\u6709\u53ef\u80fd\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5728\u6ca1\u6709\u83b7\u5f97\u7528\u6237\u7126\u70b9\u65f6\u540e\u53f0\u5904\u7406\u663e\u793a\u4e86\u4e00\u4e2a\u5bf9\u8bdd\u6846\u3002\u56e0\u6b64\uff0c\u53ef\u80fd\u4f1a\u51fa\u73b0\u5728\u6d3b\u8dc3\u7684\u5e94\u7528\u7a0b\u5e8f\u540e\u65b9\u663e\u793a\u4e86\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u5bf9\u8bdd\u6846\uff0c\u6216\u8005\u4ece\u5f53\u524d\u5e94\u7528\u7a0b\u5e8f\u593a\u53d6\u7126\u70b9\u663e\u793a\u4e86\u4e00\u4e2a\u5bf9\u8bdd\u6846\uff0c\u800c\u4e0d\u7ba1\u5f53\u524d\u7528\u6237\u6b63\u5728\u505a\u4ec0\u4e48\uff08\u4f8b\u5982\uff0c\u6b63\u5728\u6253\u7535\u8bdd\uff09\u3002\u90a3\u79cd\u884c\u4e3a\uff0c\u5bf9\u5e94\u7528\u7a0b\u5e8f\u6216\u7528\u6237\u6765\u8bf4\uff0c\u5c31\u4e0d\u5e94\u8be5\u51fa\u73b0\u3002<br \/>\n<br \/>\nTo avoid these problems, your application should use the proper system facility for notifying the user \u2014 theNotification classes. Using <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/reference\/android\/app\/Notification.html\">notifications<\/a>, your application can signal the user that an event has taken place, by displaying an icon in the status bar rather than taking focus and interrupting the user.  <br \/>  \n\u4e3a\u4e86\u907f\u514d\u8fd9\u4e9b\u95ee\u9898\uff0c\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5e94\u8be5\u4f7f\u7528\u5408\u9002\u7684\u7cfb\u7edf\u8d44\u6e90\u6765\u901a\u77e5\u7528\u6237\u2014\u2014Notification\u7c7b\u3002\u4f7f\u7528Notification\uff0c\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u53ef\u4ee5\u5728\u72b6\u6001\u680f\u663e\u793a\u4e00\u4e2aicon\u6765\u901a\u77e5\u7528\u6237\u5df2\u7ecf\u53d1\u751f\u7684\u4e8b\u60c5\uff0c\u800c\u4e0d\u662f\u593a\u53d6\u7126\u70b9\u548c\u6253\u65ad\u7528\u6237\u3002<br \/>\n<br \/>\nAnother example of a seamlessness problem is when an activity inadvertently loses state or user data because it doesn't correctly implement the onPause() and other lifecycle methods. Or, if your application exposes data intended to be used by other applications, you should expose it via a ContentProvider, rather than (for example) doing so through a world-readable raw file or database. <br \/>\n\u53e6\u4e00\u4e2a\u6d41\u7545\u95ee\u9898\u7684\u4f8b\u5b50\u662f\u672a\u80fd\u6b63\u786e\u5b9e\u73b0Activity\u7684onPause()\u548c\u5176\u5b83\u751f\u547d\u5468\u671f\u65b9\u6cd5\u800c\u9020\u6210\u610f\u5916\u4e22\u5931\u4e86\u72b6\u6001\u6216\u7528\u6237\u6570\u636e\u3002\u53c8\u6216\u8005\uff0c\u5982\u679c\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u60f3\u66b4\u9732\u6570\u636e\u7ed9\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u4f7f\u7528\uff0c\u4f60\u5e94\u8be5\u901a\u8fc7ContentProvider\u6765\u66b4\u9732\uff0c\u800c\u4e0d\u662f\uff08\u4e3e\u4f8b\uff09\u901a\u8fc7\u4e00\u4e2a\u53ef\u8bfb\u7684\u539f\u59cb\u6587\u4ef6\u6216\u6570\u636e\u5e93\u6765\u5b9e\u73b0\u3002<br \/>\n<br \/>\nWhat those examples have in common is that they involve cooperating nicely with the system and other applications. The Android system is designed to treat applications as a sort of federation of loosely-coupled components, rather than chunks of black-box code. This allows you as the developer to view the entire system as just an even-larger federation of these components. This benefits you by allowing you to integrate cleanly and seamlessly with other applications, and so you should design your own code to return the favor.\n\u8fd9\u4e9b\u4f8b\u5b50\u7684\u5171\u540c\u70b9\u662f\u5b83\u4eec\u90fd\u5e94\u8be5\u4e0e\u7cfb\u7edf\u548c\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u534f\u4f5c\u597d\u3002Android\u7cfb\u7edf\u8bbe\u8ba1\u65f6\uff0c\u5c31\u628a\u5e94\u7528\u7a0b\u5e8f\u770b\u4f5c\u662f\u4e00\u5806\u677e\u6563\u8026\u5408\u7684\u7ec4\u4ef6\uff0c\u800c\u4e0d\u662f\u4e00\u5806\u9ed1\u76d2\u4ee3\u7801\u3002\u4f5c\u4e3a\u5f00\u53d1\u8005\u6765\u8bf4\uff0c\u5141\u8bb8\u6211\u4eec\u628a\u6574\u4e2a\u7cfb\u7edf\u770b\u4f5c\u662f\u66f4\u5927\u7684\u7ec4\u4ef6\u96c6\u5408\u3002\u8fd9\u6709\u76ca\u4e8e\u6211\u4eec\u53ef\u4ee5\u4e0e\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u8fdb\u884c\u6e05\u6670\u65e0\u7f1d\u7684\u96c6\u6210\uff0c\u56e0\u6b64\uff0c\u4f5c\u4e3a\u56de\u62a5\uff0c\u6211\u4eec\u5e94\u8be5\u66f4\u597d\u7684\u8bbe\u8ba1\u6211\u4eec\u7684\u4ee3\u7801\u3002<br \/>\n<br \/>\nThis document discusses common seamlessness problems and how to avoid them. <br \/>\n\u8fd9\u7bc7\u6587\u7ae0\u5c06\u8ba8\u8bba\u5e38\u89c1\u7684\u6d41\u7545\u95ee\u9898\u4ee5\u53ca\u5982\u4f55\u907f\u514d\u5b83\u4eec\u3002\u5b83\u5c06\u5305\u62ec\u8fd9\u4e9b\u4e3b\u9898\uff1a<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Don.27t_Drop_Data-.E5.88.AB.E4.B8.A2.E5.BC.83.E6.95.B0.E6.8D.AE\">Don't Drop Data-\u522b\u4e22\u5f03\u6570\u636e<\/span><\/h2>\n<p><br \/>\nAlways keep in mind that Android is a mobile platform. It may seem obvious to say it, but it's important to remember that another Activity (such as the \"Incoming Phone Call\" app) can pop up over your own Activity at any moment. This will fire the onSaveInstanceState() and onPause() methods, and will likely result in your application being killed. <br \/>\n\u4e00\u5b9a\u8981\u8bb0\u4f4fAndroid\u662f\u4e00\u4e2a\u79fb\u52a8\u5e73\u53f0\u3002\u53ef\u4ee5\u663e\u800c\u6613\u89c1\u5730\u8bf4\uff0c\u5176\u5b83Activity\uff08\u4f8b\u5982\uff0c\u201cIncoming Phone Call\u201d\u5e94\u7528\u7a0b\u5e8f\uff09\u53ef\u80fd\u4f1a\u5728\u4efb\u4f55\u65f6\u5019\u5f39\u51fa\u6765\u906e\u76d6\u4f60\u7684Activity\uff0c\u8bb0\u4f4f\u8fd9\u4e2a\u4e8b\u5b9e\u5f88\u91cd\u8981\u3002\u56e0\u4e3a\u8fd9\u4e2a\u8fc7\u7a0b\u5c06\u89e6\u53d1onSaveInstanceState()\u548conPause()\u65b9\u6cd5\uff0c\u5e76\u53ef\u80fd\u5bfc\u81f4\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u88ab\u6740\u6b7b\u3002<br \/>\n<br \/>\nIf the user was editing data in your application when the other Activity appeared, your application will likely lose that data when your application is killed. Unless, of course, you save the work in progress first. The \"Android Way\" is to do just that: Android applications that accept or edit input should override the onSaveInstanceState() method and save their state in some appropriate fashion. When the user revisits the application, she should be able to retrieve her data. <br \/>\n\u5982\u679c\u7528\u6237\u5728\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u4e2d\u6b63\u5728\u7f16\u8f91\u6570\u636e\u65f6\uff0c\u5176\u5b83Activity\u51fa\u73b0\u4e86\uff0c\u8fd9\u65f6\uff0c\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u88ab\u6740\u6b7b\u65f6\u53ef\u80fd\u4e22\u5931\u90a3\u4e9b\u6570\u636e\u3002\u5f53\u7136\u4e86\uff0c\u9664\u975e\u4f60\u4e8b\u5148\u4fdd\u5b58\u4e86\u6b63\u5728\u8fdb\u884c\u7684\u5de5\u4f5c\u3002\u201cAndroid\u65b9\u5f0f\u201d\u662f\u8fd9\u6837\u505a\u7684\uff1a\u80fd\u63a5\u6536\u548c\u7f16\u8f91\u7528\u6237\u8f93\u5165\u7684Android\u5e94\u7528\u7a0b\u5e8f\u5e94\u8be5\u91cd\u5199onSaveInstanceState()\u65b9\u6cd5\uff0c\u5e76\u4ee5\u6070\u5f53\u7684\u65b9\u5f0f\u4fdd\u5b58\u5b83\u4eec\u7684\u72b6\u6001\u3002\u5f53\u7528\u6237\u91cd\u65b0\u8bbf\u95ee\u5e94\u7528\u7a0b\u5e8f\u65f6\uff0c\u5979\u80fd\u5f97\u5230\u5979\u7684\u6570\u636e\u3002\u8fdb\u884c\u8fd9\u79cd\u5904\u7406\u65b9\u5f0f\u6700\u7ecf\u5178\u7684\u4f8b\u5b50\u662fmail\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n<br \/>\nA classic example of a good use of this behavior is a mail application. If the user was composing an email when another Activity started up, the application should save the in-process email as a draft. <br \/>\n\u5982\u679c\u7528\u6237\u6b63\u5728\u8f93\u5165email\uff0c\u8fd9\u65f6\u5176\u5b83Activity\u542f\u52a8\u4e86\uff0cmail\u5e94\u7528\u7a0b\u5e8f\u5e94\u8be5\u628a\u6b63\u5728\u7f16\u8f91\u7684email\u4ee5\u8349\u7a3f\u7684\u65b9\u5f0f\u4fdd\u5b58\u8d77\u6765\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Don.27t_Expose_Raw_Data-.E4.B8.8D.E8.A6.81.E6.9A.B4.E9.9C.B2.E5.8E.9F.E5.A7.8B.E6.95.B0.E6.8D.AE\">Don't Expose Raw Data-\u4e0d\u8981\u66b4\u9732\u539f\u59cb\u6570\u636e<\/span><\/h2>\n<p><br \/>\nIf you wouldn't walk down the street in your underwear, neither should your data. While it's possible to expose certain kinds of application to the world to read, this is usually not the best idea. Exposing raw data requires other applications to understand your data format; if you change that format, you'll break any other applications that aren't similarly updated.   <br \/> \n\u5982\u679c\u4f60\u4e0d\u60f3\u7a7f\u7740\u5185\u8863\u5728\u5927\u8857\u4e0a\u6e9c\u8fbe\u7684\u8bdd\uff0c\u4f60\u7684\u6570\u636e\u4e5f\u4e0d\u5e94\u8be5\u8fd9\u6837\u3002\u5c3d\u7ba1\u53ef\u80fd\u5b58\u5728\u66b4\u9732\u5e94\u7528\u7a0b\u5e8f\u7684\u67d0\u79cd\u5f62\u5f0f\u7ed9\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\uff0c\u4f46\u8fd9\u901a\u5e38\u4e0d\u662f\u6700\u597d\u7684\u4e3b\u610f\u3002\u66b4\u9732\u539f\u59cb\u6570\u636e\uff0c\u8981\u6c42\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u80fd\u591f\u7406\u89e3\u4f60\u7684\u6570\u636e\u7684\u683c\u5f0f\uff1b\u5982\u679c\u4f60\u53d8\u66f4\u4e86\u683c\u5f0f\uff0c\u90a3\u4e48\uff0c\u4f60\u5c06\u7834\u574f\u90a3\u4e9b\u6ca1\u6709\u8fdb\u884c\u540c\u6b65\u66f4\u65b0\u7684\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n<br \/>\nThe \"Android Way\" is to create a ContentProvider to expose your data to other applications via a clean, well-thought-out, and maintainable API. Using a ContentProvider is much like inserting a Java language interface to split up and componentize two tightly-coupled pieces of code. This means you'll be able to modify the internal format of your data without changing the interface exposed by the ContentProvider, and this without affecting other applications. <br \/>\n\u201cAndroid\u65b9\u5f0f\u201d\u662f\u521b\u5efa\u4e00\u4e2aContentProvider\uff0c\u4ee5\u4e00\u79cd\u6e05\u6670\u7684\u3001\u6df1\u601d\u719f\u8651\u7684\u548c\u53ef\u7ef4\u62a4\u7684API\u65b9\u5f0f\u66b4\u9732\u4f60\u7684\u6570\u636e\u7ed9\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u3002\u4f7f\u7528ContentProvider\uff0c\u5c31\u597d\u50cf\u662f\u63d2\u5165Java\u63a5\u53e3\u6765\u5206\u79bb\u548c\u7ec4\u88c5\u4e24\u7247\u9ad8\u8026\u5408\u7684\u4ee3\u7801\u3002\u8fd9\u610f\u5473\u7740\u4f60\u53ef\u4ee5\u4fee\u6539\u6570\u636e\u7684\u5185\u90e8\u683c\u5f0f\uff0c\u800c\u4e0d\u7528\u4fee\u6539\u7531ContentProvider\u66b4\u9732\u7684\u63a5\u53e3\uff0c\u8fd9\u6837\uff0c\u4e5f\u4e0d\u4f1a\u5f71\u54cd\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Don.27t_Interrupt_the_User-.E4.B8.8D.E8.A6.81.E6.89.93.E6.96.AD.E7.94.A8.E6.88.B7\">Don't Interrupt the User-\u4e0d\u8981\u6253\u65ad\u7528\u6237<\/span><\/h2>\n<p><br \/>\nIf the user is running an application (such as the Phone application during a call) it's a pretty safe bet he did it on purpose. That's why you should avoid spawning activities except in direct response to user input from the current Activity. <br \/>\n\u5982\u679c\u7528\u6237\u6b63\u5728\u8fd0\u884c\u4e00\u4e2a\u5e94\u7528\u7a0b\u5e8f\uff08\u4f8b\u5982\uff0cPhone\u7a0b\u5e8f\uff09\uff0c\u65ad\u5b9a\u5bf9\u7528\u6237\u64cd\u4f5c\u7684\u76ee\u7684\u624d\u662f\u5b89\u5168\u7684\u3002\u8fd9\u4e5f\u5c31\u662f\u4e3a\u4ec0\u4e48\u5fc5\u987b\u907f\u514d\u521b\u5efaActivity\uff0c\u800c\u662f\u76f4\u63a5\u5728\u5f53\u524d\u7684Activity\u4e2d\u54cd\u5e94\u7528\u6237\u7684\u8f93\u5165\u3002<br \/>\n<br \/>\nThat is, don't call startActivity() from BroadcastReceivers or Services running in the background. Doing so will interrupt whatever application is currently running, and result in an annoyed user. Perhaps even worse, your Activity may become a \"keystroke bandit\" and receive some of the input the user was in the middle of providing to the previous Activity. Depending on what your application does, this could be bad news. <br \/>\n\u90a3\u5c31\u662f\u8bf4\uff0c\u4e0d\u8981\u5728BroadcastReceiver\u6216\u5728\u540e\u53f0\u8fd0\u884c\u7684Service\u4e2d\u8c03\u7528callActivity()\u3002\u8fd9\u4e48\u505a\u4f1a\u4e2d\u65ad\u5f53\u524d\u8fd0\u884c\u7684\u5e94\u7528\u7a0b\u5e8f\uff0c\u5e76\u5bfc\u81f4\u7528\u6237\u607c\u6012\u3002\u4e5f\u8bb8\u66f4\u7cdf\u7cd5\u7684\u662f\uff0c\u4f60\u7684Activity\u53ef\u80fd\u6210\u4e3a\u201c\u6309\u952e\u5f3a\u76d7\u201d\uff0c\u7a83\u53d6\u4e86\u7528\u6237\u8981\u63d0\u4f9b\u7ed9\u524d\u4e00\u4e2aActivity\u7684\u8f93\u5165\u3002\u89c6\u4e4e\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u6240\u505a\u7684\u4e8b\u60c5\uff0c\u8fd9\u53ef\u80fd\u662f\u4e2a\u574f\u6d88\u606f\u3002<br \/>\n<br \/>\nInstead of spawning Activity UIs directly from the background, you should instead use the NotificationManager to set Notifications. These will appear in the status bar, and the user can then click on them at his leisure, to see what your application has to show him. <br \/> \n\u4e0d\u9009\u62e9\u5728\u540e\u53f0\u76f4\u63a5\u521b\u5efaActivity UI\uff0c\u53d6\u800c\u4ee3\u4e4b\u7684\u662f\uff0c\u5e94\u8be5\u4f7f\u7528NotificationManager\u6765\u8bbe\u7f6eNotification\u3002\u5b83\u4eec\u4f1a\u51fa\u73b0\u5728\u72b6\u6001\u680f\uff0c\u5e76\u4e14\u7528\u6237\u53ef\u4ee5\u5728\u4ed6\u7a7a\u95f2\u7684\u65f6\u5019\u70b9\u51fb\u5b83\u4eec\uff0c\u6765\u67e5\u770b\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5411\u4ed6\u663e\u793a\u4e86\u4ec0\u4e48\u3002<br \/>\n<br \/>\n(Note that all this doesn't apply to cases where your own Activity is already in the foreground: in that case, the user expects to see your next Activity in response to input.) <br \/>\n<br \/>\n\uff08\u6ce8\u610f\uff0c\u5982\u679c\u4f60\u7684Activity\u5df2\u7ecf\u5728\u524d\u53f0\u4e86\uff0c\u4ee5\u4e0a\u5c06\u4e0d\u9002\u7528\uff1a\u8fd9\u65f6\uff0c\u5bf9\u4e8e\u7528\u6237\u7684\u8f93\u5165\uff0c\u7528\u6237\u671f\u671b\u7684\u662f\u770b\u5230\u4e0b\u4e00\u4e2aActivity\u6765\u54cd\u5e94\u3002\uff09<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Got_a_Lot_to_Do.3F_Do_it_in_a_Thread-.E6.9C.89.E5.A4.AA.E5.A4.9A.E4.BA.8B.E6.83.85.E8.A6.81.E5.81.9A.EF.BC.9F.E5.9C.A8.E7.BA.BF.E7.A8.8B.E9.87.8C.E5.81.9A\">Got a Lot to Do? Do it in a Thread-\u6709\u592a\u591a\u4e8b\u60c5\u8981\u505a\uff1f\u5728\u7ebf\u7a0b\u91cc\u505a<\/span><\/h2>\n<p><br \/>\nIf your application needs to perform some expensive or long-running computation, you should probably move it to a thread. This will prevent the dreaded \"Application Not Responding\" dialog from being displayed to the user, with the ultimate result being the fiery demise of your application.<br \/>\n\u5982\u679c\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u9700\u8981\u6267\u884c\u4e00\u4e9b\u6602\u8d35\u6216\u8017\u65f6\u7684\u8ba1\u7b97\u7684\u8bdd\uff0c\u4f60\u5e94\u8be5\u5c3d\u53ef\u80fd\u5730\u5c06\u5b83\u632a\u5230\u7ebf\u7a0b\u91cc\u3002\u8fd9\u5c06\u963b\u6b62\u5411\u7528\u6237\u663e\u793a\u53ef\u6015\u7684\u201cApplication Not Responding\u201d\u5bf9\u8bdd\u6846\uff0c\u5982\u679c\u4e0d\u8fd9\u6837\u505a\uff0c\u6700\u7ec8\u7684\u7ed3\u679c\u4f1a\u5bfc\u81f4\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5b8c\u5168\u7ec8\u6b62\u3002<br \/>\n<br \/>\nBy default, all code in an Activity as well as all its Views run in the same thread. This is the same thread that also handles UI events. For example, when the user presses a key, a key-down event is added to the Activity's main thread's queue. The event handler system needs to dequeue and handle that event quickly; if it doesn't, the system concludes after a few seconds that the application is hung and offers to kill it for the user.   <br \/>\n\u4e00\u822c\u60c5\u51b5\u4e0b\uff0cActivity\u4e2d\u7684\u6240\u6709\u4ee3\u7801\uff0c\u5305\u62ec\u5b83\u7684View\uff0c\u90fd\u8fd0\u884c\u5728\u76f8\u540c\u7684\u7ebf\u7a0b\u91cc\u3002\u5728\u8fd9\u4e2a\u7ebf\u7a0b\u91cc\uff0c\u8fd8\u9700\u8981\u5904\u7406UI\u4e8b\u4ef6\u3002\u4f8b\u5982\uff0c\u5f53\u7528\u6237\u6309\u4e0b\u4e00\u4e2a\u6309\u952e\uff0c\u4e00\u4e2akey-down\u4e8b\u4ef6\u5c31\u4f1a\u6dfb\u52a0\u5230Activity\u7684\u4e3b\u7ebf\u7a0b\u961f\u5217\u91cc\u3002\u4e8b\u4ef6\u5904\u7406\u7cfb\u7edf\u9700\u8981\u5f88\u5feb\u8ba9\u8fd9\u4e2a\u4e8b\u4ef6\u51fa\u5217\u5e76\u5f97\u5230\u5904\u7406\uff1b\u5982\u679c\u6ca1\u6709\uff0c\u7cfb\u7edf\u6570\u79d2\u540e\u4f1a\u8ba4\u4e3a\u5e94\u7528\u7a0b\u5e8f\u5df2\u7ecf\u6302\u8d77\u5e76\u4e3a\u7528\u6237\u63d0\u4f9b\u6740\u6b7b\u5e94\u7528\u7a0b\u5e8f\u7684\u673a\u4f1a\u3002<br \/>\n<br \/>\nIf you have long-running code, running it inline in your Activity will run it on the event handler thread, effectively blocking the event handler. This will delay input processing, and result in the ANR dialogs. To avoid this, move your computations to a thread. This Design for Responsiveness document discusses how to do that. <br \/>\n\u5982\u679c\u6709\u8017\u65f6\u7684\u4ee3\u7801\uff0c\u5185\u8054\u5728Activity\u4e0a\u8fd0\u884c\u4e5f\u5c31\u662f\u8fd0\u884c\u5728\u4e8b\u4ef6\u5904\u7406\u7ebf\u7a0b\u91cc\uff0c\u8fd9\u5728\u5f88\u5927\u7a0b\u5ea6\u4e0a\u963b\u585e\u4e86\u4e8b\u4ef6\u5904\u7406\u3002\u8fd9\u4f1a\u5ef6\u8fdf\u8f93\u5165\u5904\u7406\uff0c\u5e76\u5bfc\u81f4ANR\u5bf9\u8bdd\u6846\u3002\u4e3a\u4e86\u907f\u514d\u8fd9\u4e2a\uff0c\u628a\u4f60\u7684\u8ba1\u7b97\u79fb\u5230\u7ebf\u7a0b\u91cc\u3002\u5728\u54cd\u5e94\u7075\u654f\u6027\u8bbe\u8ba1\u7684\u6587\u7ae0\u91cc\u5df2\u7ecf\u8ba8\u8bba\u4e86\u5982\u4f55\u505a\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Don.27t_Overload_a_Single_Activity_Screen-.E4.B8.8D.E8.A6.81.E8.AE.A9.E4.B8.80.E4.B8.AAActivity.E8.B6.85.E8.B4.9F.E8.8D.B7\">Don't Overload a Single Activity Screen-\u4e0d\u8981\u8ba9\u4e00\u4e2aActivity\u8d85\u8d1f\u8377<\/span><\/h2>\n<p><br \/>\nAny application worth using will probably have several different screens. When designing the screens of your UI, be sure to make use of multiple Activity object instances. <br \/>\n\u4efb\u4f55\u503c\u5f97\u4f7f\u7528\u7684\u5e94\u7528\u7a0b\u5e8f\u90fd\u53ef\u80fd\u6709\u51e0\u4e2a\u4e0d\u540c\u7684\u5c4f\u5e55\u3002\u5f53\u8bbe\u8ba1UI\u5c4f\u5e55\u65f6\uff0c\u8bf7\u4e00\u5b9a\u8981\u4f7f\u7528\u591a\u4e2aActivity\u5bf9\u8c61\u5b9e\u4f8b\u3002<br \/>\n<br \/>\nDepending on your development background, you may interpret an Activity as similar to something like a Java Applet, in that it is the entry point for your application. However, that's not quite accurate: where an Applet subclass is the single entry point for a Java Applet, an Activity should be thought of as one of potentially several entry points to your application. The only difference between your \"main\" Activity and any others you might have is that the \"main\" one just happens to be the only one that expressed an interest in the \"android.intent.action.MAIN\" action in your AndroidManifest..xml file. <br \/>\n\u4f9d\u8d56\u4e8e\u4f60\u7684\u5f00\u53d1\u80cc\u666f\uff0c\u4f60\u53ef\u80fd\u7406\u89e3Activity\u7c7b\u4f3c\u4e8eJava Applet\uff0c\u5b83\u662f\u4f60\u5e94\u7528\u7a0b\u5e8f\u7684\u5165\u53e3\u70b9\u3002\u7136\u800c\uff0c\u90a3\u5e76\u4e0d\u7cbe\u786e\uff1aApplet\u5b50\u7c7b\u662f\u4e00\u4e2aJava Applet\u7684\u5355\u4e00\u5165\u53e3\u70b9\uff0c\u800c\u4e00\u4e2aActivity\u5e94\u8be5\u770b\u4f5c\u662f\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u591a\u4e2a\u6f5c\u5728\u5165\u53e3\u70b9\u4e4b\u4e00\u3002\u4f60\u7684\u201cmain\u201dActivity\u548c\u5176\u5b83\u4e4b\u95f4\u7684\u552f\u4e00\u4e0d\u540c\u70b9\u662f\u201cmain\u201dActivity\u6b63\u5de7\u662f\u5728AndroidManifest.xml\u6587\u4ef6\u4e2d\u552f\u4e00\u5bf9\u201candroid.intent.action.MAIN\u201d\u52a8\u4f5c\u611f\u5174\u8da3\u7684Activity\u3002<br \/>\n<br \/>\nSo, when designing your application, think of your application as a federation of Activity objects. This will make your code a lot more maintainable in the long run, and as a nice side effect also plays nicely with Android's application history and \"backstack\" model. <br \/>\n\u56e0\u6b64\uff0c\u5f53\u8bbe\u8ba1\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u65f6\u5019\uff0c\u628a\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u770b\u4f5c\u662fActivity\u5bf9\u8c61\u7684\u96c6\u5408\u3002\u4ece\u957f\u8fdc\u6765\u770b\uff0c\u8fd9\u4f1a\u4f7f\u5f97\u4f60\u7684\u4ee3\u7801\u66f4\u52a0\u65b9\u4fbf\u7ef4\u62a4\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Extend_System_Themes-.E6.89.A9.E5.B1.95.E7.B3.BB.E7.BB.9F.E4.B8.BB.E9.A2.98\">Extend System Themes-\u6269\u5c55\u7cfb\u7edf\u4e3b\u9898<\/span><\/h2>\n<p><br \/>\nWhen it comes to the look-and-feel of the user interface, it's important to blend in nicely. Users are jarred by applications which contrast with the user interface they've come to expect. When designing your UIs, you should try and avoid rolling your own as much as possible. Instead, use a Theme. You can override or extend those parts of the theme that you need to, but at least you're starting from the same UI base as all the other applications. For all the details, read <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/ui\/themes.html\">Styles and Themes<\/a>. <br \/>\n\u5f53\u8c08\u5230UI\u89c2\u611f\u65f6\uff0c\u5de7\u5999\u5730\u4ea4\u878d\u975e\u5e38\u91cd\u8981\u3002\u7528\u6237\u5728\u4f7f\u7528\u4e0e\u81ea\u5df1\u671f\u671b\u76f8\u53cd\u7684UI\u7684\u5e94\u7528\u7a0b\u5e8f\u65f6\uff0c\u4f1a\u4ea7\u751f\u4e0d\u6109\u5feb\u7684\u611f\u89c9\u3002\u5f53\u8bbe\u8ba1\u4f60\u7684UI\u65f6\uff0c\u4f60\u5e94\u8be5\u5c3d\u91cf\u907f\u514d\u592a\u591a\u81ea\u5df1\u7684\u4e3b\u9898\u3002\u76f8\u53cd\u7684\uff0c\u4f7f\u7528\u540c\u4e00\u4e2a\u4e3b\u9898\u3002\u4f60\u53ef\u4ee5\u91cd\u5199\u6216\u6269\u5c55\u4f60\u9700\u8981\u7684\u4e3b\u9898\u90e8\u5206\uff0c\u4f46\u81f3\u5c11\u5728\u4e0e\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u76f8\u540c\u7684UI\u57fa\u7840\u4e0a\u5f00\u59cb\u3002\u8be6\u7ec6\u8bf7\u53c2\u7167\u201c\u5e94\u7528\u98ce\u683c\u548c\u4e3b\u9898\u201d\u90e8\u5206\u3002<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Design_Your_UI_to_Work_with_Multiple_Screen_Resolutions-.E8.AE.BE.E8.AE.A1.E4.BD.A0.E7.9A.84UI.E5.8F.AF.E4.BB.A5.E5.BA.94.E5.AF.B9.E5.A4.9A.E5.B1.8F.E5.B9.95.E5.88.86.E8.BE.A8.E7.8E.87\">Design Your UI to Work with Multiple Screen Resolutions-\u8bbe\u8ba1\u4f60\u7684UI\u53ef\u4ee5\u5e94\u5bf9\u591a\u5c4f\u5e55\u5206\u8fa8\u7387<\/span><\/h2>\n<p><br \/>\nDifferent Android-powered devices will support different screen resolutions. Some will even be able to change resolutions on the fly, such as by switching to landscape mode. It's important to make sure your layouts and drawables are flexible enough to display properly on a variety of device screens.  <br \/> \n\u4e0d\u540c\u7684Android\u8bbe\u5907\u53ef\u80fd\u652f\u6301\u4e0d\u540c\u7684\u5c4f\u5e55\u5206\u8fa8\u7387\u3002\u751a\u81f3\u4e00\u4e9b\u53ef\u4ee5\u81ea\u5df1\u53d8\u66f4\u5206\u8fa8\u7387\uff0c\u4f8b\u5982\uff0c\u5207\u6362\u5230\u98ce\u666f\u6a21\u5f0f\u3002\u786e\u4fdd\u4f60\u7684\u5e03\u5c40\u548c\u56fe\u7247\u80fd\u8db3\u591f\u7075\u6d3b\u5730\u5728\u4e0d\u540c\u7684\u8bbe\u5907\u5c4f\u5e55\u4e0a\u6b63\u5e38\u663e\u793a\u3002<br \/>\n<br \/>\nFortunately, this is very easy to do. In brief, what you must do is provide different versions of your artwork (if you use any) for the key resolutions, and then design your layout to accommodate various dimensions. (For example, avoid using hard-coded positions and instead use relative layouts.) If you do that much, the system handles the rest, and your application looks great on any device. <br \/>\n\u5e78\u8fd0\u7684\u662f\uff0c\u8fd9\u5f88\u5bb9\u6613\u505a\u5230\u3002\u7b80\u800c\u8a00\u4e4b\uff0c\u4f60\u9700\u8981\u505a\u7684\u662f\u4e3a\u4e3b\u8981\u5206\u8fa8\u7387\u63d0\u4f9b\u4e0d\u540c\u7248\u672c\u7684\u4f5c\u54c1\uff0c\u7136\u540e\u4e3a\u4e0d\u540c\u7684\u5c3a\u5bf8\u8bbe\u8ba1\u4f60\u7684\u5e03\u5c40\u3002\uff08\u4f8b\u5982\uff0c\u907f\u514d\u4f7f\u7528\u786c\u7f16\u7801\u4f4d\u7f6e\u800c\u4f7f\u7528\u76f8\u5bf9\u5e03\u5c40\u3002\uff09\u5982\u679c\u90a3\u6837\u505a\u7684\u8bdd\uff0c\u7cfb\u7edf\u4f1a\u5904\u7406\u5269\u4e0b\u7684\u90e8\u5206\uff0c\u800c\u4e14\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u5728\u4efb\u4f55\u8bbe\u5907\u4e0a\u90fd\u770b\u8d77\u6765\u5f88\u68d2\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Assume_the_Network_is_Slow-.E5.81.87.E8.AE.BE.E7.BD.91.E7.BB.9C.E5.BE.88.E6.85.A2\">Assume the Network is Slow-\u5047\u8bbe\u7f51\u7edc\u5f88\u6162<\/span><\/h2>\n<p><br \/>\nAndroid devices will come with a variety of network-connectivity options. All will have some data-access provision, though some will be faster than others. The lowest common denominator, however, is GPRS, the non-3G data service for GSM networks. Even 3G-capable devices will spend lots of time on non-3G networks, so slow networks will remain a reality for quite a long time to come.  <br \/>  \nAndroid\u8bbe\u5907\u4f1a\u6709\u591a\u79cd\u7f51\u7edc\u8fde\u63a5\u9009\u9879\u3002\u6240\u6709\u7684\u90fd\u63d0\u4f9b\u6570\u636e\u8bbf\u95ee\uff0c\u4f46\u4e4b\u95f4\u80af\u5b9a\u6709\u66f4\u5feb\u7684\u3002\u5176\u4e2d\uff0c\u901f\u5ea6\u6700\u6162\u7684\u662fGPRS\uff0cGSM\u7f51\u7edc\u7684\u975e3G\u6570\u636e\u670d\u52a1\u3002\u5373\u4f7f\u5177\u59073G\u80fd\u529b\u7684\u8bbe\u5907\u5728\u975e3G\u7684\u7f51\u7edc\u4e0a\u4e5f\u4f1a\u82b1\u8d39\u5f88\u591a\u7684\u65f6\u95f4\uff0c\u6240\u4ee5\uff0c\u7f51\u7edc\u5f88\u6162\u4ecd\u7136\u662f\u4e00\u4e2a\u957f\u671f\u5b58\u5728\u7684\u4e8b\u5b9e\u3002<br \/>\n<br \/>\nThat's why you should always code your applications to minimize network accesses and bandwidth. You can't assume the network is fast, so you should always plan for it to be slow. If your users happen to be on faster networks, then that's great \u2014 their experience will only improve. You want to avoid the inverse case though: applications that are usable some of the time, but frustratingly slow the rest based on where the user is at any given moment are likely to be unpopular.   <br \/>\n\u8fd9\u5c31\u662f\u4e3a\u4ec0\u4e48\u4f60\u5e94\u8be5\u6309\u7167\u6700\u5c0f\u5316\u7684\u7f51\u7edc\u8bbf\u95ee\u548c\u5e26\u5bbd\u6765\u7f16\u5199\u4f60\u7684\u4ee3\u7801\u3002\u4f60\u4e0d\u80fd\u5047\u8bbe\u7f51\u7edc\u662f\u5feb\u901f\u7684\uff0c\u6240\u4ee5\uff0c\u4f60\u5e94\u8be5\u603b\u662f\u8ba1\u5212\u5b83\u662f\u6162\u7684\u3002\u5982\u679c\u4f60\u7684\u7528\u6237\u78b0\u5de7\u5728\u4e00\u4e2a\u5feb\u901f\u7684\u7f51\u7edc\u4e0a\uff0c\u90a3\u5f88\u597d\u2014\u2014\u4ed6\u4eec\u7684\u7528\u6237\u4f53\u9a8c\u4f1a\u63d0\u5347\u3002\u4f60\u8981\u907f\u514d\u76f8\u53cd\u7684\u60c5\u5f62\uff1a\u5728\u4e0d\u540c\u7684\u5730\u70b9\u548c\u4e0d\u540c\u65f6\u95f4\uff0c\u5e94\u7528\u7a0b\u5e8f\u6709\u65f6\u53ef\u7528\uff0c\u6709\u65f6\u6162\u5f97\u4ee4\u4eba\u6293\u72c2\uff0c\u8fd9\u6837\u7684\u7a0b\u5e8f\u53ef\u80fd\u4e0d\u4f1a\u53d7\u6b22\u8fce\u3002<br \/>\n<br \/>\nOne potential gotcha here is that it's very easy to fall into this trap if you're using the emulator, since the emulator uses your desktop computer's network connection. That's almost guaranteed to be much faster than a cell network, so you'll want to change the settings on the emulator that simulate slower network speeds. You can do this in Eclipse, in the \"Emulator Settings\" tab of your launch configuration or via a <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/tools\/help\/emulator.html#netspeed\">command-line optionwhen<\/a> starting the emulator. <br \/>  \n\u8fd8\u6709\u4e00\u4e2a\u6f5c\u5728\u7684\u5730\u65b9\u662f\uff0c\u5982\u679c\u4f60\u6b63\u5728\u4f7f\u7528\u6a21\u62df\u5668\uff0c\u90a3\u4e48\u4f60\u5f88\u5bb9\u6613\u53d7\u5b83\u8ff7\u7cca\uff0c\u56e0\u4e3a\u6a21\u62df\u5668\u4f7f\u7528\u7535\u8111\u7684\u7f51\u7edc\u8fde\u63a5\u3002\u8fd9\u6bd4\u624b\u673a\u7f51\u7edc\u5feb\u5f88\u591a\uff0c\u6240\u4ee5\uff0c\u4f60\u9700\u8981\u4fee\u6539\u6a21\u62df\u5668\u8bbe\u5b9a\u6765\u6a21\u62df\u8f83\u4f4e\u7684\u7f51\u7edc\u901f\u5ea6\u3002\u4f60\u53ef\u4ee5\u5728Eclipse\u4e2d\u505a\u5230\u8fd9\u70b9\uff0c\u5728\u542f\u52a8\u9009\u9879\u7684\u6a21\u62df\u5668\u8bbe\u7f6e\u9875\u91cc\u8bbe\u7f6e\u6216\u8005\u5728\u542f\u52a8\u6a21\u62df\u5668\u65f6\u901a\u8fc7\u547d\u4ee4\u884c\u9009\u9879\u8bbe\u7f6e\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Don.27t_Assume_Touchscreen_or_Keyboard-.E4.B8.8D.E8.A6.81.E5.81.87.E5.AE.9A.E8.A7.A6.E6.91.B8.E5.B1.8F.E6.88.96.E9.94.AE.E7.9B.98\">Don't Assume Touchscreen or Keyboard-\u4e0d\u8981\u5047\u5b9a\u89e6\u6478\u5c4f\u6216\u952e\u76d8<\/span><\/h2>\n<p><br \/>\nAndroid will support a variety of handset form-factors. That's a fancy way of saying that some Android devices will have full \"QWERTY\" keyboards, while others will have 40-key, 12-key, or even other key configurations. Similarly, some devices will have touch-screens, but many won't. <br \/>\nAndroid\u53ef\u4ee5\u652f\u6301\u591a\u79cd\u5916\u89c2\u5f62\u72b6\u3002\u4e5f\u5c31\u662f\u8bf4\uff0c\u4e00\u4e9bAndroid\u8bbe\u5907\u62e5\u6709\u5168\u201cQWERTY\u201d\u952e\u76d8\uff0c\u800c\u5176\u5b83\u53ef\u80fd\u4f1a\u670940\u952e\u300112\u952e\u6216\u5176\u5b83\u952e\u76d8\u8bbe\u7f6e\u3002\u540c\u6837\u7684\uff0c\u4e00\u4e9b\u8bbe\u5907\u53ef\u80fd\u6709\u89e6\u6478\u5c4f\uff0c\u4f46\u4e00\u4e9b\u4e5f\u4f1a\u6ca1\u6709\u3002<br \/>\n<br \/>\nWhen building your applications, keep that in mind. Don't make assumptions about specific keyboard layouts -- unless, of course, you're really interested in restricting your application so that it can only be used on those devices. <br \/>\n\u5f53\u521b\u5efa\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u65f6\u5019\uff0c\u8bb0\u4f4f\u8fd9\u4e00\u70b9\u3002\u4e0d\u8981\u5047\u5b9a\u7279\u5b9a\u7684\u952e\u76d8\u5e03\u5c40\u2014\u2014\u9664\u975e\u4f60\u771f\u7684\u60f3\u9650\u5b9a\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u53ea\u8fd0\u884c\u5728\u67d0\u4e9b\u8bbe\u5907\u4e0a\u3002<br \/>\n<br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Do_Conserve_the_Device_Battery-.E8.8A.82.E7.9C.81.E8.AE.BE.E5.A4.87.E7.94.B5.E6.B1.A0\">Do Conserve the Device Battery-\u8282\u7701\u8bbe\u5907\u7535\u6c60<\/span><\/h2>\n<p><br \/>\nA mobile device isn't very mobile if it's constantly plugged into the wall. Mobile devices are battery-powered, and the longer we can make that battery last on a charge, the happier everyone is \u2014 especially the user. Two of the biggest consumers of battery power are the processor, and the radio; that's why it's important to write your applications to do as little work as possible, and use the network as infrequently as possible. <br \/> \n\u5982\u679c\u79fb\u52a8\u8bbe\u5907\u7ecf\u5e38\u63d2\u5728\u5899\u4e0a\uff0c\u90a3\u4e48\uff0c\u5b83\u4e5f\u5c31\u4e0d\u662f\u5f88\u201c\u79fb\u52a8\u201d\u3002\u79fb\u52a8\u8bbe\u5907\u662f\u7535\u6c60\u4f9b\u7535\u7684\uff0c\u5982\u679c\u6211\u4eec\u80fd\u8ba9\u6bcf\u6b21\u5145\u7535\u7684\u7535\u6c60\u4f7f\u7528\u5f97\u66f4\u6301\u4e45\u4e00\u4e9b\uff0c\u90a3\u4e48\u6bcf\u4e2a\u4eba\u90fd\u4f1a\u66f4\u52a0\u5f00\u5fc3\u2014\u2014\u5c24\u5176\u662f\u7528\u6237\u3002\u5176\u4e2d\u4e24\u5927\u8017\u7535\u786c\u4ef6\u662f\u5904\u7406\u5668\u548c\u65e0\u7ebf\uff1b\u8fd9\u4e5f\u5c31\u662f\u6211\u4eec\u4e3a\u4ec0\u4e48\u8981\u5199\u5c3d\u53ef\u80fd\u5c11\u505a\u5de5\u4f5c\u3001\u5c3d\u53ef\u80fd\u5c11\u53bb\u4f7f\u7528\u7f51\u7edc\u7684\u5e94\u7528\u7a0b\u5e8f\u7684\u91cd\u8981\u539f\u56e0\u3002<br \/>\n<br \/>\nMinimizing the amount of processor time your application uses really comes down to writing efficient code. To minimize the power drain from using the radio, be sure to handle error conditions gracefully, and only fetch what you need. For example, don't constantly retry a network operation if one failed. If it failed once, it's likely because the user has no reception, so it's probably going to fail again if you try right away; all you'll do is waste battery power. <br \/>\n\u5982\u4f55\u8ba9\u4f60\u7684\u5e94\u7528\u7a0b\u5e8f\u6700\u5c0f\u5316\u7684\u5360\u7528\u5904\u7406\u5668\uff0c\u5f52\u6839\u7ed3\u5e95\u8fd8\u662f\u8981\u5199\u9ad8\u6548\u4ee3\u7801\u3002\u4e3a\u4e86\u51cf\u5c11\u65e0\u7ebf\u7684\u7535\u91cf\u6d88\u8017\uff0c\u786e\u4fdd\u5bf9\u9519\u8bef\u6761\u4ef6\u8fdb\u884c\u6b63\u786e\u7684\u5904\u7406\uff0c\u5e76\u53ea\u83b7\u53d6\u4f60\u8981\u7684\u4e1c\u897f\u3002\u4f8b\u5982\uff0c\u5982\u679c\u67d0\u4e00\u4e2a\u7f51\u7edc\u64cd\u4f5c\u5931\u8d25\u4e86\uff0c\u4e0d\u8981\u4e0d\u65ad\u5730\u8fdb\u884c\u91cd\u8bd5\u3002\u5982\u679c\u5931\u8d25\u4e86\u4e00\u6b21\uff0c\u6709\u53ef\u80fd\u662f\u7528\u6237\u4e0d\u53d7\u6b22\u8fce\uff0c\u56e0\u6b64\uff0c\u5982\u679c\u4f60\u518d\u4ee5\u6b63\u786e\u7684\u65b9\u5f0f\u64cd\u4f5c\uff0c\u6709\u53ef\u80fd\u8fd8\u4f1a\u5931\u8d25\uff1b\u6240\u6709\u4f60\u505a\u7684\u90fd\u662f\u5728\u6d6a\u8d39\u7535\u6c60\u3002<br \/>\n<br \/>\nUsers are pretty smart: if your program is power-hungry, you can count on them noticing. The only thing you can be sure of at that point is that your program won't stay installed very long. <br \/>\n\u7528\u6237\u662f\u76f8\u5f53\u806a\u660e\u7684\uff1a\u5982\u679c\u4f60\u7684\u7a0b\u5e8f\u9ad8\u8017\u7535\uff0c\u4ed6\u4eec\u662f\u4e00\u5b9a\u4f1a\u53d1\u73b0\u7684\u3002\u5230\u90a3\u4e2a\u65f6\u70b9\uff0c\u4f60\u552f\u4e00\u53ef\u4ee5\u786e\u5b9a\u7684\u662f\uff0c\u4f60\u7684\u7a0b\u5e8f\u5c06\u5f88\u5feb\u88ab\u5378\u8f7d\u6389\u3002<br \/>\n<\/p>"}