{"title":"Designing for Multiple Screens","text":"<p>\u5206\u4efb\u52a1\u539f\u6587\u94fe\u63a5\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/training\/multiscreen\/index.html\">http:\/\/docs.eoeandroid.com\/training\/multiscreen\/index.html<\/a>\n<\/p><p>\u4f5c\u8005\uff1a\n<\/p><p>\u5b8c\u6210\u65f6\u95f4\uff1a\n<\/p>\n<h1> <span class=\"mw-headline\" id=\".E9.92.88.E5.AF.B9.E5.A4.9A.E7.A7.8D.E5.B1.8F.E5.B9.95.E8.BF.9B.E8.A1.8C.E8.AE.BE.E8.AE.A1\">\u9488\u5bf9\u591a\u79cd\u5c4f\u5e55\u8fdb\u884c\u8bbe\u8ba1<\/span><\/h1>\n<p>ndroid \u652f\u6301\u6570\u767e\u79cd\u5c4f\u5e55\u5c3a\u5bf8\u4e0d\u540c\u7684\u8bbe\u5907\uff0c\u5305\u62ec\u5c0f\u578b\u624b\u673a\u548c\u5927\u578b\u7535\u89c6\u673a\u3002\u56e0\u6b64\uff0c\u8bf7\u52a1\u5fc5\u5c06\u60a8\u7684\u5e94\u7528\u8bbe\u8ba1\u4e3a\u4e0e\u6240\u6709\u7684\u5c4f\u5e55\u5c3a\u5bf8\u517c\u5bb9\uff0c\u4ee5\u4fbf\u8ba9\u5c3d\u53ef\u80fd\u591a\u7684\u7528\u6237\u4f7f\u7528\u8be5\u5e94\u7528\u3002\n<\/p><p>\u4e0d\u8fc7\uff0c\u4e0e\u5404\u79cd\u7c7b\u578b\u7684\u8bbe\u5907\u517c\u5bb9\u8fd8\u8fdc\u8fdc\u4e0d\u591f\u3002\u7531\u4e8e\u5404\u79cd\u5c4f\u5e55\u5c3a\u5bf8\u5bf9\u7528\u6237\u4e92\u52a8\u4ea7\u751f\u7684\u5229\u5f0a\u6709\u6240\u4e0d\u540c\uff0c\u56e0\u6b64\u8981\u771f\u6b63\u6ee1\u8db3\u7528\u6237\u9700\u6c42\u5e76\u5e7f\u83b7\u597d\u8bc4\uff0c\u60a8\u7684\u5e94\u7528\u4e0d\u4ec5\u9700\u8981\u652f\u6301\u591a\u79cd\u5c4f\u5e55\uff0c\u8fd8\u5e94\u9488\u5bf9\u5404\u7c7b\u5c4f\u5e55\u914d\u7f6e\u7684\u7528\u6237\u4f53\u9a8c\u8fdb\u884c\u4f18\u5316\u3002\n<\/p><p>\u672c\u6559\u7a0b\u5c06\u5411\u60a8\u4ecb\u7ecd\u5982\u4f55\u9488\u5bf9\u591a\u79cd\u5c4f\u5e55\u914d\u7f6e\u4f18\u5316\u548c\u5b9e\u65bd\u76f8\u5e94\u7684\u7528\u6237\u754c\u9762\u3002\n<\/p><p>\u5404\u6559\u7a0b\u4e2d\u90fd\u63d0\u53ca\u4e86\u4e00\u79cd\u6765\u81ea\u4e00\u4e2a\u793a\u4f8b\u5e94\u7528\u7684\u4ee3\u7801\uff0c\u8be5\u5e94\u7528\u5c55\u793a\u4e86\u5173\u4e8e\u9488\u5bf9\u591a\u79cd\u5206\u8fa8\u7387\u8fdb\u884c\u4f18\u5316\u7684\u6700\u4f73\u5b9e\u8df5\u3002\u60a8\u53ef\u4ee5\u5728\u53f3\u4fa7\u4e0b\u8f7d\u8be5\u793a\u4f8b\uff0c\u5e76\u5728\u81ea\u5df1\u7684\u5e94\u7528\u5185\u91cd\u590d\u4f7f\u7528\u5176\u4e2d\u7684\u4ee3\u7801\u3002\n<\/p><p>\u8bf7\u6ce8\u610f\uff1a\u672c\u6559\u7a0b\u548c\u76f8\u5173\u7684\u793a\u4f8b\u4f7f\u7528\u4e86<a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/intl\/zh-CN\/tools\/extras\/support-library.html\">\u652f\u6301\u5e93<\/a>\uff0c\u4ee5\u4fbf\u5728 3.0 \u7248\u4ee5\u4e0b\u7684 Android \u4e0a\u4f7f\u7528 <a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/intl\/zh-CN\/reference\/android\/app\/Fragment.html\">Fragment<\/a> API\u3002\u56e0\u6b64\uff0c\u60a8\u9700\u8981\u4e0b\u8f7d\u8be5\u5e93\u5e76\u5c06\u5176\u6dfb\u52a0\u5230\u60a8\u7684\u5e94\u7528\uff0c\u624d\u80fd\u4f7f\u7528\u672c\u6559\u7a0b\u4e2d\u6d89\u53ca\u7684\u6240\u6709 API\u3002\n<\/p>\n<h2> <span class=\"mw-headline\" id=\".E6.95.99.E7.A8.8B\">\u6559\u7a0b<\/span><\/h2>\n<p><a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/intl\/zh-CN\/training\/multiscreen\/screensizes.html\">\u652f\u6301\u5404\u79cd\u5c4f\u5e55\u5c3a\u5bf8<\/a>\n<\/p>\n<pre>   \u672c\u6559\u7a0b\u5c06\u5411\u60a8\u4ecb\u7ecd\u5982\u4f55\u8bbe\u8ba1\u53ef\u9002\u5e94\u591a\u79cd\u5c4f\u5e55\u5c3a\u5bf8\u7684\u5e03\u5c40\uff08\u4f7f\u7528\u7075\u6d3b\u7684\u89c6\u56fe\u5c3a\u5bf8\u3001 RelativeLayout\u3001\u5c4f\u5e55\u5c3a\u5bf8\u548c\u5c4f\u5e55\u65b9\u5411\u9650\u5b9a\u7b26\u3001\u522b\u540d\u8fc7\u6ee4\u5668\u4ee5\u53ca\u81ea\u52a8\u62c9\u4f38\u4f4d\u56fe\uff09\u3002\n<\/pre>\n<p><a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/intl\/zh-CN\/training\/multiscreen\/screendensities.html\">\u652f\u6301\u5404\u79cd\u5c4f\u5e55\u5bc6\u5ea6<\/a>\n<\/p>\n<pre>   \u672c\u6559\u7a0b\u5c06\u5411\u60a8\u4ecb\u7ecd\u5982\u4f55\u652f\u6301\u5177\u6709\u4e0d\u540c\u50cf\u7d20\u5bc6\u5ea6\u7684\u5c4f\u5e55\uff08\u4f7f\u7528\u975e\u5bc6\u5ea6\u5236\u7ea6\u50cf\u7d20\u5e76\u63d0\u4f9b\u5404\u79cd\u5bc6\u5ea6\u7684\u76f8\u5e94\u4f4d\u56fe\uff09\u3002\n<\/pre>\n<p><a rel=\"nofollow\" target=\"_blank\" class=\"external text\" href=\"http:\/\/docs.eoeandroid.com\/intl\/zh-CN\/training\/multiscreen\/adaptui.html\">\u5b9e\u65bd\u81ea\u9002\u5e94\u7528\u6237\u754c\u9762\u6d41\u7a0b<\/a>\n<\/p>\n<pre>   \u672c\u6559\u7a0b\u5c06\u5411\u60a8\u4ecb\u7ecd\u5982\u4f55\u4ee5\u53ef\u9002\u5e94\u591a\u79cd\u5c4f\u5e55\u5c3a\u5bf8\/\u5c4f\u5e55\u5bc6\u5ea6\u7ec4\u5408\u7684\u65b9\u5f0f\u5b9e\u65bd\u7528\u6237\u754c\u9762\u6d41\u7a0b\uff08\u8fd0\u884c\u65f6\u5bf9\u5f53\u524d\u5e03\u5c40\u7684\u68c0\u6d4b\uff0c\u6839\u636e\u5f53\u524d\u5e03\u5c40\u505a\u51fa\u54cd\u5e94\uff0c\u5904\u7406\u5c4f\u5e55\u914d\u7f6e\u53d8\u5316\uff09\u3002\n<\/pre>"}