{"title":"Notifications","text":"<p>\u539f\u6587\u94fe\u63a5\uff1a<a rel=\"nofollow\" target=\"_blank\" class=\"external free\" href=\"http:\/\/docs.eoeandroid.com\/guide\/topics\/ui\/notifiers\/index.html\">http:\/\/docs.eoeandroid.com\/guide\/topics\/ui\/notifiers\/index.html<\/a>\n<\/p><p>\u7ffb\u8bd1\uff1a<font color=\"#A52A2A\">Gavin Zhuang<\/font>\n<\/p><p>\u66f4\u65b0\uff1a2012.06.08\n<\/p>\n<hr \/>\n<table id=\"toc\" class=\"toc\"><tr><td><div id=\"toctitle\"><h2>\u76ee\u5f55<\/h2><\/div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#.E9.80.9A.E7.9F.A5_-_Notifications\"><span class=\"tocnumber\">1<\/span> <span class=\"toctext\">\u901a\u77e5 - Notifications<\/span><\/a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Toast_.E9.80.9A.E7.9F.A5\"><span class=\"tocnumber\">1.1<\/span> <span class=\"toctext\">Toast \u901a\u77e5<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#.E7.8A.B6.E6.80.81.E6.A0.8F.E9.80.9A.E7.9F.A5\"><span class=\"tocnumber\">1.2<\/span> <span class=\"toctext\">\u72b6\u6001\u680f\u901a\u77e5<\/span><\/a><\/li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#.E5.AF.B9.E8.AF.9D.E6.A1.86.E9.80.9A.E7.9F.A5\"><span class=\"tocnumber\">1.3<\/span> <span class=\"toctext\">\u5bf9\u8bdd\u6846\u901a\u77e5<\/span><\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/td><\/tr><\/table>\n<h1> <span class=\"mw-headline\" id=\".E9.80.9A.E7.9F.A5_-_Notifications\"> <b>\u901a\u77e5 - Notifications<\/b> <\/span><\/h1>\n<p>\u5728\u67d0\u4e9b\u60c5\u51b5\u4e0b\uff0c\u53ef\u80fd\u9700\u8981\u4f60\u53bb\u901a\u77e5\u7528\u6237\u53d1\u751f\u5728\u4f60\u5e94\u7528\u4e2d\u7684\u4e8b\u4ef6\uff0c\u5176\u4e2d\u4e00\u4e9b\u4e8b\u4ef6\u9700\u8981\u7528\u6237\u54cd\u5e94\uff0c\u6709\u7684\u5219\u4e0d\u9700\u8981\u3002\u4f8b\u5982\uff1a\n<\/p>\n<dl><dd><ul><li>\u5f53\u4e00\u4e2a\u4e8b\u4ef6\u5b8c\u6210\u65f6\uff08\u6bd4\u5982\u4fdd\u5b58\u4e00\u4e2a\u6587\u4ef6\uff09\uff0c\u5219\u9700\u8981\u663e\u793a\u4e00\u4e2a\u7b80\u77ed\u7684\u6d88\u606f\u6765\u786e\u8ba4\u4fdd\u5b58\u6210\u529f\u3002\n<\/li><\/ul>\n<\/dd><\/dl>\n<dl><dd><ul><li>\u5047\u5982\u5e94\u7528\u6b63\u5728\u540e\u53f0\u8fd0\u884c\u4e14\u9700\u8981\u7528\u6237\u6ce8\u610f\uff0c\u90a3\u4e48\u8be5\u5e94\u7528\u9700\u8981\u521b\u5efa\u4e00\u4e2a\u901a\u77e5\u4ee5\u65b9\u4fbf\u7528\u6237\u505a\u51fa\u54cd\u5e94\u3002\n<\/li><\/ul>\n<\/dd><\/dl>\n<dl><dd><ul><li>\u5047\u5982\u5e94\u7528\u6b63\u5728\u6267\u884c\u67d0\u4e2a\u52a8\u4f5c\uff08\u6bd4\u5982\u6b63\u5728\u8f7d\u5165\u4e00\u4e2a\u6587\u4ef6\uff09\u4e14\u9700\u8981\u7528\u6237\u7b49\u5f85\uff0c\u90a3\u4e48\u8be5\u5e94\u7528\u9700\u8981\u663e\u793a\u4e00\u4e2a\u65cb\u8f6c\u7684\u8fdb\u5ea6\u6761\u6765\u8868\u793a\u8fd9\u4e2a\u8fc7\u7a0b\u3002\n<\/li><\/ul>\n<\/dd><\/dl>\n<p>\u4ee5\u4e0a\u8fd9\u4e9b\u901a\u77e5\u4efb\u52a1\uff0c\u6bcf\u4e00\u4e2a\u90fd\u53ef\u4ee5\u7528\u4e0d\u540c\u7684\u6280\u672f\u6765\u5b9e\u73b0\uff1a\n<\/p>\n<dl><dd><ul><li><a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#Toast_.E9.80.9A.E7.9F.A5\" title=\"Notifications\">Toast\u901a\u77e5<\/a>\uff0c\u662f\u4ece\u540e\u53f0\u542f\u7528\u4e00\u4e2a\u7b80\u77ed\u7684\u6d88\u606f\uff1b\n<\/li><\/ul>\n<\/dd><\/dl>\n<dl><dd><ul><li><a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#.E7.8A.B6.E6.80.81.E6.A0.8F.E9.80.9A.E7.9F.A5\" title=\"Notifications\">\u72b6\u6001\u680f\u901a\u77e5<\/a>\uff0c\u662f\u6765\u81ea\u540e\u53f0\u7684\u6301\u7eed\u63d0\u9192\u4e14\u9700\u8981\u7528\u6237\u54cd\u5e94\uff1b\n<\/li><\/ul>\n<\/dd><\/dl>\n<dl><dd><ul><li><a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#.E5.AF.B9.E8.AF.9D.E6.A1.86.E9.80.9A.E7.9F.A5\" title=\"Notifications\">\u5bf9\u8bdd\u6846\u901a\u77e5<\/a>\uff0c\u662f\u4e00\u79cd\u4e0eActivity\uff08\u6d3b\u52a8\uff09\u76f8\u5173\u7684\u901a\u77e5\u3002\n<\/li><\/ul>\n<\/dd><\/dl>\n<p>\u8fd9\u4efd\u6587\u6863\u5305\u62ec\u4e86\u8fd9\u4e9b\u901a\u77e5\u7528\u6237\u7684\u76f8\u5173\u6280\u672f\u7684\u4ecb\u7ecd\u4ee5\u53ca\u5b8c\u6574\u6587\u6863\u7684\u94fe\u63a5\u3002\n<\/p><p><br \/>\n<\/p>\n<h2> <span class=\"mw-headline\" id=\"Toast_.E9.80.9A.E7.9F.A5\"> <b>Toast \u901a\u77e5<\/b> <\/span><\/h2>\n<table style=\"border-spacing: 0px;margin: 4px 4px; width: 70%;\">\n\n<tr style=\"vertical-align:top;\">\n<td style=\"width:auto;\">\n<p>Toast\u901a\u77e5\u662f\u4e00\u79cd\u6d6e\u73b0\u5728\u5c4f\u5e55\u4e0a\u5c42\u7684\u6d88\u606f\u63d0\u9192\uff0c\u5b83\u53ea\u586b\u5145\u6d88\u606f\u6240\u9700\u8981\u7684\u7a7a\u95f4\uff0c\u800c\u5f53\u524d\u6b63\u5728\u8fd0\u884c\u7684\u6d3b\u52a8\u4ecd\u7136\u4fdd\u6301\u5176\u81ea\u8eab\u7684\u53ef\u89c1\u6027\u548c\u4ea4\u4e92\u6027\u3002\u8fd9\u79cd\u901a\u77e5\u81ea\u52a8\u6de1\u5165\u6de1\u51fa\u4e14\u4e0d\u63a5\u53d7\u4ea4\u4e92\u4e8b\u4ef6\uff0c\u56e0\u4e3a\u5b83\u662f\u7531\u540e\u53f0\u670d\u52a1\u521b\u5efa\u7684\uff0c\u6240\u4ee5\u5373\u65f6\u5e94\u7528\u4e0d\u53ef\u89c1\u4e86\u5b83\u4ecd\u7136\u80fd\u591f\u663e\u793a\u3002\n<\/p><p>\u5f53\u4f60\u5b8c\u5168\u5c06\u6ce8\u610f\u529b\u96c6\u4e2d\u5728\u5c4f\u5e55\u4e0a\u65f6\uff0c\u90a3\u4e48Toast\u901a\u77e5\u662f\u6700\u597d\u7684\u63d0\u793a\u7b80\u77ed\u6d88\u606f\u7684\u65b9\u5f0f\uff08\u4f8b\u5982\u6587\u4ef6\u4fdd\u5b58\u6210\u529f\u63d0\u9192\uff09\u3002\u8fd9\u79cd\u901a\u77e5\u4e0d\u63a5\u53d7\u7528\u6237\u7684\u4ea4\u4e92\u4e8b\u4ef6\uff0c\u4f46\u5047\u5982\u4f60\u60f3\u8ba9\u7528\u6237\u53bb\u54cd\u5e94\u548c\u505a\u51fa\u52a8\u4f5c\uff0c\u4f60\u53ef\u4ee5\u8003\u8651\u4f7f\u7528<a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#.E7.8A.B6.E6.80.81.E6.A0.8F.E9.80.9A.E7.9F.A5\" title=\"Notifications\">\u72b6\u6001\u680f\u901a\u77e5<\/a>\u6765\u4ee3\u66ff\u3002\n<\/p><p>\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605<a href=\"http:\/\/wiki.eoeandroid.com\/Toast_Notifications\" title=\"Toast Notifications\">Toast\u901a\u77e5<\/a>\u3002\n<\/p>\n<\/td>\n<td style=\"width:250px;text-align:center;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/images\/toast.png\" alt=\"toast.png\" \/>\n<\/p>\n<\/td><\/tr><\/table>\n<h2> <span class=\"mw-headline\" id=\".E7.8A.B6.E6.80.81.E6.A0.8F.E9.80.9A.E7.9F.A5\"> <b>\u72b6\u6001\u680f\u901a\u77e5<\/b> <\/span><\/h2>\n<table style=\"border-spacing: 0px;margin: 4px 4px; width: 70%;\">\n\n<tr style=\"vertical-align:top;\">\n<td style=\"width:auto;\">\n<p>\u72b6\u6001\u680f\u901a\u77e5\u662f\u5c06\u56fe\u6807\u6dfb\u52a0\u5230\u7cfb\u7edf\u7684\u72b6\u6001\u680f\uff08\u5e26\u6709\u4e00\u4e2a\u53ef\u9009\u7684\u6eda\u52a8\u6587\u672c\u6d88\u606f\uff09\uff0c\u540c\u65f6\u5c06\u6269\u5c55\u4fe1\u606f\u6dfb\u52a0\u5230\u201c\u901a\u77e5\u201d\u7a97\u53e3\u3002\u5f53\u7528\u6237\u9009\u62e9\u8fd9\u4e2a\u6269\u5c55\u4fe1\u606f\u65f6\uff0c\u5b89\u5353\u8bbe\u5907\u5c06\u89e6\u53d1\u4e00\u4e2a\u7531\u901a\u77e5\u5b9a\u4e49\u7684Intent\uff08\u901a\u5e38\u662f\u8f7d\u5165\u4e00\u4e2a\u6d3b\u52a8\uff09\u3002\u4f60\u8fd8\u53ef\u4ee5\u4e3a\u8fd9\u4e2a\u901a\u77e5\u914d\u7f6e\u58f0\u97f3\u3001\u9707\u52a8\u4ee5\u53ca\u95ea\u5149\u706f\u6765\u63d0\u9192\u7528\u6237\u3002\n<\/p><p>\u8fd9\u79cd\u6a21\u5f0f\u7684\u901a\u77e5\u662f\u5728\u5f53\u4f60\u7684\u5e94\u7528\u8fd0\u884c\u5728\u540e\u53f0\u670d\u52a1\u4e2d\u4e14\u9700\u8981\u7528\u6237\u6ce8\u610f\u5230\u8fd9\u4e2a\u4e8b\u4ef6\u65f6\u4f7f\u7528\u7684\u3002\u5047\u5982\u4f60\u9700\u8981\u63d0\u9192\u7528\u6237\u6b63\u5728\u53d1\u751f\u7684\u4e8b\u4ef6\uff0c\u4e14\u8fd9\u4e2a\u4e8b\u4ef6\u6b63\u6301\u7eed\u8fdb\u884c\u65f6\uff0c\u4f60\u53ef\u4ee5\u8003\u8651\u4f7f\u7528<a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#.E5.AF.B9.E8.AF.9D.E6.A1.86.E9.80.9A.E7.9F.A5\" title=\"Notifications\">\u5bf9\u8bdd\u6846\u901a\u77e5<\/a>\u6765\u4ee3\u66ff\u3002\n<\/p><p>\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605<a href=\"http:\/\/wiki.eoeandroid.com\/Status_Bar_Notifications\" title=\"Status Bar Notifications\">\u72b6\u6001\u680f\u901a\u77e5<\/a>\u3002\n<\/p><p><br \/>\n<\/p>\n<\/td>\n<td style=\"width:250px;text-align:center;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/images\/notifications_window.png\" alt=\"notifications_window.png\" \/>\n<\/p>\n<\/td><\/tr><\/table>\n<h2> <span class=\"mw-headline\" id=\".E5.AF.B9.E8.AF.9D.E6.A1.86.E9.80.9A.E7.9F.A5\"> <b>\u5bf9\u8bdd\u6846\u901a\u77e5<\/b> <\/span><\/h2>\n<table style=\"border-spacing: 0px;margin: 4px 4px; width: 70%;\">\n\n<tr style=\"vertical-align:top;\">\n<td style=\"width:auto;\">\n<p>\u5bf9\u8bdd\u6846\u901a\u5e38\u662f\u4e00\u79cd\u663e\u793a\u5728\u5f53\u524d\u6d3b\u52a8\u4e4b\u4e0a\u7684\u5c0f\u7a97\u53e3\uff0c\u8fd9\u65f6\u5019\u4e0b\u5c42\u7684\u6d3b\u52a8\u5c06\u5931\u53bb\u7126\u70b9\uff0c\u4e14\u5bf9\u8bdd\u6846\u53ef\u4ee5\u63a5\u53d7\u4efb\u4f55\u5f62\u5f0f\u7684\u7528\u6237\u4ea4\u4e92\u65b9\u5f0f\u3002\u4e00\u822c\u6765\u8bf4\u5bf9\u8bdd\u6846\u662f\u7528\u4e8e\u901a\u77e5\u6216\u8005\u7528\u4e8e\u76f4\u63a5\u5173\u7cfb\u5230\u5e94\u7528\u8fdb\u7a0b\u7684\u77ed\u671f\u6d3b\u52a8\u3002\n<\/p><p>\u5f53\u4f60\u9700\u8981\u663e\u793a\u4e00\u4e2a\u8fdb\u5ea6\u6761\u6216\u8005\u4e00\u4e2a\u9700\u8981\u7528\u6237\u786e\u8ba4\u7684\u77ed\u6d88\u606f\uff08\u4f8b\u5982\u5e26\u6709\u201c\u786e\u5b9a\u201d\u548c\u201c\u53d6\u6d88\u201d\u6309\u94ae\u7684\u63d0\u9192\uff09\u65f6\uff0c\u4f60\u53ef\u4ee5\u5229\u7528\u5bf9\u8bdd\u6846\u6765\u5b9e\u73b0\u3002\u4f60\u8fd8\u53ef\u4ee5\u628a\u5b83\u5f53\u4f5c\u5e94\u7528\u7684\u7528\u6237\u754c\u9762\u548c\u9664\u4e86\u901a\u77e5\u4ee5\u5916\u5176\u4ed6\u76ee\u7684\u7684\u4ea4\u4e92\u5143\u4ef6\u3002\u6240\u6709\u53ef\u7528\u7c7b\u578b\u7684\u5bf9\u8bdd\u6846\uff08\u5305\u62ec\u7528\u4e8e\u901a\u77e5\uff09\u7684\u5b8c\u6574\u8ba8\u8bba\uff0c\u8bf7\u53c2\u9605<a href=\"http:\/\/wiki.eoeandroid.com\/Dialogs\" title=\"Dialogs\">\u5bf9\u8bdd\u6846<\/a>\u3002\n<\/p><p><br \/>\n<\/p>\n<\/td>\n<td style=\"width:250px;text-align:center;\">\n<p><img src=\"http:\/\/docs.eoeandroid.com\/images\/dialog_progress_spinning.png\" alt=\"dialog_progress_spinning.png\" \/>\n<\/p>\n<\/td><\/tr>\n<tr style=\"vertical-align:top;\">\n<td style=\"width:auto; text-align:right;\">\n<p><a href=\"http:\/\/wiki.eoeandroid.com\/Notifications#top\" title=\"Notifications\">\u2191\u8fd4\u56de\u9876\u90e8<\/a>\n<\/p>\n<\/td>\n<td style=\"width:250px;align:right;\">\n<\/td><\/tr>\n<tr style=\"vertical-align:top;\">\n<td style=\"width:auto; text-align:left;\">\n<p><a href=\"http:\/\/wiki.eoeandroid.com\/User_Interface\" title=\"User Interface\">\u2190\u8fd4\u56de\u7528\u6237\u63a5\u53e3<\/a>\n<\/p>\n<\/td>\n<td style=\"width:250px;align:right;\">\n<\/td><\/tr><\/table>"}